Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: ru

source: **Preserve Painted Areas**, when activated, includes all the colors in the converted level.
ru: **Сохранять окрашенные области**, когда активировано, включает в себя все цвета в преобразованном уровне.

source: **Adherence** sets how much smooth curves bend toward full corners.
ru: **Смачивание** устанавливает, насколько гладкие изгибы изгибаются к полным углам.

source: **Angle** sets the angular threshold below which full corners are inserted in the image
ru: **Угол** устанавливает угловой порог, ниже которого в изображение вставляются полные углы

source: **Curve Radius** sets the measure of a curve's radius below which it is replaced by a smooth corner
ru: **Радиус кривой** устанавливает меру радиуса кривой, ниже которой он заменяется гладким углом

source: **Max Colors** defines the maximum number of colors that are considered in the Raster image and used in the vector one. The value has to be set taking care of the real number of colors used in the Raster image. High values increase the time needed for the conversion. This is relevant for Raster levels only.
ru: **Макс. цвета** определяет максимальное количество цветов, которые рассматриваются в растровом изображении и используются в векторном. Значение должно быть установлено с учетом реального количества цветов, используемых в растровом изображении. Высокие значения увеличивают время, необходимое для преобразования. Это относится только к растровым уровням.

source: **Transparent Color** defines the color that has to be set as the transparent background of the resulting vector level. This is relevant for Raster levels only.
ru: **Прозрачный цвет** определяет цвет, который должен быть установлен как прозрачный фон результирующего векторного уровня. Это относится только к растровым уровням.

source: **Tone Threshold** sets the value of the darkest pixels to be taken into account to detect lines to be converted to vector; for low values only the darkest pixels are considered thus resulting in thinner lines; for high values lighter pixels are considered too, thus resulting in thicker lines. This is relevant for Toonz Raster levels only.
ru: **Порог тона** устанавливает значение самых темных пикселов, которые необходимо учитывать для обнаружения линий, которые необходимо преобразовать в вектор; для низких значений учитываются только самые темные пикселы, что приводит к получению более тонких линий; для высоких значений также учитываются более светлые пикселы, что приводит к более толстым линиям. Это применимо только к уровням Toonz Raster.

source: In **Centerline** mode the following settings are available:
ru: В режиме **Сплошная линия** доступны следующие настройки:

source: **Threshold** sets the value of the darkest pixels to be taken into account to detect lines to be converted to vector strokes; for low values only the darkest pixels are considered thus resulting in thinner strokes; for high values lighter pixels are considered too, thus resulting in thicker strokes. For Toonz Raster levels (TLV files) the process examines only pixels belonging to the lines; for Raster levels it examines pixels of the whole image.
ru: **Предел** устанавливает значение самых темных пикселов, которые необходимо учитывать при обнаружении линий, которые необходимо преобразовать в векторные штрихи; для низких значений учитываются только самые темные пикселы, что приводит к более тонким штрихам; для высоких значений также учитываются более светлые пикселы, что приводит к более толстым штрихам. Для уровней Toonz Raster (файлы TLV) процесс проверяет только пикселы, принадлежащие линиям; для растровых уровней он проверяет пикселы всего изображения.

source: **Accuracy** sets how much the vector stroke will follow the shape of the original drawing lines. High values create more precise strokes but makes them more complex.
ru: **Точность** устанавливает, насколько векторная черта будет повторять форму исходных линий рисования. Высокие значения создают более точные штрихи, но делают их более сложными.

source: **Despeckling** ignores during the conversion small areas generated by the image noise; the higher the value, the larger the areas ignored.
ru: **Удаление соринок** игнорирует при преобразовании небольшие участки, создаваемые шумом изображения; чем выше значение, тем больше игнорируемых областей.

source: **Max Thickness** sets the maximum vector stroke thickness; if this value is low very thick lines will be converted in two centerline strokes defining the line outline; if this value is high, they will be converted in a single centerline stroke.
ru: **Максимальная толщина** устанавливает максимальную толщину векторного хода; если это значение низкое, очень толстые линии будут преобразованы в два штриха по центральной линии, определяющих контур линии; если это значение высокое, они будут преобразованы в один штрих по центральной линии.

source: **Thickness Calibration Start:** and **End:** calibrates the vector stroke thickness defined according to the **Threshold** value; a low value will reduce the stroke thickness preserving its integrity. A different value inserted in the **Start** / **End** field determines an animation of the thickness along the length of the level.
ru: **Калибровка толщины: Начало** и **Конец:** калибрует толщину векторного хода, определенную в соответствии со значением **Предел**; низкое значение уменьшит толщину хода, сохраняя его целостность. Другое значение, вставленное в поле **Начало**/**Конец**, определяет анимацию толщины по длине уровня.

source: **Preserve Painted Areas**, when activated, preserves all painted areas in Toonz Raster levels (TLV files) and all the areas painted with colors different from the line color in Raster levels.
ru: **Сохранять окрашенные области**, при активации сохраняет все закрашенные области на уровнях Toonz Raster (файлы TLV) и все области, закрашенные цветами, отличными от цвета линий на уровнях растра.

source: **Add Border** adds a vector stroke along the image border in order to detect also areas bleeding off the image edge.
ru: **Добавить кайму** добавляет векторную обводку вдоль границы изображения, чтобы обнаружить также области, кровоточащие у края изображения.

source: **Enhanced ink recognition**, when activated, allows to vectorize Raster images (such as TGA, TIF, PNG etc...) without antialiasing along the lines. An heuristic is used to recognize lines and painted areas creating a PLI level, where the lines are seen as ink and the painted areas as paint.
ru: **Улучшенное распознавание контура**, когда активировано, позволяет векторизовать растровые изображения (такие как TGA, TIF, PNG и т.д.) Без сглаживания вдоль линий. Эвристика используется для распознавания линий и окрашенных областей, создающих уровень PLI, где линии видны как чернила, а окрашенные области - как краска.

source: It's possible to select the images or the level frames that have to be converted directly in the Xsheet/Timeline.
ru: Можно выбрать изображения или рамки уровня, которые необходимо преобразовать непосредственно в Xsheet / Timeline.

source: When a conversion is performed, a new level is created according to the selection you made, and exposed in the Xsheet/Timeline in the next column/layer to that containing the source level. The new file will have the same name of the starting one, but with a PLI extension, and a “v” suffix, and is saved in the **+drawings** default folder.
ru: Когда преобразование выполнено, новый уровень создается в соответствии с выбранным вами выбором и отображается в Xsheet / Timeline в следующем столбце / слое для уровня, содержащего исходный уровень. Новый файл будет иметь то же имя, что и начальный, но с расширением PLI и суффиксом «v», и будет сохранен в папке по умолчанию **+drawings**.

source: In case a PLI level with the same name already exists, the name of the new file will be followed by a progressive number.
ru: Если уровень PLI с таким именем уже существует, за именем нового файла будет следовать прогрессивный номер.

source: **To convert raster drawings into vectors:**
ru: **Если уровень PLI с таким именем уже существует, за именем нового файла будет следовать прогрессивный номер:**

source: Select the level frames to convert in the Xsheet/Timeline.
ru: Выберите кадры уровня для преобразования в Xsheet/Timeline.

source: Choose Level → **Convert to Vectors...**
ru: Выберите Уровень → **Конвектировать в вектор...**

source: In the dialog set parameters for the conversion.
ru: В диалоговом окне задайте параметры для конвертации.

source: Click the **Convert** button.
ru: Нажмите кнопку **Конвертировать**.

source: Checking the Convert to Vectors Process
ru: Проверка процесса преобразования в вектор

source: At the bottom of the **Convert-to-Vectors Settings** window a preview area is available to display the drawing selected in the Xsheet/Timeline, as it will be after the conversion according to the defined settings. At the same time it allows you to compare the final result with the original Raster drawing that is displayed on the left side, and to highlight the vector strokes structure by clicking the **Centerlines Check** button (|check|).
ru: В нижней части окна **Параметры преобразования в вектор** доступна область предварительного просмотра для отображения рисунка, выбранного на Xsheet/Timeline, как это будет после преобразования в соответствии с заданными настройками. В то же время он позволяет сравнивать конечный результат с исходным растровым рисунком, отображаемым слева, и выделять структуру векторных штрихов, нажав кнопку **Проверка сплошной линии** (|check|).

source: You can activate or deactivate it, resize it or navigate its content.
ru: Вы можете активировать или деактивировать его, изменить его размер или перемещаться по его содержимому.

source: If you change any parameter in the **Convert-to-Vector Settings**, the previewed drawing automatically updates to display how the changes affect the result.
ru: Если вы измените какой-либо параметр в **Настройках конвертации в вектор**, предварительно просматриваемый рисунок автоматически обновится, чтобы показать, как изменения влияют на результат.

source: **To activate the preview area:**
ru: **Чтобы активировать область предварительного просмотра:**

source: In the Xsheet/Timeline select the drawing you want to preview.
ru: В Xsheet/Timeline выберите рисунок, который вы хотите просмотреть.

source: Click the **Preview** button (|preview|) in the bottom bar of the Convert-to-Vector Settings window.
ru: Нажмите кнопку **Переключить просмотр образцов** (|preview|) в нижней панели окна «Настройки конвертации в вектор».

source: **To deactivate the preview area:**
ru: **Чтобы отключить область предварительного просмотра:**

source: **To resize the preview area:**
ru: **Чтобы изменить размер области предварительного просмотра:**

source: Do any of the following:
ru: Выполните любое из следующих действий:

source: Click and drag the horizontal separator.
ru: Нажмите и перетащите горизонтальный разделитель.

source: Click and drag the separator toward the window border to hide the preview area.
ru: Нажмите и перетащите разделитель к границе окна, чтобы скрыть область предварительного просмотра.

source: Click and drag the separator collapsed to the window border toward the window center to display again the preview area.
ru: Нажмите и перетащите разделитель, свернутый к границе окна, к центру окна, чтобы снова отобразить область предварительного просмотра.

source: **To navigate the preview area:**
ru: **Для навигации по области предварительного просмотра:**

source: Use the mouse wheel, or the zoom shortcut keys (by default + and - keys) to zoom in and zoom out.
ru: Используйте колесико мыши или сочетания клавиш увеличения (по умолчанию клавиши + и -) для увеличения или уменьшения масштаба.

source: Middle-click and drag to scroll in any direction.
ru: Нажмите среднюю кнопку мыши и перетащите, чтобы прокрутить в любом направлении.

source: Use the reset view shortcut (by default the 0 key) to display preview at its actual size
ru: Используйте горячую клавишу сброса (по умолчанию клавиша 0), чтобы отобразить предварительный просмотр в его реальном размере

source: **To activate and deactivate the Centerlines Check:**
ru: **Чтобы активировать и деактивировать Проверку сплошной линии:**

source: Click the **Centerlines Check** button (|check|) in the bottom bar of the Convert-to-Vector Settings window.
ru: Нажмите кнопку **Переключить проверку сплошной линии** (|check|) в нижней части окна «Настройки конвертации в вектор».

source: Saving and Loading Convert To Vector Settings
ru: Сохранение и загрузка настроек конвертации в вектор

source: Convert To Vector settings can be saved as *tnzsettings* files in order to have different settings for each level and to be loaded back and used in a different scene.
ru: Настройки конвертации в вектор могут быть сохранены в виде *tnzsettings* файлов, чтобы иметь разные настройки для каждого уровня и быть загруженными обратно и использоваться в другой сцене.

source: Loaded Convert To Vector settings can also become the default settings for the scene or for the project (see :ref:`Scene Settings and Project Default Settings <scene_settings_and_project_default_settings>` ).
ru: Загруженные настройки конвертации в вектор также можно назначить настройками по умолчанию для сцены или проекта (см. :ref:`Настройки сцены и Настройки проекта по умолчанию <scene_settings_and_project_default_settings>`).

source: **To save the Convert To Vector settings:**
ru: **Чтобы сохранить настройки конвертации в вектор:**

source: Click the **Save Settings** button (|save|) in the bottom bar of the Convert-to-Vector Settings window.
ru: Нажмите кнопку **Сохранить настройки** (|save|) в нижней части окна «Настройки конвертации в вектор».

source: In the browser that opens choose for the *tnzsettings* file a location and a name, and click the **Save** button.
ru: В открывшемся браузере выберите для файла *tnzsettings* местоположение и имя и нажмите кнопку **Сохранить**.

source: **To load saved Convert To Vector settings:**
ru: **Для загрузки сохраненных настроек конвертации в вектор:**

source: Click the **Load Settings** button (|load|) in the bottom bar of the Convert-to-Vector Settings window.
ru: Нажмите кнопку **Загрузить изменения** (|load|) в нижней панели окна «Настройки конвертации в вектор».

source: In the browser that opens retrieve the *tnzsettings* file you want to load, and click the **Load** button.
ru: В открывшемся браузере найдите файл *tnzsettings*, который вы хотите загрузить, и нажмите кнопку **Загрузить**.

source: **To reset the Convert To Vector settings to the scene default:**
ru: **Для сброса настроек конвертации в вектор по умолчанию в сцене:**

source: Click the **Reset Settings** button (|reset|) in the bottom bar of the Convert-to-Vector Settings window.
ru: Нажмите кнопку **Сбросить настройки** (|reset|) в нижней части окна Конвертации в вектор.

source: Changing the Canvas Size
ru: Изменение размера холста

source: It's possible to change the size of Toonz Raster and Raster levels, in order to increase or decrease the area around the images of a level.
ru: Можно изменить размер уровней Toonz Raster и Raster, чтобы увеличить или уменьшить область вокруг изображений уровня.

source: The new size can be set in any unit supported by OpenToonz, by using absolute or relative values. If the canvas is enlarged, some white transparent area is added; if the canvas is reduced, some cropping is applied to the level images.
ru: Новый размер может быть установлен в любой единице, поддерживаемой OpenToonz, используя абсолютные или относительные значения. Если холст увеличивается, добавляется некоторая белая прозрачная область; если холст уменьшен, некоторая обрезка применяется к изображениям уровня.

source: **To change the canvas size:**
ru: **Чтобы изменить размер холста:**

source: Select the Toonz Raster or Raster level you want to modify in the Xsheet/Timeline.
ru: Выберите уровень Toonz Raster или Raster, который вы хотите изменить, в Xsheet / Timeline.

source: Choose Level → **Canvas Size...**, the Canvas Size dialog opens.
ru: Выберите Уровень → **Размер холста...**, откроется диалоговое окно Размер холста.

source: In the dialog set the **Unit** to express the new size of the canvas, and set the **Width** and **Height** of the new canvas; activate the **Relative** option to define the new size by specifying only the size the canvas has to increase or decrease.
ru: В диалоговом окне установите **Ед. изм**, чтобы выразить новый размер холста, и установите **Ширина** и **Высота** нового холста; активируйте параметр **Относительный**, чтобы определить новый размер, указав только размер, который холст должен увеличивать или уменьшать.

source: Use the **Anchor** diagram to decide the position of the current canvas in the new one: the arrows are a reference to see how the new size will increase or decrease the current canvas size.
ru: Используйте диаграмму **Анкер**, чтобы определить положение текущего холста на новом: стрелки представляют собой ссылку, чтобы увидеть, как новый размер увеличит или уменьшит текущий размер холста.

source: Click the **Resize** button.
ru: Нажмите кнопку **Изменить размер**.

source: In case the new canvas size is smaller than the current one, a confirmation dialog will open, asking you whether you want to crop the canvas.
ru: Если новый размер холста меньше текущего, откроется диалоговое окно подтверждения с вопросом, хотите ли вы обрезать холст.

source: Editing Drawings
ru: Редактирование рисунка

source: Toonz Vector, Toonz Raster and Raster levels, can be manipulated in OpenToonz.
ru: Уровнями Toonz Vector, Toonz Raster и Raster можно манипулировать в OpenToonz.

source: To edit a drawing, for example to copy a part of it, you have first to select it in the Xsheet/Timeline or in the Level Strip. When selected in the Xsheet/Timeline, the viewer displays the whole scene contents at the current frame, when selected in the Level Strip, the viewer displays the selected frame of the current animation level only, to let you work more easily on it.
ru: Чтобы отредактировать рисунок, например скопировать его часть, сначала выделите в Xsheet/Timeline или в Level Strip. При выделении в Xsheet/Timeline, вьювер отображает все содержимое сцены в текущем кадре, при выделении Level Strip, вьювер отображает только выбранный кадр текущего уровня анимации, чтобы позволить вам работать болееe удобно.

source: Drawings can be also selected directly in the viewer: this allows you to work on the different drawings visible at a certain frame with no need to retrieve them in the Xsheet/Timeline or Level Strip.
ru: Рисунки также могут быть выбраны непосредственно в программе просмотра: это позволяет вам работать над различными рисунками, видимыми в определенном кадре без необходимости извлекать их в Xsheet/Timeline или Level Strip.

source: All the editing performed on drawings is not saved until you save the related level, or use the **Save All** command (see :ref:`Saving Levels <saving_levels>` ).
ru: Все ваше редактирование рисунка не сохраняется пока вы не сохраните соответствующий уровень, или не используете команду **Сохранить все** (см. :ref:`Сохранение уровней <saving_levels>` ).

source: **To select the drawing to edit:**
ru: **Чтобы выбрать рисунок для редактирования:**

source: Select it in the Xsheet/Timeline or Level Strip.
ru: Выберите его в Xsheet / Timeline или Level Strip.

source: Right-click in the viewer the drawing you want to edit and in the menu that opens choose the **Select** command related to the column containing the drawing you want to edit.
ru: Щелкните правой кнопкой мыши во вьювере рисунок, который вы хотите редактировать, и в открывшемся меню, выберите команду **Select**, относящуюся к столбцу, содержащему рисунок который вы хотите редактировать.

source: The right-click menu first lists all the columns containing overlapping drawings, then the columns and objects that are hierarchically linked to the clicked one.
ru: Меню правого клика сначала перечисляет все столбцы, содержащие перекрывающиеся рисунки, а затем столбцы и объекты, которые иерархически связаны с выбранным.

source: Using the Selection Tool
ru: Использование Инструмента выделения

source: The **Selection** tool (|selection|) allows you to edit, move, rotate, scale and distort a selection in a drawing.
ru: Инструмент **Выделения** (|selection|) позволяет редактировать, перемещать, вращать,масштабировать и наклонять выделение на рисунке.

source: **Type:** has the options **Rectangular**, to select the area of the box you define by clicking and dragging; **Freehand**, to select the area you outline by clicking and dragging; and **Polyline**, to select the area you outline by defining a series of lines. In vector drawings, a vector stroke is selected only if it is fully included in the area you define.
ru: **Тип:** имеет параметры **Прямоугольный**, чтобы выбрать область поля, которую вы определяете, щелкая и перетаскивая; **От руки**, чтобы выбрать область, которую вы обводите, нажав и перетащив; и **Полилиния**, чтобы выбрать область, которую вы очерчиваете, определяя ряд линий. На векторных рисунках векторный штрих выбирается, только если он полностью включен в определяемую вами область.

source: **Mode:** has the options **Standard**, to select vectors; **Selected Frames**, to edit all the lines of selected frames at once; **Whole Level**, to transform all of the drawings of the current animation level; **Same Style**, to select at once all of the vectors painted with the same style in the current drawing; **Same Style on Selected Frames**, to select at once all of the vector strokes painted with the same style in the selected frames of the current animation level; **Same Style on Whole Level**, to select at once all of the vector strokes painted with the same style in all the drawings of the current animation level; **Boundary Strokes**, to select all the boundary strokes of the current drawing; **Boundary Strokes on Selected Frames**, to select all the boundary strokes of the selected frames; **Boundary Strokes on Whole Level**, to select all the boundary strokes of the whole level.This is available for Toonz Vector drawings only.
ru: **Режим:** имеет параметры **Стандарт**, для выбора векторов; **Выбранные Кадры**, для редактирования всех строк выбранных кадров одновременно; **Уровень целиком**, чтобы преобразовать все рисунки текущего уровня анимации; **Того же стиля**, чтобы выбрать сразу все векторы, окрашенные в тот же стиль в текущем чертеже; **Того же стиля на выбранных кадрах**, чтобы выбрать сразу все векторные штрихи, окрашенные одинаковым стилем в выбранных кадрах текущего уровня анимации; **Того же стиля во всем уровне** , чтобы выбрать сразу все векторные штрихи, нарисованные одним и тем же стилем на всех чертежах текущего уровня анимации; **Отделяющие линии**, чтобы выбрать все граничные штрихи текущего чертежа; **Отделяющие линии на выбранных кадрах**, чтобы выбрать все штрихи границы выбранных кадров; **Отделяющие линии на всём уровне**, чтобы выбрать все штрихи границы всего уровня. Это доступно только для векторных рисунков Toonz.

source: **Preserve Thickness** will preserve the original thickness of the drawing vectors while performing resizing operations. This is available for Toonz Vector drawings only.
ru: **Сохранять толщину** сохранит первоначальную толщину векторов чертежа при выполнении операций изменения размера. Это доступно только для векторных рисунков Toonz.

source: **Scale H** and **V** set the horizontal and vertical scaling of the current selection.
ru: **Масштаб H** и **V** устанавливает горизонтальное и вертикальное масштабирование текущего выбора.
