Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: ru

source: **Link** will maintain the proportion of the selection while draging over any of the Scale **H** or **V** letters in the tool options bar.
ru: **Связать** сохранит пропорцию выделения при перетаскивании по любой из букв Масштаб **H** или **V** на панели параметров инструмента.

source: **Rotation** sets the rotation of the current selection.
ru: **Вращение** устанавливает поворот текущего выделения.

source: **Position N/S** and **E/W** set a vertical and horizontal offset for the selection.
ru: **Положения N/S** и **E/W** устанавливают вертикальное и горизонтальное смещение выделенного.

source: **Thickness** sets the thickness of the selected vector strokes. In case the selected strokes have variable thickness, or different thickness values, the highest value is displayed, and any change will affect the other values accordingly. This is available for Toonz Vector drawings only.
ru: **Толщина** устанавливает толщину выделенных векторных штрихов. В случае, если выбранные штрихи имеют переменную толщину или разные значения толщины, отображается самое высокое значение, и любое изменение соответственно повлияет на другие значения. Это доступно только для векторных рисунков Toonz.

source: **Cap:** sets the shape of the ends of the selected vector strokes. Options are **Butt** for squared ends, **Round** for semicircular ends, and **Projecting** for squared ends extending beyond the end of the line, according to the stroke thickness. This is available for Toonz Vector drawings only.
ru: **Конец:** устанавливает форму концов выбранных векторных штрихов. Возможные варианты: **Обрубок** для квадратов, **Закругленный** для полукруглых концов и **Плоский** для квадратов, выходящих за конец линии, в зависимости от толщины обводки. Это доступно только для векторных рисунков Toonz.

source: A butt cap, a round cap and a projecting cap.
ru: Простой, закругленный и плоский кончик.

source: **Join:** sets the shape of the straight corners along the selected vector strokes. Options are **Miter** for pointed corners, **Round** for rounded corners, **Bevel** for squared corner. This is available for Toonz Vector drawings only.
ru: **Изгиб:** устанавливает форму прямых углов вдоль выбранных векторных штрихов. Варианты: **Острый изгиб** для острых углов, **Закругленный изгиб** для закругленных углов, **Скошенный изгиб** для квадрата. Это доступно только для векторных рисунков Toonz.

source: Miter joins, round joins and bevel joins.
ru: Острый, закругленный и скошенный изгиб.

source: **Miter:** sets the maximum length of a *Miter* join, that is computed multiplying the Miter value by the stroke thickness. If the length exceeds the maximum value, the *Miter* join is turned into a *Bevel* join. This is available for Toonz Vector drawings only, and only if the **Join:** option is set to **Miter**.
ru: **Острый:** устанавливает максимальную длину соединения *Острый* изгиб, которое вычисляется умножением значения Острый на толщину хода. Если длина превышает максимальное значение, соединение *Острый* превращается в соединение *Закругленный*. Это доступно только для векторных рисунков Toonz, и только если опция **Изгиб:** установлена ​​на **Острый**.

source: **Modify Savebox** check box allows you to resize the *Savebox* of a drawing. The drawing part that, because of the editing, falls outside of the savebox will be erased. This is available for Toonz Raster drawings only.
ru: Флажок **Изменить Savebox** позволяет изменить размер *Savebox* рисунка. Часть рисунка, которая из-за редактирования выпадает за пределы окна сохранения, будет удалена. Это доступно только для рисунков Toonz Raster.

source: The *Savebox* size can be set automatically to the minimum size by activating the Preferences → Drawing → **Minimize Savebox after Editing** option.
ru: Размер *Savebox* можно автоматически установить на минимальный размер, активировав параметр «Настройки программы» → «Рисунок» → **Минимизировать Savebox после правки**.

source: **No Antialiasing** when activated, the antialiasing is not applied when the selection is deformed or rotated. This is available on Toonz Raster and Raster drawings only.
ru: **Без сглаживания**, когда активирован, сглаживание не применяется, когда выделение деформировано или повернуто. Это доступно только для рисунков Toonz Raster и Raster.

source: If the tool options bar is too short to display all the tool options, it can be scrolled by using the arrow buttons available at its ends.
ru: Если панель параметров инструмента слишком короткая для отображения всех параметров инструмента, ее можно прокручивать с помощью кнопок со стрелками, имеющихся на ее концах.

source: When a selection is made, it is displayed with a bounding box with handles that allow you to perform the following transformations:
ru: Когда выбор сделан, он отображается с ограничительной рамкой с ручками, которые позволяют вам выполнять следующие преобразования:

source: **Move**, click and drag the inside of the raster selection, or any selected vector of a vector selection, to move it; by pressing the **Shift** key while dragging, the movement will be constrained on the horizontal or vertical direction.
ru: **Перемещать**, щелкните и перетащите внутреннюю часть выделенного растра или любой выбранный вектор выделенного вектора, чтобы переместить его; при нажатии клавиши **Shift** во время перетаскивания движение будет ограничено в горизонтальном или вертикальном направлении.

source: The keyboard arrow keys can be used as well to move the selection one pixel in any direction; if they are used while pressing the **Shift** key, the movement will be in 10 pixels steps.
ru: Клавиши со стрелками на клавиатуре также можно использовать для перемещения выделения на один пиксель в любом направлении; если они используются при нажатии клавиши **Shift**, движение будет с шагом 10 пикселей.

source: **Rotate**, click and drag outside any corner handle to rotate the selection.
ru: **Вращать**, щелкните и перетащите за любую угловую ручку, чтобы повернуть выделение.

source: **Scale**, click and drag any corner handle to scale the selection freely; by pressing the **Shift** key while dragging the scaling will be uniform; by pressing the **Alt** key the scaling will be applied from the center.
ru: **Масштабировать**, щелкните и перетащите любой угловой маркер, чтобы свободно масштабировать выделение; при нажатии клавиши **Shift** при перетаскивании масштабирование будет равномерным; при нажатии клавиши **Alt** масштабирование будет применено от центра.

source: **Scale in one direction**, click and drag any side handle to scale the selection in one direction; by pressing the **Alt** key the scaling will be applied symmetrically from the center.
ru: **Масштабировать в одном направлении**, щелкните и перетащите любую боковую ручку, чтобы масштабировать выделение в одном направлении; при нажатии клавиши **Alt** масштабирование будет применено симметрично от центра.

source: **Center**, click and drag the center handle to change the center of rotation, and the center used when Alt-scaling.
ru: **Центрировать**, щелкните и перетащите центральную ручку, чтобы изменить центр вращения, а также центр, используемый при Alt-масштабировании.

source: **Distort**, Ctrl-click (PC) or Cmd-click (Mac) any corner handle to distort the selection, or any side handle to shear it.
ru: **Наклонять**, **Ctrl**-клик (ПК) или **Cmd**-клик (Mac) любой угловой маркер, чтобы исказить выделение, или любой боковой маркер, чтобы срезать его.

source: Ctrl-click (PC) or Cmd-click (Mac) operations are not allowed in **Whole Level** modes (see above).
ru: Ctrl-щелчок (PC) или Cmd-щелчок (Mac) не применимы в режимах **Уровень целиком** (см. выше).

source: **Thickness**, click the double arrow-head at the bottom right corner of the selection and drag up to increase the thickness of selected lines, down to decrease it. This option is available for Toonz Vector drawings only.
ru: **Толщина**, щелкните двойную стрелку в правом нижнем углу выделения и перетащите вверх, чтобы увеличить толщину выделенных линий, вниз, чтобы уменьшить ее. Эта опция доступна только для векторных рисунков Toonz.

source: To apply the transformations you can click outside the selection.
ru: Чтобы применить преобразования, вы можете нажать за пределами выделения.

source: As you roll over the handles, the cursor changes shape to indicate the operations you may perform.
ru: При наведении курсора на курсор курсор меняет форму, чтобы указать операции, которые вы можете выполнить.

source: Selections can also be Cut, Copied, Pasted and Deleted by using the relevant command in the Edit menu. Cut or Copy and Paste also work from one drawing to another, or onto a new one. This allows you to copy or move a section of a drawing to another drawing, or split a drawing into several ones.
ru: Выделенноетакже может быть вырезано, скопировано, вставлено и удалено с помощью соответствующего пункта в меню «Правка». Вырезать или копировать и вставлять также работать с одного рисунка на другой, или на новый. Это позволяет копировать или перемещать часть рисунка на другой рисунок или разбивать рисунок на несколько.

source: When a drawing in a Toonz level, or a section of it is pasted to another one, the Styles of the pasted drawing are added to the palette of the target level, unless the same Styles are already available in the palette.
ru: Когда рисунок на уровне Toonz или его часть вставляется в другой, стили вставленного рисунка добавляются в палитру целевого уровня, если в палитре уже не доступны те же стили.

source: The selection can also be used to change the Style of vector strokes by choosing it in the palette, or by creating a new Style while selected. See :ref:`Editing Styles <editing_styles>` .
ru: Выделение также можно использовать для изменения стиля векторных штрихов, выбрав его в палитре или создав новый стиль при выделении. См. :ref:`Редактирование стилей <editing_styles>`.

source: **To edit the drawing savebox:**
ru: **Для редактирования окна сохранения рисунка:**

source: Activate the **Modify Savebox** option to visualize the savebox around the drawing.
ru: Активируйте опцию **Изменить Savebox**, чтобы визуализовать окно сохранения вокруг рисунка.

source: Use the handles to resize it.
ru: Используйте ручки, чтобы изменить его размер.

source: Deactivate the **Modify Savebox** option to confirm the changes.
ru: Отключите параметр **Изменить Savebox**, чтобы подтвердить изменения.

source: **To select and transform an area in a Toonz Raster or Raster level:**
ru: **Чтобы выбрать и преобразовать область на уровне Toonz Raster или Raster:**

source: Select the area by doing one of the following:
ru: Выберите область, выполнив одно из следующих действий:

source: Set the type to **Rectangular** and click and drag to define the box whose area you want to select.
ru: Установите режим на **Прямоугольный**, нажмите и перетащите, чтобы определить поле, область которого вы хотите выбрать.

source: Set the type to **Freehand** and click and drag to outline the area you want to select.
ru: Установите тип **От руки**, нажмите и перетащите, чтобы выделить область, которую вы хотите выбрать.

source: Set the type to **Polyline** and click to outline the area you want to select by defining a series of lines.
ru: Установите тип **Полилиния** и щелкните, чтобы выделить область, которую вы хотите выделить, определив серию линий.

source: Do one of the following to make geometric transformations:
ru: Выполните одно из следующих действий для геометрических преобразований:

source: Operate the handles available along the bounding box.
ru: Используйте ручки, доступные вдоль ограничительной рамки.

source: Edit the scale, rotation and position values available in the tool options bar.
ru: Отредактируйте значения масштаба, поворота и положения, доступные на панели параметров инструмента.

source: First define the area you want to select, then use the bounding box to make geometric transformations.
ru: Сначала определите область, которую вы хотите выбрать, затем используйте ограничивающий прямоугольник для геометрических преобразований.

source: **To select and transform vectors in a Toonz Vector level:**
ru: **Чтобы выбрать и преобразовать векторы на уровне Toonz Vector:**

source: Select the vectors by doing one of the following:
ru: Выберите векторы, выполнив одно из следующих действий:

source: Click a stroke to select it.
ru: Кликните по линии, чтобы выбрать ее.

source: Shift-click to add a stroke to or remove it from the current selection.
ru: Удерживая нажатой клавишу «Shift», можно добавить или удалить выбранные линии из текущего выделения.

source: Set the type to **Rectangular** and **click and drag to the right** to define a box and select all the strokes that are *completely* included in the box; **click and drag to the left** to select all the strokes that are *partially* included in the box.
ru: Установите режим **Прямоугольный** и **щелкните и перетащите вправо**, чтобы определить поле и выбрать все линии, которые *полностью* включены в поле; **щелкните и перетащите влево**, чтобы выбрать все линии, которые *частично* включены в поле.

source: Set the type to **Freehand** and click and drag to outline an area and select all the strokes that are completely included in the area.
ru: Установите режим **От руки**, нажмите и перетащите, чтобы обвести область и выбрать все линии, которые полностью включены в область.

source: Set the type to **Polyline** and click to outline an area by defining a series of lines and select all the strokes that are completely included in the area.
ru: Установите режим **Полилиния** и щелкните, чтобы обвести область, определив серию линий, и выберите все линии, которые полностью включены в область.

source: Set the mode to **Same Style** and click to select automatically all the vectors painted with the same style used for the vector you select in the current drawing, or Shift-click to add them to or remove them from the selection.
ru: Установите режим на **Того же стиля** и нажмите, чтобы автоматически выбрать все векторы, нарисованные в том же стиле, который использовался для вектора, выбранного в текущем рисунке, или щелкните, удерживая клавишу «Shift», чтобы добавить их или удалить из выделения.

source: When clicking a stroke belonging to a group, the whole group is selected (see :ref:`Grouping and Ungrouping Vectors <grouping_and_ungrouping_vectors>` ).
ru: При нажатии на линию, принадлежащую группе, выделятеся вся группа (см. :ref:`Группировка и разгруппировка векторов <grouping_and_ungrouping_vectors>`).

source: Do one of the following to make a geometric transformations:
ru: Выполните одно из следующих действий для геометрических преобразований:

source: Edit the scale, rotation, position and thickness values available in the tool options bar.
ru: Измените значения масштаба, поворота, положения и толщины, доступные на панели параметров инструмента.

source: First select the vector strokes you want to transform, then use the bounding box to make geometric transformations.
ru: Сначала выберите векторные линии, которые вы хотите преобразовать, затем используйте ограничивающий прямоугольник для геометрических преобразований.

source: **To select and transform all the drawings of a Toonz Vector level:**
ru: **Чтобы выбрать и преобразовать все рисунки уровня Toonz Vector:**

source: Set the mode to **Whole Level** to automatically select all the strokes in all of the drawings of the current animation level.
ru: Установите режим **Уровень целиком**, чтобы автоматически выбирать все линии на всех рисунках текущего уровня анимации.

source: Set the mode to **Same Style on Whole Level** and click to select at once all of the strokes painted with the same style used for the stroke you selected in all of the drawings of the current animation level, or Shift-click to add them to or remove them from the selection.
ru: Установите режим **Того же стиля во всем уровне** и щелкните, чтобы выбрать сразу все линии, нарисованные в том же стиле, который использовался для штриха, выбранного на всех рисунках текущего уровня анимации, или кликните по ним, зажав клавишу Shift, чтобы добавить их или удалить из выбора.

source: Do one of the following to make geometric transformations affecting all of the level drawings:
ru: Выполните одно из следующих действий, чтобы выполнить геометрические преобразования, влияющие на все чертежи уровней:

source: When working on the whole level the bounding box displayed in the current level drawing is double-lined.
ru: При работе на уровне целиком ограничивающая рамка, отображаемая на рисунке текущего уровня, имеет двойные линии.

source: **To paste a selection in another existing drawing:**
ru: **Чтобы вставить выделение в другой существующий рисунок:**

source: Make a selection in the current drawing.
ru: Выделите требуемое в текущем рисунке.

source: Copy/cut it.
ru: Скопируйте или вырежьте его.

source: Select the other drawing in the Level Strip or in the Xsheet/Timeline.
ru: Выберите другой рисунок на Level Strip или на Xsheet/Timeline.

source: Paste the copied/cut selection.
ru: Вставьте скопированный/вырезанный фрагмент.

source: Selections from Toonz Raster and Toonz Vector levels can be pasted in any other type of drawing, automatically converting the pasted selection to the appropriate type; selections from standard Raster levels can only be pasted in other Raster drawings.
ru: Выделенные фрагменты из уровней Toonz Raster и Toonz Vector могут быть вставлены в любой другой тип рисунков, автоматически преобразуются вставленный выбор в соответствующий тип; выделенное из стандартных растровых уровней могут быть вставлены только в другие растровые рисунки.

source: **To paste a selection in a new drawing:**
ru: **Чтобы вставить выделение в новый рисунок:**

source: Select an empty frame in the level strip or an empty cell in the .
ru: Выберите пустой кадр в Level Strip или пустую ячейку в Xsheet.

source: **To merge several drawings into one drawing:**
ru: **Чтобы объединить несколько рисунков в один рисунок:**

source: Select the area you want to merge and copy/cut it.
ru: Выберите область, которую хотите объединить, и скопируйте/вырежьте ее.

source: Select the drawing you want to paste the selection to.
ru: Выберите рисунок, в который вы хотите вставить выделение.

source: Several raster animation levels can also be merged at once by using the related command (see :ref:`Merging Animation Levels <merging_animation_levels>` ).
ru: Несколько уровней растровой анимации также можно объединить одновременно с помощью соответствующей команды (см. :ref:`Объединение уровней анимации <merging_animation_levels>`).

source: **To split a drawing into several drawings:**
ru: **Чтобы разбить рисунок на несколько рисунков:**

source: Select the area you want to use as a new drawing and copy/cut it.
ru: Выберите область, которую вы хотите использовать в качестве нового рисунка, и скопируйте/обрежьте его.

source: Select an empty cell in the .
ru: Выберите пустую ячейку в Xsheet.

source: Paste the copied/cut selection: automatically a new drawing will be created.
ru: Вставьте скопированный/вырезанный фрагмент: автоматически будет создан новый рисунок.

source: Grouping and Ungrouping Vectors
ru: Группировка и разгруппировка векторов

source: All the vector strokes of a drawing lie on the same plane, therefore drawing *areas* are outlined by segments defined by strokes intersections. This means that if you draw two intersecting squares, automatically three areas are defined: one belonging only to the first square, one to the second one, and another defined by the intersection.
ru: Все векторные линии рисунка лежат в одной плоскости, поэтому *области* рисования очерчены отрезками, определенными пересечениями штрихов. Это означает, что если вы рисуете два пересекающихся квадрата, автоматически определяются три области: одна принадлежит только первому квадрату, вторая - второму, а другая определяется пересечением.

source: Painting a drawing that contains intersecting vector strokes and shapes may be an issue, because all of them lie on the same layer.
ru: Рисование рисунка, который содержит пересекающиеся векторные линии и фигуры, может быть проблемой, потому что все они лежат на одном слое.

source: To organize strokes you can use the grouping features, that creates a new group entity containing only the strokes you select.
ru: Для организации линий вы можете использовать функции группировки, которые создают новую групповую сущность, содержащую только выбранные вами линии.

source: In the case of two intersecting squares, if you want the two squares to be overlapping instead of intersecting, you can create a group containing the strokes of the first square, and another those of the second square, thus defining two groups whose order can be arranged.
ru: В случае двух пересекающихся квадратов, если вы хотите, чтобы два квадрата перекрывались, а не пересекались, вы можете создать группу, содержащую линии первого квадрата и еще линии второго квадрата, таким образом определяя две группы, порядок которых может быть организован.

source: It's possible to create as many groups as you want in any drawing; groups can be made of one stroke only as well, for instance a circle, or a line.
ru: Можно создать столько групп, сколько вы хотите; группы могут быть сделаны только из одной линии, например, из круга или линии.

source: First define groups, then set a proper layering order to solve the intersection problems.
ru: Сначала определите группы, затем установите правильный порядок наложения для решения проблем пересечения.

source: When drawing with the **Geometric** tool (|geometric|), closed shapes (i.e. rectangles, circles, ellipses, polygons and closed polylines) can be defined automatically as a group by activating the **Auto Group** option (see :ref:`Drawing with the Geometric Tool <drawing_with_the_geometric_tool>` ).
ru: При рисовании с помощью **Геометрического** (|geometric|) инструмента замкнутые фигуры (например, прямоугольники, круги, эллипсы, многоугольники и замкнутые полилинии) можно автоматически определить как группу, активировав опцию **Автогруппировать** (см. :ref:`Рисование с помощью геометрического инструмента <drawing_with_the_geometric_tool>`).

source: When your strokes selection includes one or several groups, the new group will include them as well, preserving them and their original sorting order position in case the group is released.
ru: Когда вами выделено одна или несколько групп, новая группа также будет включать их, сохраняя их и их исходное положение порядка сортировки на случай, если группа будет освобождена.

source: It's not possible to define a group if the selection includes only some strokes belonging to a group.
ru: Невозможно определить группу, если выбор включает только несколько штрихов, принадлежащих группе.

source: When a group is released, if no other group is defined in the same drawing, all the strokes will lie at the same plane; if other groups are defined, the strokes of the released group will lie on a plane behind, in front of, or between the other groups, according to the original group sorting order position.
ru: Когда группа освобождается, если никакая другая группа не определена на том же рисунке, все линии будут лежать в одной плоскости; если определены другие группы, линии освобожденной группы будут лежать на плоскости позади, перед или между другими группами в соответствии с исходной позицией порядка сортировки группы.
