Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: ru

source: The cell selection can also spread over several columns/layers: in this case the same number of new columns/layers will be inserted to make room for the cloning result. If more than one level is selected, the same number of new levels will be created and it's not possible to assign a name to the cloned levels.
ru: Выбор ячеек также может распространяться на несколько столбцов/слоев: в этом случае будет вставлено такое же количество новых столбцов/слоев, чтобы освободить место для результата клонирования. Если выбрано более одного уровня, будет создано такое же количество новых уровней, и невозможно присвоить имя клонированным уровням.

source: **To clone levels:**
ru: **Чтобы клонировать уровни:**

source: Select the cells you want to clone.
ru: Выберите ячейки, которые вы хотите клонировать.

source: Choose Cells → **Clone**.
ru: Выберите пункт меню Ячейки → **Клонировать**.

source: Right-click in the selection and choose **Clone** from the menu that opens.
ru: Щелкните правой кнопкой мыши в выделении и выберите пункт **Клонировать** в открывшемся меню.

source: Enter a **Level Name:** and press **OK** to confirm.
ru: Введите **Имя уровня:** и нажмите **OK** для подтверждения.

source: Using Onion Skin
ru: Применение кальки

source: If you want to view more than one level drawing at the same time in the Viewer as reference when you create drawings, or you want to check the animation, you can activate the Onion Skin mode.
ru: Если вы хотите одновременно просматривать несколько уровней в окне просмотра в качестве справочного материала при создании рисунков или проверить анимацию, вы можете активировать режим кальки.

source: The Onion Skin is available both in the Xsheet/Timeline and in the Level Strip, according to where the cursor showing the current frame is displayed, as the onion skin can be activated starting from the cursor and managed in the frame number column/bar.
ru: Калька доступна как на Xsheet/Timeline, так в Level Strip, в зависимости от того, где отображается курсор, показывающий текущий кадр, так как калька может быть активирована, начиная с курсора, и управляться в столбце/строке номера кадра.

source: A column animation displayed with the relative Onion Skin set for 6 previous frames, step two, and an absolute Onion Skin set at frame 35.
ru: Анимация столбца, отображаемая с относительной калькой, установленной для 6 предыдущих кадров, шаг два, и калькой, установленной в кадре 35.

source: When a frame of the Level Strip is selected, the onion skin applies to the *current level* only, referring to the sequence of the full animation level as it was created.
ru: Когда выбран кадр Level Strip, калька применяется только к *текущему уровню*, ссылаясь на последовательность уровня полной анимации, которая была создана.

source: When a cell of the Xsheet/Timeline is selected, the onion skin applies to the current level, according to how the drawing sequence is exposed in the scene, including movements and transformations performed thanks to the object animation (see :ref:`Animating Objects <animating_objects>` ), while the rest of the scene in the current frame will be visible as usual. If you want, you can also extend the onion skin to the whole content of the Xsheet/Timeline, to allow references to all of the animated or moving elements in the scene as well.
ru: Когда ячейка Xsheet/Timeline выбрана, калька применяется к текущему уровню в соответствии с тем, как последовательность рисунка отображается в сцене, включая движения и преобразования, выполняемые благодаря анимации объекта (см. :ref:`Анимация объектов <animating_objects>`), а остальная часть сцены в текущем кадре будет видна как обычно. Если вы хотите, вы также можете расширить кальку на все содержимое Xsheet/Timeline, чтобы разрешить ссылки на все анимированные или движущиеся элементы сцены.

source: The *relative* Onion Skin mode displays frames in relation to the position of the current frame. For instance you can activate the frame previous to the current one, and every time you change the current frame, the previous frame will be displayed.
ru: *Относительный* режим кальки отображает кадры относительно позиции текущего кадра. Например, вы можете активировать кадр, предшествующий текущему, и каждый раз, когда вы меняете текущий кадр, будет отображаться предыдущий кадр.

source: The *fixed* Onion Skin mode displays the selected frame independently from the current frame. For instance you can activate frame 5, and every time you change the current frame, frame 5 will be displayed in Onion Skin mode.
ru: Режим *абсолютной* кальки отображает выбранный кадр независимо от текущего кадра. Например, вы можете активировать кадр 5, и каждый раз, когда вы меняете текущий кадр, кадр 5 будет отображаться в режиме кальки.

source: The way images are displayed in Onion Skin mode can be customized in the Preferences pane. It's possible to define the **Paper Thickness**, to set an independent color correction for previous and following frames, and to **Display Lines Only** for Toonz Vector and Toonz Raster.
ru: Способ отображения изображений в режиме кальки можно настроить в окне настроек. Можно определить **Толщина бумаги**, установить независимую коррекцию цвета для предыдущих и последующих кадров, а также **Отображать только линии** для Toonz Vector и Toonz Raster.

source: **To activate or deactivate frames in Relative Onion Skin mode:**
ru: **Чтобы активировать или деактивировать кадры в режиме относительной кальки:**

source: In the Xsheet, click the small romboid markers available to the left of the frames column (or above the frame bar in the Timeline). Click and drag automatically activates or deactivates a series of frames.
ru: На листе Xsheet щелкните маленькие маркеры ромбоида, доступные слева от столбца кадров (или над панелью кадров на временной шкале). Нажатие и перенесение автоматически активирует или деактивирует ряд кадров.

source: In the Level Strip, click the small circular markers available to the left of the strip frames. Click and drag automatically activates or deactivates a series of frames.
ru: На Level Strip щелкните маленькие круглые маркеры, доступные слева от рамок полосы. Нажмите и перетащите автоматически активирует или деактивирует ряд кадров.

source: **To activate or deactivate frames in Fixed Onion Skin mode:**
ru: **Чтобы активировать или деактивировать кадры в режиме абсолютной кальки:**

source: In the Xsheet, click the small ghosted romboid markers available to the very left of the frames column (or above the frame bar in the Timeline). Click and drag automatically activates or deactivates a series of frames.
ru: На листе Xsheet щелкните маленькие маркеры с призрачными ромбами, доступные в левой части столбца кадров (или над панелью кадров на временной шкале). Нажмите и перетащите автоматически активирует или деактивирует ряд кадров.

source: In the Level Strip, click the small ghosted circular markers available to the very left of the strip frames. Click and drag automatically activates or deactivates a series of frames.
ru: На Level Strip нажмите на маленькие круглые маркеры с призраками, доступные слева от рамок полосы. Нажмите и перетащите автоматически активирует или деактивирует ряд кадров.

source: **To Deactivate (or Activate again) the Onion Skin mode:**
ru: **Чтобы деактивировать (или снова активировать) режим кальки:**

source: Double-click over the big circle to the left of the current frame cursor. Double-click again to activate it back.
ru: Дважды щелкните большой круг слева от курсора текущего кадра. Дважды щелкните снова, чтобы активировать его обратно.

source: Right-click in the Viewer or in the frames column/bar of the Xsheet/Timeline, and choose **Deactivate Onion Skin** or **Activate Onion Skin** in the menu that opens.
ru: Щелкните правой кнопкой мыши в окне просмотра или в столбце/строке кадров в Xsheet/Timeline и выберите **Деактивировать кальку** или **Активировать кальку** в открывшемся меню.

source: The first time you activate Onion Skin mode by Right-clicking in the Viewer or the Xsheet/Timeline frames column/bar, a default relative onion skin mode activates, showing the previous three frames.
ru: При первой активации режима кальки путем щелчка правой кнопкой мыши в окне просмотра или столбце/строке кадров Xsheet/Timeline включается режим относительной оболочки кальки по умолчанию, отображающий предыдущие три кадра.

source: **To Extend the onion skin to the Whole Scene Content:**
ru: **Расширение кальки до содержания всей сцены:**

source: Activate the onion skin in the Xsheet/Timeline.
ru: Активируйте кальку в Xsheet/Timeline.

source: Right-click in the Viewer or in the frame column/bar of the Xsheet/Timeline, and choose **Extend Onion Skin to Scene** from the menu that opens.
ru: Щелкните правой кнопкой мыши в окне просмотра по кадру или в столбце/строке Xsheet/Timeline» и выберите пункт **Расширить кальку на все уровни** из открывшегося меню.

source: **To Limit the onion skin to the Current Level:**
ru: **Чтобы ограничить кальку текущим уровнем:**

source: Right-click in the Viewer or in the frame column/bar of the Xsheet/Timeline, and choose **Limit Onion Skin to Level** from the menu that opens.
ru: Щелкните правой кнопкой мыши в окне просмотра или в столбце/строке Xsheet/Timeline и выберите пункт **Ограничить кальку до одного уровня** в открывшемся меню.

source: **To customize the way images are displayed in onion skin mode:**
ru: **Чтобы настроить способ отображения изображений в режиме кальки:**

source: Choose File → Preferences → **Onion Skin**.
ru: Выберите пункт меню Файл → Настройки программы → **Калька**.

source: Set a value for the **Paper Thickness** parameter; the lower the value, the more transparent the drawings displayed in Onion Skin mode will be.
ru: Установить значение для параметра **Толщина бумаги**; чем ниже значение, тем более прозрачными будут рисунки, отображаемые в режиме кальки.

source: Use the **Previous Frames Correction** to set a color for displaying previous frames.
ru: Используйте **Коррекция предыдущих кадров**, чтобы установить цвет для отображения предыдущих кадров.

source: Use the **Following Frames Correction** to set a color for displaying following frames.
ru: Используйте **Коррекция последующих кадров**, чтобы установить цвет для отображения следующих кадров.

source: Activate the **Display Lines Only** option to display Toonz Vector or Toonz Raster levels with lines only.
ru: Активируйте опцию **Отображать только линии**, чтобы отображать уровни Toonz Vector или Toonz Raster только с линиями.

source: Using Shift and Trace
ru: Использование Shift и Trace

source: The **Shift and Trace** function can help you in the creation of animated levels as if you were drawing on paper using a light table; in fact it allows you to use the previous and next key drawings as references, while you insert an inbetween or a break down.
ru: Функции **Shift и Trace** могут помочь вам в создании анимированных уровней, как если бы вы рисовали на бумаге, используя стол с подсветкой; фактически это позволяет вам использовать предыдущий и следующий ключевые рисунки в качестве референса, в то время как вы вставляете фазовку или break down.

source: It's possible to temporary move and rotate the drawings you want to use as reference, to fit the position where you want to draw the inbetween. It's also possible to automatically set the position of the reference drawings creating and editing a path of action line.
ru: Можно временно перемещать и поворачивать рисунки, которые вы хотите использовать в качестве эталона, чтобы соответствовать положению, в котором вы хотите нарисовать фазовку. Также можно автоматически устанавливать положение референсных рисунков, создавая и редактируя линию действия.

source: To better check the new drawing and the animation, you can toggle the Shift and Trace visualization on or off the Viewer.
ru: Чтобы лучше проверить новый рисунок и анимацию, вы можете включить или выключить визуализацию Shift и Trace.

source: **To enter the Shift and Trace view:**
ru: **Для входа в режим Shift и Trace:**

source: Position the frame cursor on the frame where you want to draw the inbetween drawing.
ru: Поместите курсор кадра на кадр, где вы хотите нарисовать промежуточный рисунок.

source: Enable View → **Shift and Trace**; the previous and next drawings will be visualized.
ru: Включите Вид → **Shift и Trace**; предыдущий и следующий рисунки будут визуализированы.

source: **To Edit the Position of the reference drawings:**
ru: **Чтобы изменить положение референсных рисунков:**

source: Position the frame cursor where you want to draw the inbetween drawing and sketch the path of action line beteween your reference points.
ru: Поместите курсор кадра в том месте, где вы хотите нарисовать промежуточный рисунок, и нарисуйте путь линии действия между вашими контрольными точками.

source: Activate View → **Edit Shift**.
ru: Активируйте Вид → **Редактировать сдвиг**.

source: Click on the drawing you want to reposition in the Viewer, or use the **Previous Drawing** / **Following Drawing** options in the tool options bar; the related reference drawing bounding box will be displayed.
ru: Нажмите на рисунок, который вы хотите изменить в окне просмотра, или используйте параметры **Предыдущий рисунок**/**Следующий рисунок** на панели параметров инструмента; будет отображена ограничительная рамка связанного референсного рисунка.

source: Click and drag *inside the bounding box* to **move** the reference drawing.
ru: Щелкните и перетащите *внутри ограничительной рамки*, чтобы **переместить** референсный рисунок.

source: Click and drag *outside the bounding box* to **rotate** the reference drawing.
ru: Щелкните и перетащите *за пределы ограничительной рамки*, чтобы **повернуть** референсный рисунок.

source: Click and drag *the center handle* to change the **center of rotation**.
ru: Нажмите и перетащите *центральную ручку*, чтобы изменить **центр вращения**.

source: Click and drag *any corner handle of the bounding box* to **scale** the reference drawing from its center.
ru: Нажмите и перетащите *любой угловой маркер ограничительной рамки*, чтобы **масштабировать** референсный рисунок из его центра.

source: Repeat the same steps on the second reference drawing.
ru: Повторите те же шаги на втором референсном рисунке.

source: **To automatically Edit the Position of the reference drawings:**
ru: **Для автоматического редактирования положения референсных рисунков:**

source: Ctrl-click and drag to create a path, from the reference point in the first drawing, to the reference point in the second one. The starting and the ending points will be overlapped at the center of the path.
ru: Удерживая клавишу Ctrl, перетащите, чтобы создать путь от контрольной точки на первом рисунке до контрольной точки на втором. Начальная и конечная точки будут перекрываться в центре пути.

source: Click and drag the handle along the path to change its shape; the reference drawings will move according to the handle position and rotate according to the path shape modification.
ru: Нажмите и перетащите маркер вдоль пути, чтобы изменить его форму; референсные рисунки будут перемещаться в соответствии с положением ручки и вращаться в соответствии с изменением формы пути.

source: If needed, use the bounding box handles to fix the rotation of the reference drawing.
ru: При необходимости используйте ручки ограничительной рамки, чтобы зафиксировать поворот референсного рисунка.

source: Clicking and dragging one of the reference drawings will remove the path of action line.
ru: Нажатие и перетаскивание одного из референсных рисунков удалит путь линии действия.

source: **To Toggle the Shift and Trace visualization:**
ru: **Для переключения визуализации Shift и Trace:**

source: Activate View → **No Shift** to toggle the visualization of the reference drawings back to their original position.
ru: Активируйте Вид → **Без сдвига**, чтобы переключить визуализацию референсных рисунков обратно в исходное положение.

source: **To Reset the position of the reference drawings:**
ru: **Чтобы сбросить положение референсных рисунков:**

source: Choose the View → **Reset Shift** command.
ru: Выберите команду Вид → **Сбросить сдвиг**.

source: **To Reset the transformations of one of the reference drawings:**
ru: **Для сброса преобразований одного из референсных рисунков:**

source: In the tool options bar click on either **Reset Previous** or **Reset Following** buttons.
ru: На панели параметров инструмента нажмите кнопку **Сбросить изменения** или **Сбросить изменения**.

source: **To Create an inbetween drawing using the Shift and Trace feature:**
ru: **Чтобы создать промежуточный рисунок с помощью функции Shift и Trace:**

source: Create the first key drawing.
ru: Создайте первый ключевой рисунок.

source: Create the second key drawing.
ru: Создайте второй ключевой рисунок.

source: Select the cell where you want to create the inbetween drawing.
ru: Выберите ячейку, в которой вы хотите создать промежуточный рисунок.

source: Activate View → **Shift and Trace**.
ru: Активируйте Вид → **Shift и Trace**.

source: Sketch the path of action line beteween your reference points.
ru: Проложите путь линии действия между вашими контрольными точками.

source: Activate View → **Edit Shift** and edit the position of the reference drawings.
ru: Активируйте Вид → **Редактировать сдвиг** и отредактируйте положение референсных рисунков.

source: Create the inbetween drawing.
ru: Создайте промежуточный рисунок.
