Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: ru

source: Drawing Animation Levels
ru: Рисование уровней анимации

source: In OpenToonz it is possible to create and draw **Toonz Vector** levels (PLI format), **Toonz Raster** levels (TLV format) and standard **Raster** levels (TIF format) directly in the viewer. Drawing tools can also be used for touch-up in cleaned up drawings, and loaded raster images.
ru: В OpenToonz можно создавать и рисовать **векторные уровни Toonz** (формат PLI), **растровые уровни Toonz** (формат TLV) и стандартные **растровые** уровни (формат TIF) непосредственно в средстве просмотра. Инструменты рисования также можно использовать для подправки очищенных чертежей и загруженных растровых изображений.

source: Drawing In OpenToonz
ru: Рисование в OpenToonz

source: To draw an animation level, first you have to define its type: Toonz Vector, Toonz Raster or Raster; and its settings like its name, the number of frames it's made of and the way its drawings are numbered.
ru: Чтобы нарисовать уровень анимации, сначала вы должны определиться с его типом: Toonz векторный, Toonz растровый или обыкновенный растровый; и его настройки, такие как имя, количество кадров и способ нумерации рисунков.

source: Toonz Vector levels are defined by drawing of vector strokes; strokes and areas defined by strokes can be painted by using the styles available in the level palette. Toonz Vector levels have an unlimited size and resolution, as they are vector-based. They are saved as PLI files.
ru: Векторные уровни Toonz определяются рисованием векторных штрихов; штрихи и области, определенные штрихами, могут быть нарисованы с использованием стилей, доступных в палитре уровней. Векторные уровни Toonz имеют неограниченный размер и разрешение, поскольку они основаны на векторах. Они сохраняются в виде файлов PLI.

source: Toonz Raster levels are defined by drawing bitmap lines; lines and areas defined by lines can be painted by using the styles available in the level palette. Toonz Raster levels have a specified size and resolution, defined when they are created. They are saved as TLV files.
ru: Уровни Toonz Raster определяются путем рисования растровых линий; линии и области, определенные линиями, могут быть нарисованы с использованием стилей, доступных в палитре уровней. Уровни Toonz Raster имеют определенный размер и разрешение, определяемые при их создании. Они сохраняются в виде файлов TLV.

source: Raster levels are defined by drawing bitmap lines using the styles available in the **Raster Drawing Palette**, that is shared by all of the Raster levels of the same project (see :ref:`Project Default Folders <project_default_folders>` ). Raster levels have a specified size and resolution, defined when they are created. They are saved as sequences of individual TIF files, one per level frame.
ru: Растровые уровни определяются путем рисования растровых линий с использованием стилей, доступных в **Палитре растровых рисунков**, которая используется всеми растровыми уровнями одного и того же проекта (см. :ref:`Папки проекта по умолчанию <project_default_folders>`). Растровые уровни имеют определенный размер и разрешение, определяемые при их создании. Они сохраняются как последовательности отдельных файлов TIF, по одному на каждый уровень кадра.

source: When an animation level is defined, you can select any of its frames in the Xsheet/Timeline or in the Level Strip, and start drawing in the viewer. You can do this both, when you want to create a drawing from scratch, and when you want to edit a previously made drawing.
ru: Когда уровень анимации определен, вы можете выбрать любой из его кадров на Xsheet/Timeline или в Level Strip и начать рисование в средстве просмотра. Вы можете сделать это и тогда, когда вы хотите создать рисунок с нуля, и когда вы хотите редактировать ранее сделанный рисунок.

source: When selected in the Xsheet/Timeline, the viewer displays the whole scene content at the current frame; when selected in the Level Strip, the viewer displays the selected frame of the current animation level only, to let you work more easily on it.
ru: При выборе на Xsheet / Timeline программа просмотра отображает всё содержание сцены в текущем кадре; при выборе в полосе уровня зритель отображает только выбранный кадр текущего уровня анимации, чтобы вам было легче работать с ним.

source: Setting the Default Type of Level to Draw
ru: Установка типа уровня по умолчанию для рисования

source: It's possible to define the default level type that will be created when you draw inside OpenToonz.
ru: Можно определить тип уровня по умолчанию, который будет создан, когда Вы рисуете внутри OpenToonz.

source: By default Toonz Vector and Toonz Raster levels are saved in the **+drawing** folder of the current project when the scene is saved, while Raster levels are saved in the **+extras** folder (see :ref:`Project Default Folders <project_default_folders>` ).
ru: По умолчанию уровни Toonz Vector и Toonz Raster сохраняются в папке **+drawing** текущего проекта при сохранении сцены, в то время как Уровни Raster сохраняются в папке **+extras** (см. :ref:`Папки проекта по умолчанию <project_default_folders>`).

source: **To define the Default Type of Level to Draw:**
ru: **Задать тип уровня по умолчанию для рисования:**

source: Open File → Preferences → Drawing.
ru: Откройте пункт меню Файл → Настройки программы → Рисунок.

source: Choose the level type you want to use as default from the **Default Level Type:** option menu. **Width**, **Height** and **DPI** fields are available for **Toonz Raster Level** and **Raster Level** options.
ru: Выберите тип уровня, который вы хотите использовать по умолчанию, в меню параметров **Тип уровня по умолчанию:**. Поля **Ширина**, **Высота** и **DPI** доступны для параметров **Растровый уровень Toonz** и **Растровый уровень**.

source: The Width, Height and DPI values set in the File → Preferences → Drawing section will also be used as default for the **New Level** dialog.
ru: Значения ширины, высоты и DPI, заданные в разделе «Файл» → «Настройки программы» → «Рисунок», также будут использоваться по умолчанию в диалоговом окне **Новый уровень**.

source: Animation levels can be created in the following ways:
ru: Уровни анимации могут быть созданы следующими способами:

source: Using the **New Level** dialog.
ru: Использование диалогового окна **Новый уровень**.

source: Setting the Autocreation option to **Enabled**.
ru: Для параметра «Автосоздание» установлено значение «**Включено»**.

source: Setting the Autocreation option to **Use Xsheet as Animation Sheet**.
ru: Установка параметра «Автосоздание» на **Использовать Xsheet как лист анимации**.

source: Using the New Level Dialog
ru: Использование диалога нового уровня

source: New animation levels can be defined by using a dialog that lets you set the number of drawings the level is made of, the animation step used to expose the frames in the Xsheet/Timeline, and the increment, that sets the way the level drawings are numbered. For example, a **Step** 2 repeats each drawing twice in the Xsheet column or Timeline layer, while an **Increment** 2 will number its drawings as 1, 3, 5, etc. The dialog also allows you to choose a destination folder, different from the default one, by using the **Save In** field.
ru: Новые уровни анимации можно определить с помощью диалогового окна, в котором можно указать количество рисунков, из которых сделан уровень, шаг анимации, используемый для отображения кадров в Xsheet/Timeline, и приращение, которое задает способ отображения чертежей уровней. пронумерованы. Например, **Шаг** 2 повторяет каждый рисунок дважды в столбце Xsheet или на временной шкале, в то время как **Прирост** 2 будет нумеровать его рисунки как 1, 3, 5 и т. Д. В этом диалоговом окне также можно выбрать папка назначения, отличная от папки по умолчанию, с помощью поля **Сохранить в**.

source: In case you define a Toonz Raster or a Raster level, you can set its **Width**, **Height** and **DPI** values, according to the way you want to use it in the scene.
ru: Если вы определяете Растровый уровень Toonz или Растровый уровень , вы можете установить его значения **Ширина**, **Высота** и **DPI** в соответствии с тем, как вы хотите использовать его в сцене.

source: Settings like the length of the level and the numbering order can be edited later, as you are free to arrange the images composing an animation level the way you prefer (see :ref:`Editing Animation Levels <editing_animation_levels>` ).
ru: Такие настройки, как длина уровня и порядок нумерации, могут быть отредактированы позже, так как вы можете упорядочивать изображения, составляющие уровень анимации, так, как вы предпочитаете (см. :ref:`Редактирование уровней анимации <editing_animation_levels>`).

source: When a new level is created in an empty column, the color of that column header and the cells where the new level gets exposed are colored denoting the type of level: **light yellow** for Toonz Vector levels, **light green** for Toonz Raster levels, and **light blue** for Raster levels (see :ref:`Working with Xsheet Columns <working_with_xsheet_columns>` ).
ru: Когда новый уровень создается в пустом столбце, цвет заголовка этого столбца и ячеек, в которых отображается новый уровень, окрашиваются, обозначая тип уровня: **светло-желтый** для векторных уровней Toonz, **светло-зеленый** для растровых уровней Toonz и **светло-синий** для растровых уровней (см. :ref:`Работа со столбцами Xsheet <working_with_xsheet_columns>`).

source: The New Level dialog inherits the **Default Level Type** settings defined in Preferences → Drawing.
ru: Диалоговое окно "Новый уровень" наследует настройки **Тип уровня по умолчанию**, определенные в "Настройки программы" → "Рисунок".

source: **To create a new animation level to draw:**
ru: **Чтобы создать новый уровень анимации для рисования:**

source: Do one of the following:
ru: Выполните одно из следующих действий:

source: Select a cell in the Xsheet/Timeline where you want to place your animation level and choose File → **New Level...**
ru: Выберите ячейку на Xsheet/Timeline, где вы хотите разместить уровень анимации, и выберите «Файл» → **«Новый уровень...»**

source: Right-click the cell in the Xsheet/Timeline where you want to place your animation level and choose **New Level...** from the menu that opens.
ru: Щелкните правой кнопкой мыши ячейку на Xsheet/Timeline, где вы хотите разместить уровень анимации, и выберите **Новый уровень...** в открывшемся меню.

source: (If the Xsheet/Timeline toolbar is visible) Click any of the three **New Level buttons** at the leftmost part of it.
ru: (Если видна панель инструментов Xsheet/Timeline) Нажмите любую из трех кнопок **Новый уровень** в самой левой части.

source: Choose the type of level: Toonz Vector, Toonz Raster or Raster, from the **Type:** option menu and define its settings, then click the OK button.
ru: Выберите тип уровня: Векторный уровень Toonz, Растровый уровень Toonz или Растровый уровень, в меню параметров **Тип:** и определите его настройки, затем нажмите кнопку OK.

source: When using the Xsheet/Timeline's toolbar buttons to create a new level, the corresponding level type is already preselected in the dialog's dropdown menu.
ru: При использовании кнопок панели инструментов Xsheet/Timeline для создания нового уровня соответствующий тип уровня уже предварительно выбран в раскрывающемся меню диалога.

source: If a level is already exposed in the cell column, the new level will be created in an empty column.
ru: Если уровень уже представлен в столбце ячейки, новый уровень будет создан в пустом столбце.

source: **To define the saving location for the level you want to draw:**
ru: **Чтобы определить место сохранения для уровня, который вы хотите нарисовать:**

source: In the **New Level** dialog type in the **Save In:** field, or use the **Browser button**, to set the path for the saving location.
ru: В диалоговом окне **Новый уровень** введите в поле **Сохранить в:** или используйте кнопку **Browser button**, чтобы указать путь для места сохранения.

source: If in the browser you choose any project folder, in the path field the full path will be replaced by the correspondent *folder alias* (see :ref:`Project Default Folders <project_default_folders>` ).
ru: Если в браузере вы выбираете какую-либо папку проекта, в поле пути полный путь будет заменен соответствующим *псевдонимом папки* (см. :ref:`Папки проекта по умолчанию <project_default_folders>`).

source: Using the Autocreation Option
ru: Использование опции автосоздания

source: When in Preferences → Drawing the **Autocreation:** option is set to **Enabled**, it is possible to create new drawings automatically by using drawing tools in the viewer. If the currently selected cell is empty, a new level will be automatically created and named with the first available letter of the alphabet; if the currently selected cell is the one **right after** one containing a level drawing (either in the Xsheet/Timeline or the Level Strip) a new drawing will be added to that level.
ru: Если в меню «Настройки программы» → «Рисунок» для параметра **«Автосоздание:**» установлено значение «**Включено»**, можно автоматически создавать новые рисунки с помощью инструментов рисования в средстве просмотра. Если текущая выбранная ячейка пуста, новый уровень будет автоматически создан и назван с первой доступной буквой алфавита; если текущая выбранная ячейка - это ячейка **сразу после**, содержащая рисунок уровня (либо на Xsheet/Timeline, либо на полосе уровня), к этому рисунку будет добавлен новый рисунок.

source: The level type will be the one defined in Preferences → Drawing as **Default Level Type**.
ru: Тип уровня будет определен в Настройки программы → Рисунок как **Тип уровня по умолчанию**.

source: Using the Xsheet as Animation Sheet
ru: Использование Xsheet в качестве анимационного листа

source: When in Preferences → Drawing the **Autocreation:** option is set to **Use the Xsheet as Animation Sheet**, it's possible to create new drawings automatically by using drawing tools in the viewer. If the currently selected cell is empty and belongs to an empty column, a new level will be automatically created and named with the first available letter of the alphabet; if the currently selected cell is **anywhere after** one containing a level drawing, a new drawing will be added to that level. In both cases the drawings will take its number from the scene current frame ; if that drawing number already existed in the level, a letter will be added to its number (e.g. A.0001a.ext).
ru: Когда в меню «Настройки программы» → «Рисунок» параметр **«Автосоздание:**» установлен на **«Использовать Xsheet в качестве анимационного листа**», можно автоматически создавать новые рисунки с помощью инструментов рисования в средстве просмотра. Если текущая выбранная ячейка пуста и принадлежит пустому столбцу, новый уровень будет автоматически создан и назван с первой доступной буквой алфавита; если текущая выбранная ячейка **где-то после** ячейки, содержащей рисунок уровня, к этому уровню будет добавлен новый рисунок. В обоих случаях рисунки будут брать свой номер из текущего кадра сцены; если этот номер рисунка уже существовал на уровне, к его номеру будет добавлена ​​буква (например, A.0001a.ext).

source: This working method allows you to work as a traditional animator: you can start creating the *key drawings*, and then add *breakdown drawings*, and then *inbetween drawings*. You can quickly check your animation flipping it in the viewer.
ru: Этот метод работы позволяет вам работать как традиционный аниматор: вы можете начать создавать *ключевые рисунки*, а затем добавлять *разбивочные рисунки*, а затем *между рисунками*. Вы можете быстро проверить свою анимацию, пролистывая ее в средстве просмотра.

source: When you add a new drawing it will be repeated as a *hold* along the column/layer up to the following one.
ru: Когда вы добавляете новый рисунок, он будет повторяться как *удержанный* вдоль столбца / слоя до следующего.

source: It's also possible to create a new drawing in a cell that contains a *hold*: the new drawing will replace the hold up to the following drawing. Drawings can also be duplicated creating a copy with a different number.
ru: Также возможно создать новый рисунок в ячейке, которая содержит *hold*: новый рисунок заменит удержание до следующего рисунка. Рисунки также можно дублировать, создав копию с другим номером.

source: Once the animation is completed you can renumber the whole sequence according to the Xsheet/Timeline frame numbering.
ru: После завершения анимации вы можете изменить нумерацию всей последовательности в соответствии с нумерацией кадров Xsheet / Timeline.

source: **To create a new animation level**
ru: **Для создания нового уровня анимации**

source: Click an empty cell in the Xsheet/Timeline and start drawing using a drawing tool in the viewer.
ru: Щелкните пустую ячейку на Xsheet/Timeline и начните рисовать, используя инструмент рисования в окне просмотра.

source: **To add a drawing to an existing level**
ru: **Чтобы добавить рисунок существующему уровню**

source: Click an empty cell in the column/layer containing the existing level and start drawing using a drawing tool in the viewer.
ru: Щелкните пустую ячейку в столбце/слое, содержащем существующий уровень, и начните рисовать, используя инструмент рисования в средстве просмотра.

source: **To automatically renumber the drawings**
ru: **Для автоматической нумерации рисунков**

source: Select the cells with the drawings you want to renumber.
ru: Выберите ячейки с рисунками, которые вы хотите перенумеровать.

source: Choose the Cells → **Autorenumber** command.
ru: Выберите команду Ячейки → **Автопересчет**.

source: The **Autorenumber** command is also available in the menu that opens when right-clicking in a cell.
ru: Команда **Автопересчет** также доступна в меню, которое открывается при щелчке правой кнопкой мыши в ячейке.

source: Using the Viewer
ru: Использование окна просмотра

source: In the viewer, it's possible to use the tools available in the toolbar to draw, paint, edit and model drawings. The work area of the viewer is endless and you can scroll, zoom in, zoom out and rotate it.
ru: В средстве просмотра можно использовать инструменты, доступные на панели инструментов, для рисования, рисования, редактирования и моделирования чертежей. Рабочая область зрителя бесконечна, и вы можете прокручивать, увеличивать, уменьшать и поворачивать ее.

source: In the title bar you can find information about what is currently displayed and selected, the zoom percentage, and a set of buttons that lets you set the view mode (see :ref:`Using the Viewer <using_the_viewer>` ).
ru: В строке заголовка вы можете найти информацию о том, что в данный момент отображается и выбирается, процент увеличения и набор кнопок, которые позволяют вам установить режим просмотра (см. :ref:`Использование окна просмотра <using_the_viewer>`).

source: At the bottom of the viewer another customizable set of buttons is available.
ru: В нижней части окна просмотра доступен другой настраиваемый набор кнопок.

source: The frame bar and the playback buttons let you set the current frame and move through animation frames. The set frame rate is visualized, and, in case the playback is activated, the actual frame rate is displayed on its left.
ru: Панель кадров и кнопки воспроизведения позволяют установить текущий кадр и перемещаться по кадрам анимации. Заданная частота кадров визуализируется, и, если воспроизведение активировано, фактическая частота кадров отображается слева.

source: The other buttons are relevant only using the Animate tool (|animate|) to animate objects and when previewing the animation in the viewer (see :ref:`Animating Objects <animating_objects>` and :ref:`Previewing the Animation <previewing_the_animation>` ).
ru: Другие кнопки актуальны только при использовании Инструмента анимирования (|animate|) для анимации объектов и при предварительном просмотре анимации в окне просмотра (см. :ref:`Анимация объектов <animating_objects>` и :ref:`Предварительный просмотр анимации <previewing_the_animation>`).

source: If the bottom bar is too short to display all the options, it can be scrolled by using arrow buttons available at its ends.
ru: Если нижняя панель слишком короткая, чтобы отобразить все параметры, ее можно прокрутить с помощью кнопок со стрелками на ее концах.

source: In case a frame range is defined by playback markers, the playback buttons operate on the defined range only (see :ref:`Using the Playback Markers <using_the_playback_markers>` ).
ru: Если диапазон кадров определяется маркерами воспроизведения, кнопки воспроизведения работают только с определенным диапазоном (см. :ref:`Использование маркеров воспроизведения <using_the_playback_markers>`).

source: **To navigate the work area:**
ru: **Для навигации по рабочей области:**

source: Use the **Zoom** tool (|zoom|): to zoom in, click and drag up; to zoom out, click and drag down. The point where you click is the center of the zooming action.
ru: Используйте инструмент **Лупа** (|zoom|): для увеличения нажмите и перетащите вверх; чтобы уменьшить масштаб, нажмите и перетащите вниз. Точка, в которой вы щелкаете, является центром действия масштабирования.

source: Use the zoom shortcut keys (by default + and - keys) to zoom in and zoom out at specific steps (e.g. 50%, 100%, 200%, etc.).
ru: Используйте горячие клавиши масштабирования (по умолчанию клавиши + и -), чтобы увеличивать и уменьшать масштаб при определенных шагах (например, 50%, 100%, 200% и т.д.).

source: Use the mouse wheel to zoom in and zoom out.
ru: Используйте колесико мыши для увеличения и уменьшения масштаба.

source: Middle-click and drag or use the **Hand** tool (|hand|) to scroll in any direction.
ru: Нажмите среднюю кнопку мыши и перетащите или используйте инструмент **Рука** (|hand|) для прокрутки в любом направлении.

source: Use the **Rotate** tool (|rotate|) to rotate the viewer: an *horizon line* is displayed to let you understand the amount of rotation; the center of rotation is the absolute center of the work area.
ru: Используйте инструмент **Поворот** (|rotate|), чтобы вращать в окне просмотра: отображается *линия горизонта*, чтобы вы могли понять величину вращения; центр вращения является абсолютным центром рабочей зоны.

source: Use the reset view shortcut (by default the **Alt + 0** key) or right-click in the viewer and select **Reset View** from the menu that opens, to display the viewer at its actual size, centered on the absolute center with no rotation applied.
ru: Используйте горячую клавишу сброса просмотра (по умолчанию клавиша **Alt + 0**) или щелкните правой кнопкой мыши в окне просмотра и выберите **Вид по умолчанию** в открывшемся меню, чтобы отобразить окно просмотра в его реальном размере с центром в абсолютном центре без вращения.

source: Right-click and choose **Fit to Window** to automatically zoom the viewer so that it fits the camera box.
ru: Щелкните правой кнопкой мыши и выберите **По размеру окна**, чтобы автоматически увеличить масштаб просмотра, чтобы он уместился в поле камеры.

source: **To play the scene contents back:**
ru: **Для воспроизведения содержимого сцены назад:**

source: Use the **Play** button.
ru: Нажмите кнопку **Воспроизведение**.

source: Drag the frame bar cursor.
ru: Перетащите курсор рамки кадра.

source: **To set the current frame:**
ru: **Чтобы установить текущий кадр:**

source: Use the playback buttons.
ru: Используйте кнопки воспроизведения.

source: Type in the **Current Frame** field the number of the frame you want to view.
ru: Введите в поле **Текущий кадр** номер кадра, который вы хотите просмотреть.

source: **To set the playback frame rate:**
ru: **Чтобы установить частоту кадров воспроизведения:**
