Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: ru

source: Enter a value in the **FPS** field.
ru: Введите значение в поле **FPS**.

source: Use the frame rate slider.
ru: Используйте ползунок частоты кадров.

source: Adjusting the Viewer Visualization
ru: Настройка визуализации окна просмотра

source: The way the viewer visualizes the scene content can be adjusted according to the task to perform.
ru: Способ, которым окно просмотра визуализирует содержание сцены, может быть скорректирован в соответствии с задачей, которую необходимо выполнить.

source: **Full Screen** mode can be entered to maximize the viewer to the monitor screen, hiding any interface window border. This is available only on the Windows platform.
ru: **Полноэкранный режим** можно ввести, чтобы максимально развернуть зрителя до экрана монитора, скрывая любую границу окна интерфейса. Это доступно только на платформе Windows.

source: Vector drawings, that can slow down the visualization performance when used in large amounts in a scene, can be visualized as raster drawings, faster to visualize, still preserving their vector nature, by using the **Visualize Vector As Raster** option.
ru: Векторные рисунки, которые могут замедлить производительность визуализации при использовании в большом количестве в сцене, можно визуализировать как растровые рисунки, быстрее визуализировать, сохраняя при этом их векторную природу, используя параметр **Отображать вектор как растр**.

source: If the current level is vector-based, it will still be displayed as vector to allow any drawing/editing operation you may perform.
ru: Если текущий уровень основан на векторах, он все равно будет отображаться как вектор, чтобы разрешить любую операцию рисования/редактирования, которую вы можете выполнить.

source: Raster drawings and images that usually are displayed in the viewer according to their DPI value, can be displayed at their actual pixel size, that is to say that one pixel from the image is displayed as one pixel of the screen monitor, to better examine them.
ru: Растровые рисунки и изображения, которые обычно отображаются в средстве просмотра в соответствии с их значением DPI, могут отображаться с их фактическим размером в пикселях, то есть один пиксель изображения отображается как один пиксель экрана монитора, чтобы лучше их изучить.

source: Visualizing an image at its actual pixel size is different from zooming in because zooming always takes into account the image DPI information.
ru: Визуализация изображения с его фактическим размером в пикселях отличается от увеличения, поскольку при масштабировании всегда учитывается информация о DPI изображения.

source: **Windows only - To enter the viewer full screen mode:**
ru: **Только для Windows - Для входа в полноэкранный режим просмотра:**

source: Right-click the viewer and choose **Full Screen Mode** from the menu that opens.
ru: Щелкните правой кнопкой мыши в окне просмотра и выберите **Полноэкранный режим** в открывшемся меню.

source: **Windows only - To exit the viewer full screen mode:**
ru: **Только для Windows - Для выхода из полноэкранного режима просмотра:**

source: Right-click the viewer and choose **Exit Full Screen Mode** from the menu that opens.
ru: Щелкните правой кнопкой мыши на средстве просмотра и выберите **Выход из полноэкранного режима** в открывшемся меню.

source: **To activate or deactivate the raster visualization for vector drawings:**
ru: **Чтобы активировать или деактивировать растровую визуализацию для векторных рисунков:**

source: Activate or deactivate the View → **Visualize Vector As Raster** option.
ru: Активируйте или деактивируйте опцию Вид → **Отображать вектор как растр**.

source: **To display raster drawings and images at their actual pixel size:**
ru: **Для отображения растровых рисунков и изображений с их фактическим размером пиксела:**

source: In the Xsheet/Timeline select the level to which the drawing or image belongs so that it becomes the current level.
ru: В Xsheet/Timeline выберите уровень, к которому относится чертеж или изображение, чтобы он стал текущим уровнем.

source: Select the drawing or image in the Level Strip in order to display it alone.
ru: Выберите рисунок или изображение на полосе уровня, чтобы отобразить его отдельно.

source: Use the Actual Pixel Size shortcut (by default the **N** key) or right-click in the viewer and choose **Actual Pixel Size** from the menu that opens.
ru: Используйте горячую клавишу "Фактический пиксельный размер" (по умолчанию клавиша **N**) или щелкните правой кнопкой мыши в средстве просмотра и выберите **Фактический пиксельный размер** в открывшемся меню.

source: Customizing the Viewer
ru: Настройка окна просмотра

source: The Viewer can be customized according to your needs: the background colors visible in the Viewer and inside the camera box can be changed; a Field Guide and a Safe Area can be displayed for reference; the Table and Camera Box can be hidden; Custom Guides can be added to help you in aligning objects or composing the elements of the scene for a particular frame. The View → **Inks Only** check allows to hide the painted areas of the levels, facilitating the drawing process.
ru: Окно просмотра может быть настроено в соответствии с вашими потребностями: цвета фона, видимые в просмотрщике и внутри камеры, могут быть изменены; направляющая сетка и безопасная зона могут быть отображены для справки; стол и камера могут быть скрыты; пользовательские направляющие могут быть добавлены, чтобы помочь вам выровнять объекты или составить элементы сцены для определенного кадра. Проверка "Вид" → **Только линии** позволяет скрыть окрашенные области уровней, облегчая процесс рисования.

source: The set of buttons and information available in the bottom bar of the Viewer can be customized as well, so that only the elements you require are visible.
ru: Набор кнопок и информации, доступных в нижней панели средства просмотра, также можно настроить так, чтобы были видны только те элементы, которые вам нужны.

source: **To change the Viewer Background color:**
ru: **Чтобы изменить цвет фона просмотрщика:**

source: Open the File → Preferences → **Colors** dialog.
ru: Откройте диалоговое окно Файл → Настройки программы → **Цвета**.

source: Define the **Viewer BG Color** by doing one of the following:
ru: Определите **Цвет фона просмотра**, выполнив одно из следующих действий:

source: Set the Red, Green and Blue values.
ru: Установите значения красного, зеленого и синего.

source: Click the color thumbnail and use the **Style Editor** to edit it (see :ref:`Plain Colors <plain_colors>` ).
ru: Нажмите на миниатюру цвета и используйте **Редактор стилей**, чтобы отредактировать его (см. :ref:`Простые цвета <plain_colors>`).

source: **To change the Camera Box Background color:**
ru: **Чтобы изменить цвет фона камеры:**

source: Open the Xsheet → **Scene Settings...** dialog.
ru: Откройте диалоговое окно Xsheet → **Настройки сцены...**.

source: Define the **Camera BG Color** by doing one of the following:
ru: Определите **Цвет фона камеры:**, выполнив одно из следующих действий:

source: Set the Red, Green, Blue and Alpha values.
ru: Установите значения красного, зеленого, синего и альфа.

source: **To show or hide the Table:**
ru: **Чтобы показать или скрыть таблицу:**

source: Choose View → **Table** to show or hide the table.
ru: Выберите Вид → **Таблица**, чтобы показать или скрыть таблицу.

source: **To show or hide the Camera Box:**
ru: **Чтобы показать или скрыть рамку камеры:**

source: Choose View → **Camera Box** to show or hide the camera box.
ru: Выберите Вид → **Граница камеры**, чтобы показать или скрыть границу камеры.

source: **To show or hide the Camera Background color:**
ru: **Чтобы показать или скрыть цвет фона камеры:**

source: Choose View → **Camera BG Color** to show or hide the camera box background color.
ru: Выберите Вид → **Цвет фона камеры**, чтобы показать или скрыть цвет фона камеры.

source: **To show or hide the Field Guide:**
ru: **Чтобы определить отображаемую направляющую сетку:**

source: Choose View → **Field Guide** to show or hide the field guide.
ru: Выберите Вид → **Направляющая сетка**, чтобы показать или скрыть направляющую сетку.

source: **To define the displayed Field Guide:**
ru: **Чтобы определить отображаемую направляющую сетку:**

source: Define the **Field Guide Size:** and **A/R:**. **Size** is the number of width fields of the field guide (1 field is equal to 1 inch), and the **A/R** is the ratio between the field guide width and height.
ru: Определите **Размер направляющей сетки:** и **A/R:**. **Размер** - это число полей ширины направляющей поля (1 поле равно 1 дюйму), а **A/R** - это соотношение между шириной направляющей поля и высотой.

source: **To show or hide the Safe Area:**
ru: **Чтобы показать или скрыть безопасную зону:**

source: Choose View → **Safe Area** to show or hide the safe area.
ru: Выберите Вид → **Безопасная зона**, чтобы показать или скрыть безопасную зону.

source: **To add a Custom Guide:**
ru: **Чтобы добавить пользовательскую сетку:**

source: Click in the ruler: a click in the horizontal ruler will create a vertical guide, a click in the vertical ruler will create an horizontal guide.
ru: Нажмите на линейку: щелчок в горизонтальной линейке создаст вертикальную направляющую, щелчок в вертикальной линейке создаст горизонтальную направляющую.

source: **To move a Custom Guide:**
ru: **Чтобы переместить пользовательскую сетку:**

source: Drag the custom guide marker in the ruler.
ru: Перетащите маркер пользовательской направляющей сетки по линейке.

source: **To delete a Custom Guide:**
ru: **Чтобы удалить пользовательскую сетку:**

source: Right-click on the guide marker in the ruler.
ru: Щелкните правой кнопкой мыши по направляющему маркеру в линейке.

source: Drag its marker outside of the Viewer, in the opposite direction of the guide itself.
ru: Перетащите маркер за пределы окна просмотра в направлении, противоположном самой направляющей.

source: **To show or hide Custom Guides:**
ru: **Чтобы показать или скрыть пользовательские направляющие:**

source: Choose View → **Guides** to show or hide the guides.
ru: Выберите Вид → **Руководства**, чтобы показать или скрыть направляющие.

source: **To show or hide the Rulers where Custom Guide markers are located:**
ru: **Чтобы показать или скрыть пользовательские линейки, на которых расположены маркеры:**

source: Choose View → **Rulers** to show or hide the rulers.
ru: Выберите Вид → **Линейка**, чтобы показать или скрыть линейки.

source: When the Viewer work area is rotated, guides are rotated as well, but rulers and guide markers will preserve their position and orientation. However the position of a guide will still be controlled by markers, even if they visually don’t match anymore.
ru: Когда рабочая область окна просмотра поворачивается, направляющие также поворачиваются, но линейки и направляющие маркеры сохраняют свое положение и ориентацию. Однако положение сетки все еще может контролироваться маркерами, даже если визуально они больше не совпадают.

source: **To customize the set of buttons in the bottom bar of the viewer:**
ru: **Чтобы настроить набор кнопок в нижней панели окна просмотра:**

source: Click the option button (|option|) on the far left of the bottom area, and select the elements to show, or deselect those to hide, in the menu that opens.
ru: Нажмите кнопку опции (|option|) в крайнем левом углу нижней области и выберите отображаемые элементы или отмените выбор элементов, которые нужно скрыть, в открывшемся меню.

source: Drawing Tools
ru: Инструменты рисования

source: You can draw by using the **Brush** (|brush|) and **Geometric** (|geometric|) tools. For both tools you can set the thickness of the line you are going to draw: values range from 0 to 100 for Toonz Vector levels, and from 1 to 100 for Toonz Raster and Raster levels.
ru: Вы можете рисовать с помощью инструментов **Кисть** (|brush|) и **Геометрический** (|geometric|). Для обоих инструментов вы можете установить толщину линии, которую вы собираетесь нарисовать: значения варьируются от 0 до 100 для уровней векторного Toonz и от 1 до 100 для уровней растрового и растрового Toonz .

source: For Toonz Raster and Raster levels it's possible to set a Brush tool size higher than 100 by typing it in the Size value fields.
ru: Для уровней растрового Toonz и растрового можно установить размер инструмента Кисть больше 100, введя его в поле Размер.

source: **Min** and **Max Size/Thickness** can be modified by either of these methods:
ru: **Минимальный** и **Максимальный Размер/Толщина** можно изменить одним из следующих способов:

source: Pressing **Ctrl + Alt** and moving the mouse. *Moving horizontally* changes the **Max** value, while *moving vertically* changes the **Min** value.
ru: Нажатие **Ctrl + Alt** и перемещение мыши. *Перемещение по горизонтали* изменяет значение **Максимальный**, тогда как *перемещение по вертикали* изменяет значение **Минимальный**.

source: Using the predefined keyboard shortcuts. **U** and **I** for respectively decreasing and increasing the **Max** value, or **H** and **J** for respectively decreasing and increasing the **Min** value.
ru: Использование определенных сочетаний клавиш. **U** и **I** для соответственно уменьшения и увеличения значения **Максимальный** или **H** и **J** для соответственно уменьшения и увеличения значения **Минимальный**.

source: With the **Brush** tool (|brush|), you can take full advantage of the pressure sensitivity if you are using a pressure sensitive tablet. The more you press on the tablet, the thicker the line you draw.
ru: С помощью инструмента **Кисть** (|brush|) вы можете в полной мере воспользоваться чувствительностью к давлению, если вы используете чувствительный к давлению планшет. Чем больше вы нажимаете на планшет, тем толще линия, которую вы рисуете.

source: With the **Geometric** tool (|geometric|), the thickness value is constantly applied to the whole shape you draw.
ru: С помощью инструмента **Геометрический** (|geometric|) значение толщины постоянно применяется ко всей нарисованной фигуре.

source: When creating vector drawings the size/thickness can also be set to 0 (zero): in this case vector strokes will only exist as a wireframe even if you zoom in or zoom out, and they will be not visible when the animation is rendered.
ru: При создании векторных рисунков размер/толщину также можно установить на 0 (ноль): в этом случае векторные штрихи будут существовать только в виде каркаса, даже если вы увеличиваете или уменьшаете масштаб, и они не будут видны при визуализации анимации.

source: For vector drawings, line thickness can be changed and tweaked afterwards by using other tools (see :ref:`Editing Drawings <editing_drawings>` ).
ru: Для векторных рисунков толщину линий можно изменить и настроить позже, используя другие инструменты (см. :ref:`Редактирование рисунков <editing_drawings>`).

source: Drawing with the Brush Tool
ru: Рисование с помощью инструмента Кисть

source: The **Brush** tool (|brush|) allows you to draw freehand lines with the current style.
ru: Инструмент **Кисть** (|brush|) позволяет рисовать линии от руки с текущим стилем.

source: When using a pressure sensitive tablet, and the **Pressure** option is activated, varying the pressure of the pen on the tablet will allow you to create variable-thickness lines that will make your drawings more expressive.
ru: При использовании планшета, чувствительного к давлению, и при включенной опции **Нажим** изменение давления пера на планшете позволит вам создавать линии переменной толщины, которые сделают ваши рисунки более выразительными.

source: When using the **Brush** tool (|brush|) on Toonz Raster and Raster drawings, the cursor displays the exact pixel area that will be affected by the brush: the inner jagged circle representing the **Minimum Size**, and the outer one the **Maximum Size** of the brush.
ru: При использовании инструмента **Кисть** (|brush|) на рисунках Toonz растровый и растровый курсор отображает точную область пикселов, на которую будет воздействовать кисть: внутренний зубчатый круг, представляющий **минимальный размер**, и внешний **максимальный размер** кисти.

source: In the tool options bar you can set the following:
ru: На панели параметров инструмента вы можете установить следующее:

source: **Size Min** and **Max** sets the size of the brush; the size will vary between the two values if you're using a pressure sensitive tablet. If the two values are the same, your lines will have a constant thickness. When using a mouse to draw, the **Maximum** thickness value will be used.
ru: **Размер Мин** и **Макс** устанавливает размер кисти; размер будет варьироваться между двумя значениями, если вы используете чувствительный к давлению планшет. Если два значения одинаковы, ваши линии будут иметь постоянную толщину. При использовании мыши для рисования будет использоваться значение толщины **Макс**.

source: **Accuracy** sets how accurate the generated line is compared to what you draw with the mouse or tablet pen: a high value will generate lines that completely preserves the movement you perform (even a trembling hand); a low value will simplify the line. This is available for Toonz Vector drawings only.
ru: **Точность** устанавливает, насколько точно сгенерированная линия сравнивается с тем, что вы рисуете с помощью мыши или планшета: высокое значение будет генерировать линии, которые полностью сохраняют выполняемое вами движение (даже дрожащую руку); низкое значение упростит линию. Это доступно только для векторных рисунков Toonz.

source: **Smooth** allows for stroke stabilization while drawing. This is available for Toonz Vector and Toonz Raster drawings only.
ru: **Плавно** обеспечивает стабилизацию хода при рисовании. Это доступно только для рисунков Toonz Vector и Toonz Raster.

source: **Hardness** sets the amount of antialiasing along the line border. This is available for Toonz Raster and Raster drawings only.
ru: **Жесткость** устанавливает количество сглаживания вдоль границы линии. Это доступно только для растровых рисунков и растровых рисунков Toonz.

source: **Opacity Min** and **Max** sets the opacity of the brush; the opacity will vary between the two values if you're using a pressure sensitive tablet. Overlapping areas are not considered while drawing a single line, but only when different lines are overlapping. This is available for Raster drawings only.
ru: **Непрозрачность Мин** и **Maкс** устанавливает непрозрачность кисти; Непрозрачность будет варьироваться между двумя значениями, если вы используете чувствительный к давлению планшет. Перекрывающиеся области не учитываются при рисовании одной линии, но только когда перекрываются разные линии. Это доступно только для растровых рисунков.

source: **Break** automatically breaks the drawn stroke into sections, if very sharp angles are drawn: in this way, drawn shapes may result simpler and easier to fill. This is available for Toonz Vector drawings only.
ru: **Разрыв** автоматически разбивает нарисованный штрих на сечения, если нарисованы очень острые углы: таким образом, нарисованные фигуры могут быть проще и проще для заполнения. Это доступно только для векторных рисунков Toonz.

source: **Draw Order** allows to choose how new drawings will be ordered with respect to already drawn lines. The options are: **Over All**, **Under All** and **Palette Order**. When using **Palette Order** new lines will be drawn above or below already existing ones, using the relative indexes of the palette Styles as the sorting factor. This is available for Toonz Raster drawings only.
ru: **Порядок рисовки** позволяет выбрать порядок упорядочения новых рисунков относительно уже нарисованных линий. Возможны следующие варианты: **Над всеми**, **Под всеми** и **Порядок палитры**. При использовании **Порядок палитры** новые линии будут нарисованы выше или ниже уже существующих, используя относительные индексы стилей палитры как фактор сортировки. Это доступно только для рисунков Toonz Raster.

source: **Pencil** mode draws lines without antialiasing, that is with jagged edges. This is available for Toonz Raster drawings only.
ru: Режим **Карандаш** рисует линии без сглаживания, то есть с неровными краями. Это доступно только для растровых рисунков Toonz.

source: **Pressure** detects, in case you are using a graphic tablet, the pressure of the pen on the tablet, allowing the creation of variable-thickness lines.
ru: **Нажим** определяет, если вы используете графический планшет, давление пера на планшет, что позволяет создавать линии переменной толщины.

source: **Range** allows for the automatic creation of a series of in-between strokes, by drawing just the extremes of the animation on subsequent frames of a level, in the Level Strip, or subsequent exposed cells of a level in the Xsheet/Timeline. By pressing **Ctrl** key, you can draw intermediate strokes to form a more complex animation sequence. This method is similar to the one used by the **Inbetween** command (see :ref:`Using the In-betweener with Vector Drawings <using_the_in-betweener_with_vector_drawings>` ). This is available for Toonz Vector drawings only.
ru: **Диапазон** позволяет автоматически создавать серию промежуточных линий, рисуя только крайности анимации на последующих кадрах уровня, в Level Strip или последующих открытых ячейках уровня в Xsheet/Timeline. Зажав клавишу **Ctrl**, вы можете нарисовать промежуточные линии, чтобы сформировать более сложную последовательность анимации. Этот метод аналогичен методу, используемому командой **Фазовка** (см. :ref:`Использование фазовки с векторными рисунками <using_the_in-betweener_with_vector_drawings>`). Это доступно только для векторных рисунков Toonz.

source: **Snap** allows for the snapping of the cursor to other already drawn strokes of the same level, while drawing a new stroke. It has three levels of sensitivity: **Low**, **Med** and **High**. This is available for Toonz Vector drawings only.
ru: **Привязка** позволяет привязывать курсор к другим уже нарисованным линиям того же уровня, одновременно рисуя новую линию. Она имеет три уровня чувствительности: **Низкая**, **Средняя** и **Высокая**. Это доступно только для векторных рисунков Toonz.

source: **Preset:** let you choose a brush preset in the option menu on the right. You can add or remove a preset clicking the **+** and **-** buttons. A presets list is created *for each level type* and each added preset will be available for next use.
ru: **Предустановка:** позволяет выбрать предустановку кисти в меню параметров справа. Вы можете добавить или удалить предустановку, нажимая кнопки **+** и **-**. Список предустановок создается *для каждого типа уровня*, и каждая добавленная предустановка будет доступна для следующего использования.

source: **Cap** option sets the shape of the ends of the stroke you are going to draw. Options are **Butt** for squared ends, **Round** for semicircular ends, and **Projecting** for squared ends extending beyond the end of the line, according to the vector thickness. This is available for Toonz Vector drawings only.
ru: **Конец** опция устанавливает форму концов штриха, который вы собираетесь нарисовать. Варианты: **Обрубок** для квадратов, **Закругленный** для полукруглых концов и **Плоский колпачок** для квадратов, выходящих за конец линии, в соответствии с толщиной вектора. Это доступно только для векторных рисунков Toonz.
