Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: ru

source: **Join** option sets the shape of the straight corners along the stroke you are going to draw. Options are **Miter** for pointed corners, **Round** for rounded corners, **Bevel** for squared corner. This is available for Toonz Vector drawings only.
ru: Параметр **Изгиб** устанавливает форму прямых углов вдоль обводки, которую вы собираетесь нарисовать. Варианты: **Острый изгиб** для острых углов, **Закругленный изгиб** для закругленных углов, **Скошенный изгиб** для квадрата. Это доступно только для векторных рисунков Toonz.

source: **Miter:** sets the maximum length of a miter join, that is computed multiplying the miter value by the stroke thickness. If the length exceeds the maximum value, the *Miter* join is turned into a *Bevel* join. This is available for Toonz Vector drawings only, and only if the **Join** option is set to miter.
ru: **Скос:** устанавливает максимальную длину соединения под углом, которое вычисляется умножением значения угла под углом на толщину хода. Если длина превышает максимальное значение, соединение *Скос* превращается в соединение *Скошенный*. Это доступно только для векторных рисунков Toonz, и только если для параметра **Изгиб** установлено значение Скос.

source: If the tool options bar is too short to display all the tool options, it can be scrolled by using arrow buttons available at its ends.
ru: Если панель параметров инструмента слишком короткая для отображения всех параметров инструмента, ее можно прокручивать с помощью кнопок со стрелками, имеющихся на ее концах.

source: **To add a new brush preset:**
ru: **Чтобы добавить новую предустановку кисти:**

source: Click the **+** button on the right of the presets list.
ru: Нажмите кнопку **+** справа от списка предустановок.

source: **To remove a new brush preset:**
ru: **Чтобы удалить новую предустановку кисти:**

source: Click the **-** button on the right of the presets list.
ru: Нажмите кнопку **-** справа от списка предустановок.

source: Drawing with the Geometric Tool
ru: Рисование с помощью геометрического инструмента

source: The **Geometric** tool (|geometric|) allows you to draw rectangles, circles, ellipses, regular polygons, polylines and arcs.
ru: **Геометрический** (|geometric|) инструмент позволяет рисовать прямоугольники, круги, эллипсы, правильные многоугольники, полилинии и дуги.

source: **Thickness** sets the size of the brush used to draw the geometric shapes.
ru: **Толщина** определяет размер кисти, используемой для рисования геометрических фигур.

source: **Hardness** sets the amount of antialiasing along the shape border. This is available for Toonz Raster and Raster drawings only.
ru: **Жесткость** устанавливает количество сглаживания вдоль границы фигуры. Это доступно только для растровых рисунков и растровых рисунков Toonz.

source: **Opacity** sets the opacity of the shape border. Overlapping areas are not considered while drawing over the same shape, but only when different shapes are overlapping. This is available for Raster drawings only.
ru: **Непрозрачность** устанавливает непрозрачность границы фигуры. Перекрывающиеся области не учитываются при рисовании поверх одной и той же фигуры, но только когда перекрываются разные фигуры. Это доступно только для растровых рисунков.

source: **Shape:** sets the type of shape you want to draw. Available options are: Rectangle, Circle, Ellipse, Line, Polyline, Arc and Polygon. In case you want to draw a **Polygon**, the **Polygon Sides:** lets you set the number of sides.
ru: **Фигура:** устанавливает тип фигуры, которую вы хотите нарисовать. Доступны следующие варианты: прямоугольник, круг, эллипс, линия, полилиния, дуга и многоугольник. Если вы хотите нарисовать **Многоугольник**, параметр **Сторон многоугольника:** позволяет вам установить количество сторон.

source: **Auto Group** automatically defines any drawn closed shape (i.e. rectangles, circles, ellipses, polygons and closed polylines) as a group, *thus creating a new layer that is placed in front of the other drawing vectors*, without intersecting them (see :ref:`Grouping and Ungrouping Vectors <grouping_and_ungrouping_vectors>` ). This is available for Toonz Vector drawings only.
ru: **Автогруппировать** автоматически определяет любую нарисованную замкнутую форму (т.е. прямоугольники, круги, эллипсы, многоугольники и замкнутые полилинии) как группу, *создавая тем самым новый слой, который помещается перед остальными векторами рисования*, не пересекая их (см. :ref:`Группировка и разгруппировка векторов <grouping_and_ungrouping_vectors>`). Это доступно только для векторных рисунков Toonz.

source: **Auto Fill** automatically paints the area defined by any drawn closed shape (i.e. rectangles, circles, ellipses, polygons and closed polylines) with the same style used for drawing. This is available for Toonz Vector drawings only.
ru: **Автозаливка** автоматически окрашивает область, определяемую любой нарисованной замкнутой формой (то есть прямоугольниками, кругами, эллипсами, многоугольниками и замкнутыми полилиниями) в том же стиле, который использовался для рисования. Это доступно только для векторных рисунков Toonz.

source: **Snap** allows for the snapping of the cursor to other already drawn strokes of the same level, while drawing the shape. It has three levels of sensitivity: **Low**, **Med** and **High**. This is available for Toonz Vector drawings only.
ru: **Привязка** позволяет привязывать курсор к другим уже нарисованным линиям того же уровня, одновременно рисуя новую фигуру. Она имеет три уровня чувствительности: **Низкая**, **Средняя** и **Высокая**. Это доступно только для векторных рисунков Toonz.

source: **Selective** allows the drawing operations not to affect already drawn lines. This is available for Toonz Raster drawings only.
ru: **Избирательно** позволяет операциям рисования не влиять на уже нарисованные линии. Это доступно только для растровых рисунков Toonz.

source: **Pencil** mode draws geometric shapes without antialiasing, that is with jagged edges. This is available for Toonz Raster drawings only.
ru: Режим **Карандаш** рисует геометрические фигуры без сглаживания, то есть с неровными краями. Это доступно только для растровых рисунков Toonz.

source: **Cap** option sets the shape of the ends of open shapes you are going to draw. Options are **Butt** for squared ends, **Round** for semicircular ends, and **Projecting** for squared ends extending beyond the end of the line, according to the vector thickness. This is available for Toonz Vector drawings only.
ru: **Конец** опция устанавливает форму концов штриха, который вы собираетесь нарисовать. Варианты: **Обрубок** для квадратов, **Закругленный** для полукруглых концов и **Плоский колпачок** для квадратов, выходящих за конец линии, в соответствии с толщиной вектора. Это доступно только для векторных рисунков Toonz.

source: **Join** option sets the shape of the straight corners along the shapes you are going to draw. Options are **Miter** for pointed corners, **Round** for rounded corners, **Bevel** for squared corner. This is available for Toonz Vector drawings only.
ru: Параметр **Изгиб** устанавливает форму прямых углов вдоль обводки, которую вы собираетесь нарисовать. Варианты: **Острый изгиб** для острых углов, **Закругленный изгиб** для закругленных углов, **Скошенный изгиб** для квадрата. Это доступно только для векторных рисунков Toonz.

source: **Miter:** sets the maximum length of a miter join, that is computed multiplying the miter value by the stroke thickness. If the length exceeds the maximum value, the *Miter* join is turned into a *Bevel* join. This is available for Toonz Vector levels only, and only if the **Join** option is set to **Miter**.
ru: **Скос:** устанавливает максимальную длину соединения под углом, которое вычисляется умножением значения угла под углом на толщину хода. Если длина превышает максимальное значение, соединение *Скос* превращается в соединение *Скошенный*. Это доступно только для векторных рисунков Toonz, и только если для параметра **Изгиб** установлено значение Скос.

source: While **Rectangles** and **Ellipses** are defined by a (bounding) box, **Circles** and **Polygons** are defined by a center and radius; **Polylines** can be used to create open or closed shapes by defining a series of lines; **Arcs** let you set the end points of a curve, and then the bend.
ru: В то время как **Прямоугольник** и **Эллипс** определяется (ограничивающим) полем, **Круг** и **Многоугольник** определяется центром и радиусом; **Полилиния** можно использовать для создания открытых или закрытых фигур путем определения ряда линий; **Дуга** позволяет установить конечные точки кривой, а затем изгиб.

source: **To draw a rectangle or an ellipse:**
ru: **Чтобы нарисовать прямоугольник или эллипс:**

source: Click to define the upper left corner, drag, and release to define the bottom right corner. If you press the **Shift** key while dragging, the shape will be regular, i.e. a square or a circle; if you press the **Alt** key, shapes will be drawn starting from their center. It's possible to press both keys at the same time.
ru: Нажмите, чтобы определить верхний левый угол, перетащите и отпустите, чтобы определить нижний правый угол. Если вы зажмете клавишу **Shift** во время перетаскивания, форма будет правильной, то есть квадрат или круг; Если вы нажмете клавишу **Alt**, фигуры начнут рисоваться, начиная с их центра. Можно нажать обе клавиши одновременно.

source: **To draw a circle:**
ru: **Чтобы нарисовать круг:**

source: Click to define the center, drag and release to define the radius.
ru: Нажмите, чтобы определить центр, перетащите и отпустите, чтобы определить радиус.

source: **To draw a polygon:**
ru: **Чтобы нарисовать многоугольник:**

source: Set the number of sides in the **Polygon Sides:** field.
ru: Установите количество сторон в поле **Сторон многоугольника:**.

source: Click to define the center, drag and release to define the radius of a circle bounding the polygon.
ru: Нажмите, чтобы определить центр, перетащите и отпустите, чтобы определить радиус окружности, ограничивающей многоугольник.

source: **To draw a polyline:**
ru: **Чтобы нарисовать полилинию:**

source: **Click** to define the first point as a corner point.
ru: **Нажмите**, чтобы определить первую точку в качестве угловой точки.

source: **Click and drag** to define the first point as a control point; while dragging you can set the control point handles.
ru: **Нажмите и перетащите**, чтобы определить первую точку в качестве контрольной точки; во время перетаскивания вы можете установить маркеры контрольной точки.

source: **Click** to define the end point of the line as a corner point. If you press the **Shift** key, you will draw a vertical, horizontal or 45° line.
ru: **Нажмите**, чтобы определить конечную точку линии как угловую точку. Если вы зажмете клавишу **Shift**, вы нарисуете вертикальную, горизонтальную или 45° линию.

source: **Click and drag** to define the end point of the line as a control point; while dragging you can set the control point handles.
ru: **Нажмите и перетащите**, чтобы определить конечную точку линии в качестве контрольной точки; во время перетаскивания вы можете установить маркеры контрольной точки.

source: **Click** or **click and drag** again to define the end point of another line connected to the end point of the previous line.
ru: **Нажмите** или **нажмите и перетащите** еще раз, чтобы определить конечную точку другой линии, соединенной с конечной точкой предыдущей линии.

source: **Double click** to define the last point of an open shape.
ru: **Дважды щелкните**, чтобы определить последнюю точку открытой фигуры.

source: **Click** or **click and drag** again on the first point you defined to draw a closed shape.
ru: **Нажмите** или **щелкните и снова перетащите** на первую заданную вами точку, чтобы нарисовать замкнутую фигуру.

source: Press the **Ctrl** key to add a linear point after a Nonlinear one.
ru: Нажмите клавишу **Ctrl**, чтобы добавить линейную точку после нелинейной.

source: Press the **ESC** key to cancel the creation of the polyline.
ru: Нажмите клавишу **Esc**, чтобы отменить создание полилинии.

source: **To draw an arc:**
ru: **Чтобы нарисовать дугу:**

source: Click to define the first end point.
ru: Нажмите, чтобы определить первую конечную точку.

source: Click to define the second endpoint.
ru: Нажмите, чтобы определить вторую конечную точку.

source: Drag to set the bend, and click to draw the arc.
ru: Перетащите, чтобы установить изгиб, и нажмите, чтобы нарисовать дугу.

source: Adding Text
ru: Добавление текста

source: Text can be added by using the **Type** tool (|type|).
ru: Текст может быть добавлен с помощью инструмента **Шрифта** (|type|).

source: It is also possible to work with editable and animatable text in OpenToonz through the use of the **Text Iwa** effect. For more information, please see :ref:`Text Iwa <text_iwa>` .
ru: В OpenToonz также можно работать с редактируемым и анимируемым текстом с помощью эффекта **Text Iwa**. Для получения дополнительной информации, см. :ref:`Text Iwa <text_iwa>`.

source: **Font:** to be used, taken from a list based on the Operating System default fonts folder.
ru: **Шрифт:** для использования, взятый из списка, основанного на папке шрифтов операционной системы по умолчанию.

source: **Style:**, for the chosen font.
ru: **Начертание:** выбранного шрифта.

source: **Size:**, for the chosen font.
ru: **Размер:**, для выбранного шрифта.

source: Already written text can be resized by using the **Selection** tool (|selection|) (see :ref:`Editing Drawings <editing_drawings>` ).
ru: Размер уже написанного текста можно изменить с помощью инструмента **Выделения** (|selection|) (см. :ref:`Редактирование рисунков <editing_drawings>`).

source: **Vertical Orientation**, lets you place the text vertically, one letter under another, instead of horizontally.
ru: **Вертикальная ориентация**, позволяет размещать текст вертикально, одну букву под другой, а не по горизонтали.

source: The *current* palette Style is applied to the text you type. The palette style can be changed while typing text, thus you can have characters with different styles in the same text editing session (see :ref:`Editing Styles <editing_styles>` ).
ru: Стиль *текущей* палитры применяется к вводимому вами тексту. Стиль палитры может быть изменен при наборе текста, поэтому вы можете иметь символы с разными стилями в одном сеансе редактирования текста (см. :ref:`Редактирование стилей <editing_styles>`).

source: For vector levels, as soon as the text is committed, it's converted into vector outlines, and can no longer be edited as text.
ru: Для векторных уровней, как только текст фиксируется, он преобразуется в векторные контуры и больше не может редактироваться как текст.

source: **To add text:**
ru: **Добавить текст:**

source: Select the **Type** tool (|type|) and click in the viewer where you want to start writing.
ru: Выберите инструмент **Шрифта** (|type|) и щелкните по месту в окне просмотра, с которого вы хотите начать печатать.

source: Choose options **Font**, **Style**, **Size** and **Vertical Orientation**. These options can be changed as long as you are in text editing mode.
ru: Выберите параметры **Шрифт**, **Начертание**, **Размер** и **Вертикальная ориентация**. Эти параметры могут быть изменены, пока вы находитесь в режиме редактирования текста.

source: Change the current color Style in the palette, if you want to use more than one style in the same text editing session.
ru: Измените текущий цветовой стиль в палитре, если вы хотите использовать более одного стиля в одном сеансе редактирования текста.

source: Click inside the text editing area to change the text insertion point.
ru: Щелкните внутри области редактирования текста, чтобы изменить точку вставки текста.

source: Click outside the text editing area, or select a different tool, to commit the text.
ru: Щелкните за пределами области редактирования текста или выберите другой инструмент для фиксации текста.

source: Using the Eraser
ru: Использование Ластика

source: The **Eraser** tool (|eraser|) allows you to partially erase lines, both in vector and raster drawings.
ru: Инструмент **Ластик** (|eraser|) позволяет частично удалять линии, как на векторных, так и на растровых рисунках.

source: **Size** sets the eraser size.
ru: **Размер** устанавливает размер ластика.

source: **Hardness** sets the amount of antialiasing along the eraser border. This is available for Toonz Raster and Raster drawings only.
ru: **Жесткость** устанавливает величину сглаживания вдоль границы ластика. Это доступно только для рисунков Toonz Raster и Raster.

source: **Opacity** set the opacity of the eraser; passing twice on an area is not considered while performing a single erasing operation, but only when performing different erasing operations. This is available for Raster drawings only.
ru: **Непрозрачность** установить непрозрачность ластика; Двойное прохождение по области не учитывается при выполнении одной операции стирания, а только при выполнении различных операций стирания. Это доступно только для растровых рисунков.

source: **Type:** has the options **Normal**, to use the standard eraser; **Rectangular**, to perform the erasing inside the box you define; **Freehand**, to perform the erasing inside the area you outline by clicking and dragging; and **Polyline**, to perform the erasing inside the area you outline by defining a series of lines. In vector drawings, a stroke is erased only if it is fully included in the area you define.
ru: **Тип:** имеет параметры **Обычный**, чтобы использовать стандартный ластик; **Прямоугольный**, чтобы выполнить удаление внутри поля, которое вы определяете; **От руки**, чтобы стереть внутри области, которую вы наметили, нажав и перетащив; и **Полилиния**, чтобы выполнить стирание внутри области, которую вы наметили, определив серию линий. На векторных рисунках обводка удаляется, только если она полностью включена в определяемую вами область.

source: **Mode:** has the options **Areas**, to erase only areas, **Lines**, to erase only the drawing outline, and **Lines & Areas**, to perform both the operations. This is available only for Toonz Raster drawings.
ru: **Режим:** имеет опции **Области**, чтобы удалить только области, **Линии**, чтобы удалить только контур чертежа, и **Линии и области**, чтобы выполнить обе операции. Это доступно только для растровых рисунков.

source: **Selective** allows you to erase only lines or areas made with the current style. This is available only for Toonz Vector and Toonz Raster drawings.
ru: **Избирательно** позволяет стирать только линии или области, созданные в текущем стиле. Это доступно только для рисунков Toonz Vector и Toonz Raster.

source: **Invert** performs the erasing on the outside of the area defined with the Rectangular, Freehand or Polyline options. In vector drawings, a stroke is erased only if it is fully outside of the area you define.
ru: **Инвертировать** выполняет удаление за пределами области, определенной с помощью режимов Прямоугольный, От руки или Полилинии. На векторных рисунках обводка удаляется только в том случае, если она полностью находится за пределами определяемой вами области.

source: **Frame Range** allows you to perform Rectangular, Freehand and Polyline erasing on a range of frames, by defining an area in the first and then in the last frame of the range.
ru: **Диапазон кадров** позволяет вам выполнять стирание Прямоугольника, От руки и Полилинии для диапазона кадров, определяя область в первом, а затем в последнем кадре диапазона.

source: **Pencil** mode erases lines without antialiasing, that is with jagged edges. This is available for Toonz Raster drawings only.
ru: Режим **Карандаш** стирает линии без сглаживания, то есть с неровными краями. Это доступно только для рисунков Toonz Raster.

source: The **Eraser** tool (|eraser|) can be automatically selected by *using the eraser of the tablet pen*.
ru: Инструмент **Ластик** (|eraser|) можно автоматически выбрать с помощью ластика пера планшета*.

source: Converting Raster Drawings to Vectors
ru: Преобразование растровых рисунков в векторы

source: Scanned drawings and raster ones, i.e. drawings not based on vectors, can be converted into Toonz Vector levels.
ru: Отсканированные и растровые рисунки, то есть рисунки, не основанные на векторах, могут быть преобразованы в векторные уровни Toonz.

source: Two main conversion modes are available: **Centerline** and **Outline**. The choice between the two modes depends on which conversion best fits your needs.
ru: Доступны два основных режима преобразования: **Сплошная линия** и **Контурная обводка**. Выбор между двумя режимами зависит от того, какое преобразование наилучшим образом соответствует вашим потребностям.

source: In **Centerline** mode a *single vector stroke with a variable thickness* is generated for each line in the drawing. This means that the converted drawing can be edited like vector-based drawings made directly in OpenToonz, for example you can change the bend of a stroke with the **Pinch** (|pinch|) or **Control Point Editor** tools, and the thickness with the **Pump** tool (|pump|).
ru: В режиме **Сплошная линия** для каждой линии на чертеже создается *одиночный векторный штрих с переменной толщиной*. Это означает, что преобразованный чертеж можно редактировать как векторные рисунки, сделанные непосредственно в OpenToonz, например, вы можете изменить изгиб штриха с помощью инструментов **Щипок** (|pinch|) или **Редактор контрольных точек** и толщину с помощью инструмента **Насос** (|pump|).

source: In **Outline** mode *two vector strokes* are generated to define each line in the drawing, and areas filled with different colors are separated by a stroke. This means that, for example, to change the bend of a line you have to change the bend of the two strokes defining it, and to change the thickness you have to model one or both strokes defining it. *The thickness of all the strokes is set to 0, so that they won’t be visible in the final render*.
ru: В режиме **Контурная обводка** *два векторных штриха* создаются для определения каждой линии на чертеже, а области, заполненные разными цветами, разделяются штрихом. Это означает, что, например, чтобы изменить изгиб линии, вы должны изменить изгиб двух штрихов, определяющих ее, и изменить толщину, которую вы должны смоделировать одним или обоими штрихами, определяющими его. * Толщина всех штрихов установлена ​​на 0, чтобы они не были видны в финальном рендере*.

source: Parameters that are not considered necessary by the user can be hidden using the **Options** button (|option|) at the bottom right of the **Convert To vector Pop Up**.
ru: Параметры, которые пользователь не считает необходимыми, можно скрыть с помощью кнопки **Опции** (|option|) в правом нижнем углу всплывающего окна **Конвертировать в вектор**.

source: In **Outline** mode the following settings are available:
ru: В режиме **Контурная обводка** доступны следующие настройки:

source: **Accuracy** sets how much the vector strokes will follow the shape of the original drawing lines. High values create more precise strokes, but makes them more complex.
ru: **Точность** устанавливает, насколько векторные штрихи будут повторять форму исходных линий рисования. Высокие значения создают более точные штрихи, но делают их более сложными.

source: **Despeckling** removes small spots or marks from the converted images. Its value expresses the size in pixels of the maximum area that has to be removed.
ru: **Удаление соринок** удаляет небольшие пятна или отметки на преобразованных изображениях. Его значение выражает размер в пикселах максимальной области, которая должна быть удалена.
