Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: ru

source: Click the point of the stroke where you want to modify the thickness and drag up to increase it, or down to decrease it.
ru: Щелкните в точку линии, где вы хотите изменить толщину, и перетащите вверх, чтобы увеличить ее, или вниз, чтобы уменьшить ее.

source: Using the Pump tool to change the thickness of drawn strokes.
ru: С помощью инструмента Насос измените толщину нарисованных штрихов.

source: **To distort several strokes at once:**
ru: **Чтобы деформировать несколько линий одновременно:**

source: Select the **Magnet** tool (|magnet|).
ru: Выберите инструмент **Магнит** (|magnet|).

source: Click in the Viewer: all the strokes included in the circle will be affected by the tool.
ru: Щелкните в окне просмотра: инструмент будет влиять на все линии, включенные в круг.

source: Drag to distort the strokes in the direction of your dragging.
ru: Перетащите, чтобы исказить линии в направлении вашего перетаскивания.

source: **To bend one or several strokes:**
ru: **Чтобы согнуть одну или несколько строк:**

source: Select the **Bender** tool (|bender|).
ru: Выберите инструмент **Клещи** (|bender|).

source: Click on one side of the strokes you want to bend to set the center of the bend.
ru: Нажмите на одну сторону линий, которые вы хотите согнуть, чтобы установить центр сгиба.

source: Click on the opposite side of the strokes: all strokes intersected by the defined line will be affected by the bending.
ru: Нажмите на противоположную сторону линий: изгиб повлияет на все линии, пересекаемые определенной линией.

source: Drag in the direction you want to bend strokes.
ru: Перетащите в нужном направлении, чтобы согнуть линии.

source: **To smooth a stroke:**
ru: **Для выпрямления линии:**

source: Select the **Iron** tool (|iron|).
ru: Выберите инструмент **Утюг** (|iron|).

source: Click and drag along the stroke you want to smooth. By dragging over and over the stroke will increasingly flatten.
ru: Нажмите и перетащите вдоль линии, которую вы хотите спрямить. При перетаскивании снова и снова линия будет все больше выпрямляться.

source: Joining and Splitting
ru: Присоединение и разделение

source: To join the ends of two different vector strokes, you can use the **Tape** tool (|tape|). This way it will be possible to handle them as a single stroke, for instance for modifying their bend, or thickness, as a whole.
ru: Чтобы соединить концы двух разных векторных линий, вы можете использовать инструмент **Скотч** (|tape|). Таким образом, будет возможно обрабатывать их как одну линию, например, для изменения их изгиба или толщины в целом.

source: When the tool is used, the pointer snaps to the closest detected stroke endpoint in order to make the operation easier.
ru: Когда инструмент используется, указатель привязывается к ближайшей обнаруженной конечной точке хода, чтобы упростить операцию.

source: The **Tape** tool (|tape|) can also be used to close gaps along the drawing outline for painting purposes (see :ref:`Closing Gaps in Drawing Outline <closing_gaps_in_drawing_outline>` ).
ru: Инструмент **Скотч** (|tape|) также можно использовать для закрытия зазоров вдоль контура рисунка в целях заливки (см. :ref:`Закрытие пробелов в контуре рисунка <closing _gaps_in_drawing_outline>`).

source: To do the contrary, that is to say splitting a stroke in two sections, you can use the **Cutter** tool (|cutter|).
ru: Чтобы сделать наоборот, то есть разделить черту на две части, вы можете использовать инструмент **Нож** (|cutter|).

source: **To join two open ends of one or two strokes:**
ru: **Чтобы соединить два открытых конца одной или двух линий:**

source: Select the **Tape** tool (|tape|), and activate the **Join Vectors** option; activate also the **Smooth** option if you want a smooth joining with no corners.
ru: Выберите инструмент **Скотч** (|tape|) и активируйте опцию **Соеднинять векторы**; активируйте также параметр **Плавность**, если вы хотите плавное соединение без углов.

source: Set the type to **Normal** and the mode to **Endpoint to Endpoint**, click a stroke endpoint and drag to a different endpoint; the pointer snaps to the closest detected stroke endpoint.
ru: Установите режим **Обычный** и режим **Вершина к вершине**, щелкните конечную точку линии и перетащите на другую конечную точку; указатель привязывается к ближайшей обнаруженной конечной точке линии.

source: Set the type to **Rectangular**, and click and drag to define a box including the endpoints you want to connect; the endpoints will be automatically joined according to the set **Distance** value.
ru: Установите режим **Прямоугольный**, нажмите и перетащите, чтобы определить поле, включающее конечные точки, которые вы хотите подключить; конечные точки будут автоматически соединены в соответствии с установленным значением **Расстояние**.

source: If the strokes you are going to join have different Styles, the Style of the first vector where you click on will be assigned to the second one after joining.
ru: Если линии, которые вы собираетесь соединить, имеют разные стили, стиль первого вектора, на котором вы щелкнете, будет назначен второму после соединения.

source: **To split a stroke:**
ru: **Чтобы разделить линию:**

source: Select the **Cutter** tool (|cutter|): the pointer snaps to the closest stroke indicating, with a small highlighted segment, the point where you are going to split the stroke.
ru: Выберите инструмент **Нож** (|cutter|): указатель привязывается к ближайшей линии, указывая маленьким выделенным сегментом точку, в которой вы собираетесь разделить линию.

source: Click to split the stroke at the highlighted point.
ru: Нажмите, чтобы разделить линию в выделенной точке.

source: Cleaning up Strokes Intersections
ru: Очистка пересечения линий

source: Vector strokes intersections may be a weak point in drawings to be painted, because if a gap occurs, drawing areas cannot be painted properly.
ru: Пересечения векторных линий могут быть слабым местом на рисунках, которые нужно покрасить, потому что если возникает разрыв, области рисования не могут быть нарисованы должным образом.

source: The best solution for this kind of issue is to overlap the final section of strokes, in order to define clear intersections, then automatically remove the sections that overflow.
ru: Лучшее решение для такого рода проблем - перекрыть последний участок линиями, чтобы определить четкие пересечения, а затем автоматически удалить излишние концы линий.

source: **To cleanup vector intersections:**
ru: **Для очистки векторных пересечений:**

source: Use the **Selection** tool (|selection|) to select the strokes whose intersections you want to cleanup.
ru: С помощью инструмента **Выделение** (|selection|) выберите линии, пересечения которых вы хотите очистить.

source: Choose Edit → **Remove Vector Overflow**.
ru: Выберите Правка → **Удалить векторные излишки**.

source: Right-click the selection and choose **Remove Vector Overflow** from the menu that opens.
ru: Щелкните правой кнопкой мыши по выделенной области и выберите пункт **Удалить векторные излишки** в открывшемся меню.

source: Animation Techniques
ru: Техники анимации

source: Besides drawing frame by frame, one image at a time, until you achieve the animation you want, some other techniques are easier to achieve thanks to OpenToonz features.
ru: Помимо рисования покадрово, по одному изображению за раз, пока вы не достигнете нужной анимации, некоторые функции легче реализовать благодаря функциям OpenToonz.

source: Whatever the technique is, you can control your work and how smooth the animation is by using the onion skin, that allows you to view more than one image in the viewer at the same time as reference.
ru: Какой бы ни была техника, вы можете контролировать свою работу и плавность анимации, используя кальку, которая позволяет просматривать более одного изображения в средстве просмотра одновременно в качестве справочного.

source: Modelling a Vector Drawing
ru: Моделирование векторного рисунка

source: Instead of animating a level by starting every time from a blank frame, you can duplicate a vector drawing and make subsequent modifications. You can do it even if the drawings are painted, because the styles used to paint will automatically follow the shape of the areas you modify (see :ref:`Editing Drawings <editing_drawings>` ).
ru: Вместо того, чтобы анимировать уровень, начиная каждый раз с пустого кадра, вы можете продублировать векторный рисунок и внести последующие изменения. Вы можете сделать это, даже если рисунки покрашены, потому что стили, используемые для рисования, будут автоматически следовать форме областей, которые вы изменяете (см. :ref:`Редактирование рисунков <editing_drawings>`).

source: The sequence of the animation level drawings can be easily controlled in the Level Strip.
ru: Последовательность рисунков уровня анимации можно легко контролировать в Level Strip.

source: You can use both the Cells → **Duplicate Drawing** command and the standard **Copy** and **Paste** commands to make a copy of a drawing that you can later modify to create slight movements.
ru: Вы можете использовать обе команды Ячейки → **Дублировать рисунок** и стандартные команды **Копировать** и **Вставить**, чтобы сделать копию рисунка, которую впоследствии можно изменить, чтобы создать небольшие движения.

source: When you use the **Duplicate Drawing** command, the selected drawing is duplicated in the following frame. If the following frame already contains a drawing, it's shifted down in order to insert the duplicated drawing in the sequence.
ru: При использовании команды **Дублировать рисунок** выбранный рисунок дублируется в следующем кадре. Если следующий кадр уже содержит рисунок, он сдвигается вниз, чтобы вставить дублированный рисунок в последовательность.

source: When you use the **Copy** and **Paste** commands, you can also decide the frame of the Level Strip where you want to paste the drawing.
ru: Когда вы используете команды **Копировать** и **Вставить**, вы также можете выбрать кадр уровня, куда вы хотите вставить рисунок.

source: Once finished, you can make a copy of the modified drawing, and modify it in its turn. You can go on duplicating and modifying drawings until you complete the animation level.
ru: Закончив, вы можете сделать копию измененного рисунка и изменить его в свою очередь. Вы можете продолжать дублировать и изменять рисунки, пока не пройдете уровень анимации.

source: **To create an animation level by modelling vector drawings:**
ru: **Чтобы создать уровень анимации путем моделирования векторных рисунков:**

source: In the Viewer, select a drawing of the vector animation level you want to edit.
ru: В окне просмотра выберите рисунок уровня векторной анимации, который вы хотите редактировать.

source: In the Level Strip, select the drawing you want to duplicate.
ru: На Level Strip выберите рисунок, который вы хотите дублировать.

source: Copy the selected drawing in the following frame by doing one of the following:
ru: Скопируйте выбранный рисунок в следующем кадре, выполнив одно из следующих действий:

source: Choose Cells → **Duplicate Drawing**.
ru: Выберите Ячейки → **Дублировать рисунок**.

source: Choose Edit → **Copy**, then select the following frame and choose **Paste**.
ru: Выберите Правка → **Копировать**, затем выберите следующий кадр и выберите пункт меню **Вставить**.

source: Select the new drawing in the Level Strip.
ru: Выберите новый рисунок в Level Strip.

source: Use modifier tools to modify the drawing.
ru: Используйте инструменты-модификаторы для изменения рисунка.

source: Go on duplicating and modifying drawings until you complete the animation level.
ru: Продолжайте дублировать и модифицировать рисунки, пока не пройдете уровень анимации.

source: Using the In-betweener with Vector Drawings
ru: Использование фазовки с векторными рисунками

source: An animation technique reserved to vector animation levels is the use of the **Inbetween** command. Inbetween creates in-between drawings from the two extremes of a range of selected frames in the Level Strip.
ru: Техника анимации, зарезервированная для уровней векторной анимации, - это использование команды **Фазовка**. создает промежуточные рисунки из двух крайних значений диапазона выбранных кадров в Level Strip.

source: When more than two frames are selected in the Level Strip, a vertical strip labeled **INBETWEEN** is displayed on the right of each frame. By clicking on it, all frames between the first and the last selected, will be overwritten by images interpolating from the first to the last drawings.
ru: Если в Level Strip выбрано более двух кадров, справа от каждого кадра отображается вертикальная полоса с надписью **INBETWEEN**. Если щелкнуть по ней, все кадры между первым и последним выбранным будут перезаписаны изображениями, интерполированными от первого до последнего рисунка.

source: Duplicate a drawing; modify it; insert blank frames; select the frame range, then click the INBETWEEN vertical bar.
ru: Продублируйте рисунок; измените его; вставьте пустые кадры; выберите диапазон кадра, затем нажмите вертикальную черту INBETWEEN.

source: The interpolated drawings are created by taking into account the number of the strokes, and the strokes' direction. This means that the result will depend on the way drawings were made. For example if the first image is a single shape drawn clockwise, and the last is another shape, you will get different results depending on the way it was drawn, clockwise or counterclockwise.
ru: Интерполированные рисунки создаются с учетом количества линий и их направления. Это означает, что результат будет зависеть от того, как были сделаны чертежи. Например, если первое изображение представляет собой одну фигуру, нарисованную по часовой стрелке, а последнее - другую фигуру, вы получите разные результаты в зависимости от того, как оно было нарисовано, по часовой стрелке или против часовой стрелки.

source: To obtain the best results with complex drawings, copy the drawing you want to interpolate from, and paste it in another frame of the level strip. Modify the pasted drawing without adding and deleting strokes, but only distorting and moving existing strokes (see :ref:`Editing Drawings <editing_drawings>` ). Select the whole range and then perform the interpolation.
ru: Чтобы получить наилучшие результаты со сложными рисунками, скопируйте рисунок, с которого вы хотите выполнить интерполяцию, и вставьте его в другой кадр Level Strip. Модифицируйте вставленный рисунок, не добавляя и не удаляя линии, а только деформируя и перемещая существующие линии (см. :ref:`Редактирование рисунков <editing_drawings>`). Выберите весь диапазон и затем выполните интерполяцию.

source: The interpolation acceleration can be controlled in the dialog that opens prior to performing in-betweening. Options are the following:
ru: Ускорением интерполяции можно управлять в диалоговом окне, которое открывается перед выполнением режима фазовки. Варианты следующие:

source: **Linear**, for a constant interpolation.
ru: **Линейная**, для постоянной интерполяции.

source: **Ease In**, for an interpolation starting slowly, then getting faster.
ru: **Замедл. в начале**, для интерполяции, начинающейся медленно, а затем ускоряющейся.

source: **Ease Out**, for an interpolation starting quickly, then getting slower.
ru: **Замедл. в конце**, для быстрой, а затем медленной интерполяции.

source: **Ease In / Ease Out**, for an interpolation starting slowly, getting faster, then getting slower again.
ru: **Замедл. в нач./ конце**, для интерполяции, начинающейся медленно, становясь быстрее, а затем снова замедляясь.

source: If you want the interpolation to happen slower or faster, you can insert frames, or cut them, and use the in-betweener again.
ru: Если вы хотите, чтобы интерполяция происходила медленнее или быстрее, вы можете вставить кадры или обрезать их и снова использовать промежуточный элемент.

source: **To create in-between drawings:**
ru: **Для создания фазованных рисунков:**

source: Select the level where you want to perform interpolation.
ru: Выберите уровень, на котором вы хотите выполнить интерполяцию.

source: In the Level Strip select the frame range, from the drawing you want to interpolate from, to the one you want to interpolate to. If you want the interpolation to last more frames, make room for more drawings with the Edit → **Insert** command.
ru: В Level Strip выберите диапазон кадра, от рисунка, с которого вы хотите интерполировать, до того, к которому вы хотите интерполировать. Если вы хотите, чтобы интерполяция длилась больше кадров, освободите место для большего количества рисунков с помощью команды Правка → **Вставить**.

source: Click the vertical strip labeled **INBETWEEN** displayed on the right of the frame range selection.
ru: Нажмите вертикальную полосу с надписью **INBETWEEN**, отображаемую справа от выделенной последовательности кадров.

source: Select the **Interpolation:** mode among **Linear**, **Ease In**, **Ease Out**, **Ease In / Esase Out**, and click the **Inbetween** button.
ru: Выберите режим **Интерполяция:** среди **Линейная**, **Замедление в начале**, **Замедление в конце**, **Замедление в начале/конце**, и щелкните кнопку **Фазовка**.

source: **To optimize the in-betweening process:**
ru: **Для оптимизации фазовочного процесса:**

source: Create and paint the drawing you want to interpolate from.
ru: Создайте и покрасьте рисунок, с которого вы хотите выполнить интерполяцию.

source: **Copy** and **Paste** it in another frame of the Level Strip, considering the number of in-between drawings you want to achieve.
ru: **Скопируйте** и **Вставьте** его в другой кадр Level Strip, учитывая количество промежуточных рисунков, которые вы хотите достичь.

source: **Duplicate** it and insert as many empty frames as the number of in-between drawings you want to achieve.
ru: **Дублируйте** его и вставьте столько пустых кадров, сколько вы хотите достичь между рисунками.

source: Modify the pasted or duplicated drawing using the modifier tools, to create the final drawing of the interpolation.
ru: Измените вставленный или дублированный рисунок с помощью инструментов-модификаторов, чтобы создать окончательный рисунок интерполяции.

source: Select the frame range from the drawing you want to interpolate from, to the one you want to interpolate to.
ru: Выделите последовательность кадров от рисунка, с которого вы хотите интерполировать, до того, к которому вы хотите интерполировать.

source: Click the vertical **INBETWEEN** strip displayed on the right of the frame range selection.
ru: Нажмите на вертикальную полосу **INBETWEEN**, отображаемую справа от выделенной последовательности кадров.

source: Rotoscoping
ru: Ротоскопирование

source: Rotoscoping consists of tracing drawings taking a live clip as reference.
ru: Ротоскопирование состоит из отслеживания рисунков с использованием живого клипа в качестве референса.

source: Using the rotoscoping technique to trace the movement of a hand.
ru: Использование техники ротоскопии для отслеживания движения руки.

source: As you can import clips and image sequences in a scene, you can simply load them, and create an animation level by drawing in the Viewer, while the frames of the clips are visible underneath. See :ref:`Using the File Browser <using_the_file_browser>` .
ru: Поскольку вы можете импортировать клипы и последовательности изображений в сцену, вы можете просто загрузить их и создать уровень анимации, рисуя в окне просмотра, в то время как кадры клипов видны снизу. См. :ref:`Использование браузера файлов <using_the_file_browser>`.

source: The way to obtain best results is not trying to reproduce with fidelity the clip, but to use its frames just as a reference to better understand the movement or the transformation of the clip’s subject. In this way you can take advantage, for example, of a natural movement represented in the clip, without renouncing an expressive drawing style.
ru: Способ получения наилучших результатов заключается не в попытке воспроизвести клип с верностью, а в том, чтобы использовать его кадры просто как справку, чтобы лучше понять движение или трансформацию объекта клипа. Таким образом, вы можете воспользоваться, например, естественным движением, представленным в клипе, не отказываясь от выразительного стиля рисования.

source: **To perform rotoscoping:**
ru: **Чтобы выполнить ротоскопирование:**

source: Load a video clip or image sequence in an Xsheet column (or Timeline layer).
ru: Загрузите видеоклип или последовательность изображений в столбец Xsheet (или слой Timeline).

source: In the Xsheet/Timeline select a cell in a column on the right of the column (or in a layer on top of the layer) containing the clip you loaded. The image of the clip placed at the same frame of the cell you selected will be visible in the Viewer while you're drawing.
ru: В Xsheet/Timeline выберите ячейку в столбце справа от столбца (или в слое поверх слоя), содержащую загруженный клип. Изображение клипа, размещенного в том же кадре выбранной ячейки, будет отображаться в окне просмотра во время рисования.

source: Create a new animation level and use tools to trace the first drawing in the Viewer.
ru: Создайте новый уровень анимации и используйте инструменты, чтобы проследить первый рисунок в средстве просмотра.

source: Move to subsequent frames, and trace the next drawings.
ru: Перейдите к последующим кадрам и проследите следующие рисунки.

source: Cloning Levels
ru: Клонирование уровней

source: Sometimes it may be useful to create a clone of a level, or a part of it, in order to edit it without affecting the original one. For example you may want to create a new animation level starting from the drawings of another level, in order to have two sequences similar but not identical.
ru: Иногда может быть полезно создать клон уровня или его части, чтобы редактировать его, не затрагивая исходный. Например, вы можете захотеть создать новый уровень анимации, начиная с рисунков другого уровня, чтобы две последовательности были похожими, но не идентичными.

source: The **Clone** command allows you to create a copy of the selected cells, preserving the numbering order and assigning a new name to it. The **_clone** suffix appended to the name of the level is the default.
ru: Команда **Клонировать** позволяет создать копию выбранных ячеек, сохранив порядок нумерации и присвоив ему новое имя. Суффикс **_clone**, добавляемый к названию уровня, используется по умолчанию.

source: The cloned level will contain *only drawings exposed in the selected cells*, even if the original level is composed of more drawings; they will be automatically exposed in the column on the right (or layer on top) of the selection, shifting the following columns/layers.
ru: Клонированный уровень будет содержать *только рисунки, отображаемые в выбранных ячейках*, даже если исходный уровень состоит из нескольких рисунков; они будут автоматически отображаться в столбце справа (или в слое сверху) выделения, сдвигая следующие столбцы/слои.

source: The new level will be available in the Scene Cast as a new element; it will be saved in the **+drawings** or **+extras** default folder, according to the format of the original file, as soon as you save it with the **Save Level** command, or you save the scene.
ru: Новый уровень будет доступен в Scene Cast как новый элемент; он будет сохранен в папке **+drawings** или **+extras** по умолчанию в соответствии с форматом исходного файла, как только вы сохраните его с помощью команды **Сохранить уровень** или сохраните сцену.
