Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/drawing_animation_levels.po
Languages: ru

source: It's possible to enter groups to isolate them visually from the rest of the drawing and better understand which strokes are inside and which outside the group. In this way it's also easier to work on the drawing, for instance to fill an area or to change the color of some strokes.
ru: Можно вводить группы, чтобы визуально изолировать их от остальной части рисунка и лучше понять, какие линии находятся внутри, а какие - вне группы. Таким образом, над рисунком также легче работать, например, чтобы заполнить область или изменить цвет некоторых линий.

source: As the **Selection** tool (|selection|) considers the group as a whole, if you want to select a stroke belonging to a group, first you have to enter the group, and then select the stroke.
ru: Так как инструмент **Выделения** (|selection|) рассматривает группу в целом, если вы хотите выбрать линию, принадлежащую группе, сначала необходимо ввести группу, а затем выбрать линию.

source: As groups define which strokes belong to a certain plane, when using the **Fill** tool (|fill|), only areas defined by strokes within the same group can be filled.
ru: Поскольку группы определяют, какие линии принадлежат определенной плоскости, при использовании инструмента **Заливка** (|fill|) могут быть заполнены только области, определенные линиями в одной и той же группе.

source: **To Define a group:**
ru: **Чтобы определить группу:**

source: Use the **Selection** tool (|selection|) to select the strokes you want to be in a group.
ru: Используйте инструмент **Выделение** (|selection|), чтобы выбрать линии, которые вы хотите включить в группу.

source: Choose Edit → **Group**.
ru: Выберите меню Правка → **Сгруппировать**.

source: Right-click on the selection and choose **Group** from the menu that opens.
ru: Щелкните правой кнопкой мыши по выделенному и выберите **Сгруппировать** в открывшемся меню.

source: **To Release a group:**
ru: **Чтобы распустить группу:**

source: Select the group you want to release.
ru: Выберите группу, которую вы хотите распустить.

source: Choose Edit → **Ungroup**.
ru: Выберите меню Правка → **Разгруппировать**.

source: Right-click on the selection and choose **Ungroup** from the menu that opens.
ru: Щелкните правой кнопкой мыши на выделении и выберите **Разгруппировать** в открывшемся меню.

source: **To Enter a group:**
ru: **Для входа в группу:**

source: Select the group, then choose Edit → **Enter Group**.
ru: Выберите группу, затем выберите Правка → **Войти в группу**».

source: Right-click the group and choose **Enter Group** from the menu that opens.
ru: Щелкните правой кнопкой мыши группу и выберите **Войти в группу** в открывшемся меню.

source: Double-click the group.
ru: Дважды щелкните по группе.

source: **To Exit a group:**
ru: **Для выхода из группы:**

source: Choose Edit → **Exit Group**.
ru: Выберите меню Правка → **Выйти из группы**.

source: Right-click the group and choose **Exit Group** from the menu that opens.
ru: Щелкните правой кнопкой мыши группу и выберите **Выход из группы** в открывшемся меню.

source: Double-click outside the group.
ru: Дважды щелкните за пределами группы.

source: **To Select a group:**
ru: **Чтобы выбрать группу:**

source: Choose the **Selection** tool (|selection|) and do any of the following:
ru: Выберите инструмент **Выделения** (|selection|) и выполните одно из следующих действий:

source: Click any stroke belonging to the group.
ru: Щелкните по любой линии, принадлежащей группе.

source: Click and drag to select at least one stroke belonging to the group.
ru: Нажмите и перетащите, чтобы выбрать хотя бы одну линию, принадлежащую группе.

source: Set the type to **Rectangular** and click and drag to define a box and select at least one stroke belonging to the group.
ru: Установите режим **Прямоугольный**, щелкните и перетащите, чтобы определить поле и выберите хотя бы одну линию, принадлежащую группе.

source: Set the type to **Freehand** and click and drag to outline an area and select at least one stroke belonging to the group.
ru: Установите режим **От руки**, щелкните и перетащите, чтобы обвести область и выберите хотя бы одну линию, принадлежащую группе.

source: Set the type to **Polyline** and click to outline an area by defining a series of lines and select at least one stroke belonging to the group.
ru: Установите режим **Полилиния** и щелкните, чтобы обвести область, определив серию линий, и выберите хотя бы одну линию, принадлежащую группе.

source: **To Select a stroke in a group:**
ru: **Чтобы выбрать линию в группе:**

source: Enter the group.
ru: Войдите в группу.

source: Click the stroke to select it.
ru: Щелкните по линии, чтобы выбрать ее.

source: Setting Stroke and Group Sorting Order
ru: Установка линии и порядка сортировки группы

source: For each vector drawing, strokes and groups sorting order can be changed by setting what has to lie in front of, and what behind.
ru: Для каждого векторного рисунка порядок сортировки линий и групп можно изменить, установив, что должно находиться впереди, а что позади.

source: Select vector strokes, create groups and set their layering order to better manage the drawing.
ru: Выберите векторные линии, создайте группы и установите их порядок наложения, чтобы лучше управлять рисунком.

source: **To bring the selection to front:**
ru: **Чтобы вывести выделение на передний план:**

source: Choose Edit → **Bring to Front**.
ru: Выберите в мени Правка → **На передний план**.

source: Right-click on the selection and choose **Bring to Front** from the menu that opens.
ru: Щелкните правой кнопкой мыши на выделении и выберите **На передний план** в открывшемся меню.

source: **To bring the selection one level forward:**
ru: **Чтобы перенести выделение на один уровень вперед:**

source: Choose Edit → **Bring Forward**.
ru: Выберите Правка → **На порядок выше**.

source: Right-click on the selection and choose **Bring Forward** from the menu that opens.
ru: Щелкните правой кнопкой мыши по выделению и выберите **На порядок выше** в открывшемся меню.

source: **To send the selection back:**
ru: **Чтобы отправить выделение назад:**

source: Choose Edit → **Send Back**.
ru: Выберите Правка → **На порядок ниже**.

source: Right-click on the selection and choose **Send Back** from the menu that opens.
ru: Щелкните правой кнопкой мыши по выделению и выберите **На порядок ниже** в открывшемся меню.

source: **To send the selection one level backward:**
ru: **Чтобы отправить выделение на один уровень назад:**

source: Choose Edit → **Send Backward**.
ru: Выберите пункт меню Правка → **Отправить на задний план**.

source: Right-click on the selection and choose **Send Backward** from the menu that opens.
ru: Щелкните правой кнопкой мыши по выделению и выберите **Отправить на задний план** в открывшемся меню.

source: Editing Vector Drawings
ru: Редактирование векторных рисунков

source: Vector drawings can be edited in some additional ways by using the set of tools. This allows you for example to better calibrate the bend of a vector, or to change its thickness.
ru: Векторные рисунки могут быть отредактированы некоторыми дополнительными способами, используя набор инструментов. Это позволяет вам, например, лучше откалибровать изгиб вектора или изменить его толщину.

source: All these transformations can be also achieved on already painted drawings, because the fill styles used to paint will automatically follow the shape of the areas you modify, working like “liquid” color, flooding an area defined by an outline.
ru: Все эти преобразования также могут быть достигнуты на уже покрашенных рисунках, потому что стили заливки, используемые для рисования, будут автоматически следовать форме областей, которые вы изменяете, работая как "жидкая" краска, заполняя область, определенную контуром.

source: Editing Vector Control Points
ru: Редактирование векторных контрольных точек

source: To modify a vector by editing its control points you can use the **Control Point Editor** tool (|cpe|).
ru: Чтобы изменить вектор путем редактирования его контрольных точек, вы можете использовать инструмент **Редактор контрольных точек** (|cpe|).

source: Control points have handles whose length and direction define the bend of the vector. With this tool you can select a vector and modify the control point handles, or the bend of a curve defined by control points, and move, add or delete control points.
ru: Контрольные точки имеют ручки, длина и направление которых определяют изгиб вектора. С помощью этого инструмента вы можете выбрать вектор и изменить маркеры контрольной точки или изгиб кривой, определенной контрольными точками, а также перемещать, добавлять или удалять контрольные точки.

source: Control point handles may be linked, that is to say they share the same direction, or not, creating a cusp in the vector; they can also be collapsed in the control point in order to turn it in a corner point. In case only one handle is collapsed, the point will be corner on one side and smooth on the other. When a section of the vector is defined by two corner points, it will be a straight line.
ru: Дескрипторы контрольных точек могут быть связаны, то есть они имеют одинаковое направление, или нет, создавая излом в векторе; они также могут быть свернуты в контрольной точке, чтобы повернуть ее в угловой точке. В случае, если свернута только одна ручка, точка будет угловой с одной стороны и гладкой с другой. Когда сечение вектора определяется двумя угловыми точками, это будет прямая линия.

source: The option Auto Select Drawing is available to automatically select any vector of any drawing visible in the viewer.
ru: Опция Автовыбор рисунка доступна для автоматического выделения любого вектора любого рисунка, видимого в окне просмотра.

source: Click to select a vector stroke and edit its control points; Alt-click to unlink control point handles; Ctrl-click (PC) or Cmd-click (Mac) the selected stroke to add a control point.
ru: Нажмите, чтобы выбрать векторную линию и отредактировать его контрольные точки; Alt-клик, чтобы отсоединить маркеры контрольной точки; Ctrl (PC) или Cmd (Mac)-клик, чтобы выбрать контрольную точку.

source: **To select a vector:**
ru: **Чтобы выбрать вектор:**

source: Click it.
ru: Щелкните по нему.

source: **To edit the bend of a vector:**
ru: **Чтобы редактировать изгиб вектора:**

source: Click and drag the ends of the control point handles.
ru: Нажмите и перетащите концы маркеров контрольной точки.

source: Click and drag the curve defined by the control points to edit it.
ru: Нажмите и перетащите кривую, определенную контрольными точками, чтобы отредактировать ее.

source: Shift-click and drag the curve defined by the control point to edit it by keeping the control points position fixed.
ru: Удерживая нажатой клавишу Shift, перетащите кривую, заданную контрольной точкой, чтобы отредактировать ее, сохранив положение контрольных точек.

source: **To unlink the control point handles:**
ru: **Чтобы отсоединить маркеры контрольной точки:**

source: Alt-click one of the handle ends and drag.
ru: Удерживая клавишу Alt, щелкните один из концов ручки и перетащите.

source: **To link the control point handles:**
ru: **Чтобы связать ручки контрольной точки:**

source: Alt-click one of the handle ends and drag: the other handle snaps to the direction of the one you are dragging.
ru: Удерживая клавишу Alt, щелкните один из концов маркера и перетащите его: другой маркер привязывается к направлению перетаскивания.

source: **To add a control point:**
ru: **Чтобы добавить контрольную точку:**

source: Ctrl-click (Pc) or Cmd-click (Mac) the vector where you want to add a control point.
ru: Ctrl-клик (PС) или Cmd-клик (Mac) вектор, где вы хотите добавить контрольную точку.

source: **To select control points:**
ru: **Чтобы выбрать контрольные точки:**

source: Click a control point to select it.
ru: Нажмите контрольную точку, чтобы выбрать ее.

source: Ctrl-click (Pc) or Cmd-click (Mac) a control point to add it to the selection.
ru: Ctrl-клик (Pc) или Cmd-клик (Mac) контрольной точки, чтобы добавить ее в выделение.

source: Click and drag to select all of the control points that are included in the selection area.
ru: Нажмите и потяните, чтобы выбрать все контрольные точки, которые включены в область выбора.

source: **To move the selection:**
ru: **Чтобы переместить выделение:**

source: Click any selected control point and drag.
ru: Нажмите любую выбранную контрольную точку и потяните.

source: Use the Arrow keys to move the selection one pixel right, left, up or down.
ru: Используйте клавиши со стрелками, чтобы переместить выделение на один пиксель вправо, влево, вверх или вниз.

source: **To delete the selection:**
ru: **Чтобы удалить выделение:**

source: Choose Edit → Delete.
ru: Выберите пункт меню Правка → Удалить.

source: **To turn a control point into a corner point:**
ru: **Чтобы превратить контрольную точку в угловую точку:**

source: Alt-click the control point.
ru: Щелкните с нажатой кнопкой Alt по контрольной точке.

source: Move the handle ends to the control point, in order to collapse them.
ru: Переместите концы ручки к контрольной точке, чтобы свернуть их.

source: Right-click the control point and choose Set Linear Control Point from the menu that opens.
ru: Щелкните правой кнопкой мыши контрольную точку и выберите пункт Задать линейную контрольную точку в открывшемся меню.

source: **To retrieve handles from a corner point:**
ru: **Чтобы получить ручки из угловой точки:**

source: Alt-click the corner point.
ru: Alt-щелкните по угловой точке.

source: Right-click the control point and choose Set Non-linear Control Point from the menu that opens.
ru: Щелкните правой кнопкой мыши контрольную точку и выберите пункт Задать нелинейную контрольную точку в открывшемся меню.

source: Changing the Bend of Vector Strokes
ru: Изменение изгиба векторных линий

source: To modify a bend of a vector stroke in a more intuitive way you can use the **Pinch** tool (|pinch|). You can use it anywhere you want on the stroke, in order to modify the bend in any direction.
ru: Чтобы изменить изгиб векторной линии более интуитивно понятным способом, вы можете использовать инструмент **Щипок** (|pinch|). Вы можете использовать его в любом месте на ходу, чтобы изменить изгиб в любом направлении.

source: When the tool is selected, a segment of the center line of the closest stroke is highlighted: the segment shows the length of the stroke that will be affected by the pinching.
ru: Когда инструмент выбран, отрезок центральной линии ближайшей линии подсвечивается: сегмент показывает длину линии, на которую будет влиять растягивание.

source: The length of the segment depends on the corner points, that the tool automatically detects along the stroke, according to the **Corner** value. It can also be manually set by activating the **Manual** option, and thus using the **Size** value to set the affected length.
ru: Длина сегмента зависит от угловых точек, которые инструмент автоматически определяет вдоль хода, в соответствии со значением **Угол**. Его также можно установить вручную, активировав опцию **Вручную** и, таким образом, используя значение **Размер**, чтобы установить соответствующую длину.

source: When the **Manual** mode is activated, a handle is displayed along the highlighted stroke to control interactively the length of the segment that will be affected by the tool. The handle has a double circle and a square at its ends, that allows you to do the following:
ru: Когда активирован режим **Вручную**, вдоль выделенной линии отображается ручка для интерактивного управления длиной сегмента, на который воздействует инструмент. Ручка имеет двойной круг и квадрат на концах, что позволяет выполнять следующие действия:

source: **Double circle** lets you move the handle along the segment.
ru: **Двойной круг** позволяет перемещать ручку вдоль сегмента.

source: **Square** lets you increase the length of the segment affected by the tool by *clicking and dragging right*, or decrease it by *clicking and dragging left*.
ru: **Квадрат** позволяет увеличить длину сегмента, на который воздействует инструмент, *кликая и перетаскивая вправо*, или уменьшая ее *кликая и перетаскивая влево*.

source: In both Automatic and Manual modes, different types of editing can be performed when clicking and moving the cursor:
ru: Как в автоматическом, так и в ручном режимах, при щелчке и перемещении курсора могут выполняться различные типы редактирования:

source: **Click** and drag to change the bend of the highlighted segment.
ru: **Щелкните и потяните**, чтобы изменить изгиб выделенного сегмента.

source: **Shift-click** and drag to edit the highlighted segment by adding a *cusp*.
ru: **Щелкните, удерживая клавишу Shift,** и перетащите, чтобы отредактировать выделенный сегмент, добавив *кончики*.

source: **Ctrl-click** (Pc) or **Cmd-click** (Mac) and drag to edit the highlighted segment by adding a *corner*.
ru: **Ctrl-клик** (PC) или **Cmd-клик** (Mac) и перетащите, чтобы редактировать выделенный сегмент, добавив *угол*.

source: **To modify the bend of a stroke:**
ru: **Чтобы изменить изгиб линии:**

source: Change the length of the segment affected by the tool by setting the **Corner** value in the tool options bar.
ru: Измените длину сегмента, на который воздействует инструмент, установив значение **Угол** на панели параметров инструмента.

source: Click, Shift-click, or Ctrl-click (Pc) or Cmd-click (Mac) and drag to modify the bend of the highlighted segment.
ru: Щелкните, щелкните с нажатой клавишей Shift или щелкните, удерживая клавишу Ctrl (PС) или Cmd (Mac), и перетащите, чтобы изменить изгиб выделенного сегмента.

source: Click and drag to change the bend; Shift-click to add a cusp; Ctrl-click (PC) or Cmd-click (Mac) to add a corner.
ru: Нажмите и перетащите, чтобы изменить изгиб; Shift-щелчок, чтобы добавить кончики; Ctrl (PC) или Cmd (Mac)-щелчок, чтобы добавить угол.

source: **To modify the bend of a stroke in manual mode:**
ru: **Чтобы изменить изгиб линии вручную:**

source: Activate the **Manual** option in the tool options bar.
ru: Активируйте параметр **Вручную** на панели параметров инструмента.

source: Change the length of the segment affected by the tool by doing one of the following:
ru: Измените длину сегмента, на который воздействует инструмент, выполнив одно из следующих действий:

source: Set the **Size** value in the tool options bar.
ru: Установите значение **Размер** на панели параметров инструмента.

source: Click and drag the small square at one end of the handle displayed along the highlighted stroke.
ru: Нажмите и перетащите маленький квадрат на одном конце ручки, отображаемой вдоль выделенной линии.

source: Click, Shift-click, or Ctrl-click (PC) or Cmd-click (Mac) and drag to modify the bend of the highlighted segment.
ru: Щелкните или щелкните с нажатой клавишу Shift или Ctrl (ПК) или Cmd (Mac) и перетащите, чтобы изменить изгиб выделенного сегмента.

source: **To eliminate a corner point from a segment:**
ru: **Чтобы исключить угловую точку из сегмента:**

source: Click and drag the point until the smooth segment is formed again.
ru: Нажмите и перетащите точку, пока гладкий сегмент не будет сформирован снова.

source: Click and drag to correct the bend of the newly smoothed segment.
ru: Нажмите и перетащите, чтобы исправить изгиб недавно сглаженного сегмента.

source: Using Other Modifier Tools
ru: Применение других модифицирующих инструментов

source: To modify the thickness of a stroke you can use the **Pump** tool (|pump|). You can use it anywhere you want on the stroke to increase or decrease the thickness locally. When the tool is selected, a segment of the closest stroke is highlighted: the segment shows the length of the stroke that will be affected by the tool. To modify this length you can change the **Size** value in the tool options bar.
ru: Чтобы изменить толщину штриха, вы можете использовать инструмент **Насос** (|pump|). Вы можете использовать его где угодно, чтобы увеличить или уменьшить толщину локально. Когда инструмент выбран, сегмент ближайшей линии подсвечивается: сегмент показывает длину линии, на которую воздействует инструмент. Чтобы изменить эту длину, вы можете изменить значение **Размер** на панели параметров инструмента.

source: It's possible to modify the thickness of a stroke, a stroke selection, or strokes in all of the level drawings, by using the **Selection** tool (|selection|) and its related options (see :ref:`Using the Selection Tool <using_the_selection_tool>` ).
ru: Можно изменить толщину линии, выделенных линий или линии на всех рисунках уровней с помощью инструмента **Выделения** (|selection|) и связанных с ним параметров (см. :ref:`Использование инструмента выделения <using_the_selection_tool>`).

source: To distort more than one stroke at once, you can use the **Magnet** tool (|magnet|). The tool affects all stroke included in a circular area and allows you to distort them in the direction of your dragging. Highlighted segments will show the strokes that will be affected. To modify the action range of the tool, represented by a circle, you can change the tool size in the tool options bar.
ru: Чтобы исказить более одной линии одновременно, вы можете использовать инструмент **Магнит** (|magnet|). Инструмент влияет на все линии, включенные в круглую область, и позволяет искажать их в направлении перетаскивания. Выделенные сегменты покажут линии, которые будут затронуты. Чтобы изменить диапазон действия инструмента, представленный кружком, вы можете изменить размер инструмента на панели параметров инструмента.

source: To bend a part of a drawing, for example a character’s arm, you can use the **Bender** tool (|bender|). The tool allows you to define a line and then bend all the strokes intersected by the segment. While bending you can see the affected strokes assuming their position after the transformation. The bending can be performed in both clockwise and counterclockwise direction; once you start dragging you cannot change the bend direction.
ru: Чтобы согнуть часть рисунка, например руку персонажа, вы можете использовать инструмент **Клещи** (|bender|). Инструмент позволяет определить линию, а затем согнуть все линии, пересекаемые сегментом. Во время изгиба вы можете видеть пораженные линии, принимающие их положение после трансформации. Изгиб может быть выполнен как по часовой стрелке, так и против часовой стрелки; как только вы начинаете перетаскивать, вы не можете изменить направление изгиба.

source: If you move the cursor far from the bending center, you will be able to set with more precision the amount of bend you want to apply to the strokes.
ru: Если вы переместите курсор далеко от центра изгиба, вы сможете с большей точностью установить величину изгиба, который вы хотите применить к линиям.

source: To smooth a stroke, you can use the **Iron** tool (|iron|). When used again and again on the same stroke, it increasingly flatten the bends of the stroke. When the tool is selected, the cursor snaps to the closest stroke to indicate where you are going to operate.
ru: Чтобы сгладить линии, вы можете использовать инструмент **Утюг** (|iron|). При повторном и повторном использовании одного и того же хода он все больше сглаживает изгибы хода. Когда инструмент выбран, курсор привязывается к ближайшей линии, чтобы указать, где вы собираетесь работать.

source: **To modify the thickness of a stroke:**
ru: **Чтобы изменить толщину линии:**

source: Select the **Pump** tool (|pump|).
ru: Выберите инструмент **Насос** (|pump|).

source: Set the **Size:** value in the tool options bar.
ru: Установите значение **Размер:** на панели параметров инструмента.
