Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/editing_animation_levels.po
Languages: ru

source: If two different drawings are associated at different frames to the same drawing exposed in the first column of the selection, only the first one will be applied.
ru: Если два разных рисунка связаны в разных кадрах с одним и тем же рисунком, представленным в первом столбце выбора, будет применен только первый.

source: Drawings not corresponding to any drawing exposed in the first column of the selection will be ignored.
ru: Рисунки, не соответствующие ни одному рисунку, представленному в первом столбце выделения, будут игнорироваться.

source: It is not possible to merge columns if more than one level is exposed in any of them.
ru: Невозможно объединить столбцы, если в одном из них выставлено более одного уровня.

source: When levels are merged, any geometrical transformation achieved by editing and moving the related column or pegbar, will be retained.
ru: Когда уровни объединены, любое геометрическое преобразование, достигнутое путем редактирования и перемещения соответствующего столбца или переключателя, будет сохранено.

source: For Toonz vector levels each drawing of the merged levels will be retained as a group of vectors in the resulting level drawings; the palette of the resulting level will contain all of the styles used in the drawings of the merged levels.
ru: Для векторных уровней Toonz каждый рисунок объединенных уровней будет сохранен в виде группы векторов в результирующих рисунках уровней; палитра результирующего уровня будет содержать все стили, используемые на рисунках объединенных уровней.

source: **To merge animation levels:**
ru: **Чтобы объединить уровни анимации:**

source: Select the columns where the animation levels you want to merge are exposed.
ru: Выберите столбцы, в которых отображаются уровни анимации, которые вы хотите объединить.

source: Choose Xsheet → Merge Levels.
ru: Выберите Xsheet → Объединить уровни.

source: Merging Toonz Raster Levels
ru: Слияние растровых уровней Toonz

source: The → Merge tlv Levels allows to combine several columns containing Toonz Raster Levels creating a new TLV level. The merged columns will be eliminated from the and replaced with a new TLV level.
ru: Команда Xsheet → Объединить уровни позволяет объединять несколько столбцов, содержащих растровые уровни Toonz, создавая новый уровень TLV. Объединенные столбцы будут удалены из и заменены новым уровнем TLV.

source: Using the → Merge tlv Levels command the number of resulting drawings will depend on the frames combination of the involved levels. When merging Toonz Raster levels, the resolution of the resulting level will depend on the resolution of the drawings exposed in the first column on the left of the selection.
ru: С помощью команды Xsheet → Merge tlv Levels количество полученных рисунков будет зависеть от комбинации кадров задействованных уровней. При объединении уровней Toonz Raster разрешение результирующего уровня будет зависеть от разрешения рисунков, отображаемых в первом столбце слева от выделения.

source: The frame numbering order is followed; this means that the merge level will be created following the frames numbering.
ru: Порядок нумерации кадров соблюдается; это означает, что уровень слияния будет создан после нумерации кадров.

source: If a combination of drawings will be reused the drawing previously created will be reused.
ru: Если комбинация рисунков будет использоваться повторно, ранее созданный рисунок будет использоваться повторно.

source: Also the palettes of the selected levels will be merged.
ru: Палитры выбранных уровней также будут объединены.

source: **It is not possible to merge columns if more than one level is exposed in any of them.**
ru: **Невозможно объединить столбцы, если в одном из них выставлено более одного уровня.**

source: **To merge tlv levels:**
ru: **Чтобы объединить уровни TLV:**

source: Select two ore more columns filled with the tlv you want to merge.
ru: Выберите еще два или более столбцов, заполненных TLV, которые вы хотите объединить.

source: Choose → Merge tlv Levels
ru: Выберите Xsheet → Объединить уровни

source: Define File name and location in the pop up that opens and press Apply.
ru: Определите имя и местоположение файла в открывшемся всплывающем окне и нажмите Применить.

source: Processing Levels
ru: Обработка уровней

source: Some commands are available to process the raster levels in order to adjust the brightness and contrast or the levels, to fade the colors toward a defined set of Red, Green, Blue and Alpha values, to adjust the levels of the images or to binarize them. The Adjust Thickness command is available to modify the thickness of the lines on Toonz Vector Levels.
ru: Доступны некоторые команды для обработки растровых уровней с целью регулировки яркости и контрастности или уровней, для постепенного изменения цветов в соответствии с определенным набором значений красного, зеленого, синего и альфа-канала, для настройки уровней изображений или для их преобразования в двоичную форму , Команда Отрегулировать толщину доступна для изменения толщины линий на векторных уровнях Toonz.

source: A preview area is available to check the result of the applied processing: you can navigate its content and set its size.
ru: Область предварительного просмотра доступна для проверки результатов примененной обработки: вы можете перемещаться по ее содержимому и устанавливать еее размер.

source: The processed images are stored in the cache and will be saved on disk using the save level or the save scene command.
ru: Обработанные изображения сохраняются в кэше и сохраняются на диске с использованием уровня сохранения или команды сохранения сцены.

source: **To resize the preview area:**
ru: **Чтобы изменить размер области предварительного просмотра:**

source: Click and drag the horizontal separator.
ru: Нажмите и перетащите горизонтальный разделитель.

source: Click and drag the separator toward the window border to hide the preview area.
ru: Нажмите и перетащите разделитель к границе окна, чтобы скрыть область предварительного просмотра.

source: Click and drag the separator collapsed to the window border toward the window center to display again the preview area.
ru: Нажмите и перетащите разделитель, свернутый к границе окна, к центру окна, чтобы снова отобразить область предварительного просмотра.

source: **To navigate the preview area:**
ru: **Для навигации по области предварительного просмотра:**

source: Use the mouse wheel, or the zoom shortcut keys (by default + and - keys) to zoom in and zoom out.
ru: Используйте колесико мыши или сочетания клавиш увеличения (по умолчанию клавиши + и -) для увеличения или уменьшения масштаба.

source: Middle-click and drag to scroll in any direction.
ru: Нажмите среднюю кнопку мыши и перетащите, чтобы прокрутить в любом направлении.

source: Use the reset view shortcut (by default the 0 key) to display preview at its actual size.
ru: Используйте горячую клавишу сброса просмотра (по умолчанию клавиша 0), чтобы отобразить предварительный просмотр в его реальном размере.

source: Brightness and Contrast
ru: Яркость и контрастность

source: In case it is needed to adjust drawings in order to increase the darkness and the opacity of the drawing, it is possible to process them by calibrating the brightness and contrast.This is available only for raster levels.
ru: В случае, если необходимо отрегулировать рисунки для увеличения темноты и непрозрачности рисунка, их можно обработать, откалибровав яркость и контрастность. Это доступно только для растровых уровней.

source: **To process drawings brightness and contrast:**
ru: **Для обработки рисунков яркость и контрастность:**

source: Select the images or the level frames to process in the .
ru: Выберите изображения или рамки уровня для обработки в Xsheet.

source: Choose Level → Brightness and Contrast.
ru: Выберите Уровень → Яркость и контрастность.

source: In the dialog that opens set the brightness and contrast variation.
ru: В открывшемся диалоговом окне установите изменение яркости и контрастности.

source: Click the Apply button.
ru: Нажмите кнопку Применить.

source: Add Antialias
ru: Добавление сглаживания

source: Allows to add antialias or to make it smoother or harder on raster and Toonz raster images.
ru: Позволяет добавить сглаживание или сделать его более гладким или более жестким на растровых и растровых изображениях Toonz.

source: **To use the Add Antialias command:**
ru: **Чтобы использовать команду Добавить сглаживание:**

source: Choose Level → Add Antialias...
ru: Выберите Уровень → Сглаживание...

source: In the dialog that opens set the threshold and the smoothness values.
ru: В открывшемся диалоговом окне установите предел и значения мягкости.

source: Adjust Levels
ru: Регулировка уровней

source: Adjusts the highlights and shadows of the Source content by remapping pixels intensity according to the Input and Output levels values for the RGB, Red, Green, Blue and Alpha channels.
ru: Регулирует блики и тени содержимого источника путем переназначения интенсивности пикселей в соответствии со значениями уровней входного и выходного сигналов для каналов RGB, Красный, Зеленый, Синий и Альфа.

source: **To adjust images levels:**
ru: **Чтобы настроить уровни изображений:**

source: Select the images or the level frames to adjust in the .
ru: Выберите изображения или кадры уровней для настройки в Xsheet.

source: Choose Level → Adjust Levels.
ru: Выберите Уровень → Коррекция цветовых уровней.

source: Adjust the image levels
ru: Отрегулируйте уровни изображения

source: Adjust Thickness
ru: Регулировка толщины

source: The Adjust Thickness command allows to modify the thickness of all the lines of the layer or of those selected. If no line is selected the command acts on the whole level, otherwise it works on selected lines.
ru: Команда Отрегулировать толщину позволяет изменить толщину всех линий слоя или только выбранных. Если ни одна линия не выбрана, команда действует на весь уровень, в противном случае она работает на выбранных линиях.

source: **To adjust the thickness of the lines:**
ru: **Чтобы настроить толщину линий:**

source: Choose Level → Adjust Thickness.
ru: Выберите Уровень → Отрегулировать толщину.

source: Choose a mode. The modes are: Scale Thickness that scale lines up or down using a percentage value, Add Thickness that add an amount of thickness to the lines using the current unit, Costant Thickness that apply a thickness value, ignoring its variations, using the current unit.
ru: Выберите режим. Доступны следующие режимы: Масштаб толщины, которая масштабирует линии вверх или вниз с использованием процентного значения, Добавить толщину, которая добавляет величину толщины к линиям, используя текущую единицу, Постоянная толщина, которая применяет значение толщины, игнорируя его изменения, используя текущую единицу измерения.

source: Sets a starting and an ending value.
ru: Установите начальное и конечное значение.

source: Press the Apply button.
ru: Нажмите кнопку Применить.

source: Color Fade
ru: Спад цвета

source: In case it is needed to adjust the drawing colors it is possible to fade the drawings toward a color defined by Red, Green, Blue and Alpha values. The Intensity, expressed as a percentage, ranges from 0 to 100.The original color will fade to the color you set according with the Intensity parameter. This is available only for raster levels.
ru: В случае, если необходимо отрегулировать цвета рисунка, можно затенить рисунки в цвет, определенный значениями Красный, Зеленый, Синий и Альфа. Интенсивность, выраженная в процентах, варьируется от 0 до 100. Исходный цвет будет блекнет до цвета, который вы установили в соответствии с параметром Интенсивность. Это доступно только для растровых уровней.

source: **To fade drawing colors:**
ru: **Чтобы затенить цвета рисования:**

source: Select the images or the level frames to fade in the .
ru: Выберите изображения или рамки уровня, чтобы затенить, в Xsheet.

source: Choose Level → Color Fade.
ru: Выберите Уровень → Спад цвета.

source: In the dialog that opens set the color you want to fade the selection to by doing one of the following:
ru: В открывшемся диалоговом окне установите цвет, к которому хотите добавить выделение, выполнив одно из следующих действий:

source: Set the Red, Green and Blue values.
ru: Установите значения красного, зеленого и синего.

source: Click the color thumbnail and use the Style Editor to edit it (see :ref:`Editing Styles <editing_styles>` ).
ru: Нажмите на миниатюру цвета и используйте Редактор стилей для его редактирования (см. :ref:`Редактирование стилей <editing_styles>`).

source: Move the Intensity slider to set the value.
ru: Переместите ползунок интенсивности, чтобы установить значение.

source: Binarize
ru: Бинаризация

source: Allows you to process colored raster lines images recognizing basic colors (red, green, blue, cyan, magenta and yellow) plus black. The process produce an uniform background color, eliminating shadows and dirty pixels.
ru: Позволяет обрабатывать цветные растровые линии изображений, распознавая основные цвета (красный, зеленый, синий, голубой, пурпурный и желтый), а также черный. Процесс производит однородный цвет фона, устраняя тени и грязные пиксели.

source: The colored lines are identified and all the pixels belonging to each line are changed to the maximum value of the identified color. The anti-aliasing is removed.
ru: Цветные линии идентифицируются, и все пиксели, принадлежащие каждой строке, изменяются на максимальное значение идентифицированного цвета. Сглаживание удалено.

source: The use o f this command is useful to pre-process scanned images simplifying the Cleanup process.
ru: Использование этой команды полезно для предварительной обработки отсканированных изображений, что упрощает процесс очистки.

source: The preview is available to check the result. The alpha toggle allows to produce images with a transparent background.
ru: Предварительный просмотр доступен для проверки результата. Альфа-переключатель позволяет создавать изображения с прозрачным фоном.

source: **To binarize images:**
ru: **Для бинаризации изображений:**

source: Choose Level → Binarize.
ru: Выберите Уровень → Бинаризация...

source: Activate the Preview toggle to check the result.
ru: Активируйте переключатель предварительного просмотра, чтобы проверить результат.

source: Activate the Alpha toggle if you need transparent background.
ru: Активируйте переключатель альфа-канала, если вам нужен прозрачный фон.

source: Saving Levels
ru: Сохранение уровней

source: All the editing performed in the level strip is not saved until you save the level. You can also automatically save all of the editing done on any level of the by saving the scene (see :ref:`Saving and Loading Scenes <saving_and_loading_scenes>` ).
ru: Все изменения, выполненные в Level Strip, не сохраняются, пока вы не сохраните уровень. Вы также можете автоматически сохранить все изменения, выполненные на любом уровне, путем сохранения сцены (см. :ref:`Сохранение и загрузка сцен <saving_and_loading_scenes>`).

source: When saving an animation level it is possible to automatically create a backup file of the previous version by setting the Backup Animation Levels when Saving option in the Preferences → General dialog. The backup version is created in the same location where the level is saved, and has an _backup suffix.
ru: При сохранении уровня анимации можно автоматически создать файл резервной копии предыдущей версии, установив параметр Делать резервные копии уровней при сохранении в диалоговом окне Настройки программе → Общие. Версия резервной копии создается в том же месте, где сохранен уровень и имеет суффикс _backup.

source: An asterisk after the level name in the level strip title bar denotes that there are unsaved changes for the current level.
ru: Звездочка после имени уровня в строке заголовка полосы уровня обозначает наличие несохраненных изменений для текущего уровня.

source: **To save the current level:**
ru: **Чтобы сохранить текущий уровень:**

source: Choose File → Save Level.
ru: Выберите Файл → Сохранить уровень.

source: Right-click in the scene cast and choose Save Level from the menu that opens.
ru: Щелкните правой кнопкой мыши на сцене и выберите Сохранить уровень в открывшемся меню.

source: **To save the current level with a different name in a different location:**
ru: **Чтобы сохранить текущий уровень с другим именем в другом месте:**

source: Choose File → Save Level As.
ru: Выберите Файл → Сохранить уровень как.

source: In the browser that opens select for the level you want to save a location and name, and click the Save button.
ru: В открывшемся браузере файлов выберите уровень, для которого вы хотите сохранить местоположение и имя, и нажмите кнопку Сохранить.

source: The Save Level As command creates a copy of the level with a different file name and location, but does not change the name and location of the level used in the scene.
ru: Команда Сохранить уровень как создает копию уровня с другим именем и местоположением файла, но не изменяет имя и местоположение уровня, используемого в сцене.

source: Exporting Levels
ru: Экспорт уровней

source: Animation levels created with OpenToonz can be exported in a variety of image file formats in order to be used in third-party software. The levels are exported as a sequence of files named with a progressive four-digits number written between the file name and the file extension, e.g. ``animation.0001.tif`` , ``animation.0002.tif`` , etc.or a single file for the .TLV format. File formats available are BMP, JPG, PNG, TGA ,TIF and TLV (the .TLV format is available only to export vector levels (.PLI); the format options can be set for each format in the Output Settings dialog (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
ru: Уровни анимации, созданные с помощью OpenToonz, можно экспортировать в различные форматы файлов изображений для использования в стороннем программном обеспечении. Уровни экспортируются в виде последовательности файлов, названных с возрастающим четырехзначным числом, записанным между именем файла и расширением файла, например, ``animation.0001.tif``, ``animation.0002.tif`` и т.д. или один файл для формата .TLV. Доступные форматы файлов: BMP, JPG, PNG, TGA, TIF и TLV (формат .TLV доступен только для экспорта векторных уровней (.PLI); параметры формата можно установить для каждого формата в диалоговом окне Настройки вывода (см. :ref:`Выбор настроек вывода <choosing_the_output_settings>`).

source: When exporting vector levels, the size and resolution of the exported sequence can be defined in the Export Level dialog. The default size and resolution are those defined in the camera settings, and the preview of the resulting image is visible in the preview area of the Export Options page to understand how the exported images will be cropped (see :ref:`Defining Camera Settings <defining_camera_settings>` ). The size of the exported image can be changed entering a scale value in the Scale field.
ru: При экспорте векторных уровней размер и разрешение экспортируемой последовательности можно определить в диалоговом окне Экспорт уровня. Размер и разрешение по умолчанию соответствуют параметрам, заданным в настройках камеры, а предварительный просмотр полученного изображения отображается в области предварительного просмотра на странице Параметры экспорта, чтобы понять, как будут обрезаны экспортированные изображения (см. :ref:`Определение настроек камеры <defining_camera_settings>`). Размер экспортируемого изображения можно изменить, введя значение масштаба в поле Масштаб.

source: Any trucking, resizing and animation of the camera is not considered when exporting vector levels.
ru: Любое перемещение, изменение размера и анимация камеры не учитываются при экспорте векторных уровней.

source: The Retas Compliant option name the exported sequence with a a progressive four-digits number suffix before the file extension, e.g. ``animation0001.tga`` , ``animation0002.tga`` , etc and sets the exporting format to TGA.
ru: Параметр Совместимый с Retas дает имя экспортированной последовательности с прогрессивным четырехзначным числовым суффиксом перед расширением файла, например, ``animation0001.tga``, ``animation0002.tga`` и т.д. и устанавливает формат экспорта в TGA.

source: Background Color allows to set the RGBA values of the background color.
ru: Цвет фона позволяет установить значения RGBA цвета фона.

source: The No Antialias option allow to remove the antialias from the exported sequence.
ru: Опция Без сглаживания позволяет удалить сглаживание из экспортируемой последовательности.

source: **To export the current level:**
ru: **Чтобы экспортировать текущий уровень:**

source: Choose File → Export Level.
ru: Выберите Файл → Экспорт уровня.

source: In the File Browser page select the level you want to save, a location and a name.
ru: На файловом браузере выберите уровень, который вы хотите сохранить, местоположение и имя.

source: Choose the file format you want the exported level to have.
ru: Выберите формат файла, который вы хотите иметь экспортируемый уровень.

source: Activate the Retas Compliant option to export the level in the same format and with the same options that the Retas software uses when exporting painted drawings.
ru: Активируйте опцию Совместимый с Retas, чтобы экспортировать уровень в том же формате и с теми же опциями, которые использует программное обеспечение Retas при экспорте нарисованных рисунков.

source: In the Export Options, sets the RGBA values for the background color.
ru: В Параметрах экспорта задайте значения RGBA для цвета фона.

source: Activate the No Antialias option to remove the anitialias from the exported levels sequence images.
ru: Активируйте опцию Без сглаживания, чтобы убрать сглаживание из экспортированных изображений последовательности уровней.

source: If you are exporting a Toonz Vector Level:
ru: Если вы экспортируете векторный уровень Toonz:

source: Set the Output Size in the Vectors Export Box fields
ru: Установите выходной размер в полях Параметры экспорта векторов

source: Set a Start and End percentage value for the line thickness
ru: Установите начальное и конечное процентное значение для толщины линии

source: Click the Export button.
ru: Нажмите кнопку Экспорт.

source: The Export Level command creates a new version of the level with a different file name, location and format, but does not change the name, location and format of the level used in the scene.
ru: Команда Экспорт уровня создает новую версию уровня с другим именем файла, местоположением и форматом, но не изменяет имя, местоположение и формат уровня, используемого в сцене.

source: **To set the file format options:**
ru: **Чтобы установить параметры формата файла:**

source: Choose File → Output Settings.
ru: Выберите Файл → Настройки вывода.

source: Set the options for the format you want to use for exporting levels.
ru: Установите параметры для формата, который вы хотите использовать для экспорта уровней.
