Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/editing_animation_levels.po
Languages: ru

source: Editing Animation Levels
ru: Редактирование уровней анимации

source: Once you have created your animation levels, you may need to work on them in order to add or insert new drawings, or rearrange the frame sequence.
ru: После того, как вы создали свои уровни анимации, вам может потребоваться поработать над ними, чтобы добавить или вставить новые рисунки или изменить последовательность кадров.

source: All the editing can be saved by saving the level, or by saving the scene with the Save All command, thus automatically saving all of its levels.
ru: Все изменения можно сохранить, сохранив уровень или сохранив сцену с помощью команды Сохранить все, тем самым автоматически сохранив все ее уровни.

source: Using the Level Strip
ru: Использование Level Strip

source: An animation level can be managed in the Level Strip. The Level Strip shows all of the drawings of the current level (even drawings not currently exposed in the Xsheet/Timeline) according to their numbering order.
ru: Уровенем анимации можно управлять Level Strip. Level Strip показывает все рисунки текущего уровня (даже рисунки, которые в настоящее время не отображаются в Xsheet/Timeline) в соответствии с порядком их нумерации.

source: In case a frame range of the animation level has been loaded with the Load Level dialog, only the frames within the allocated frame range will be visible in the level strip (see :ref:`Using the File Browser <using_the_file_browser>` ).
ru: В случае если диапазон кадров уровня анимации был загружен в диалоговом окне Загрузить уровень, только кадры внутри выделенного диапазона кадров будут видны в Level Strip (см. :ref:`Использование обозревателя файлов <using_the_file_browser>`).

source: When a level is selected, each frame of the strip contains a level drawing, according to the level numbering order. When a frame in the strip is selected, the related drawing is displayed in the Viewer, replacing any previous displayed content, to let you work on it more easily.
ru: Когда уровень выбран, каждый кадр Level Strip содержит рисунок уровня в соответствии с порядком нумерации уровней. Когда в Level Strip выбран кадр, соответствующий рисунок отображается в окне просмотра, заменяя собой любой предыдущий отображаемый контент, чтобы вам было легче работать с ним.

source: When one or more frames are selected you can perform standard cut, copy, paste, delete and insert operations. New drawings can be added, and any sequence can be renumbered. From the Level Strip, drawings can be also exposed in the Xsheet/Timeline.
ru: Когда выбран один или несколько кадров, вы можете выполнять стандартные операции вырезания, копирования, вставки, удаления и вставки. Новые рисунки могут быть добавлены, и любая последовательность может быть перенумерована. С Level Strip рисунки также могут быть представлены в Xsheet/Timeline.

source: When you change the order of the drawings in the Level Strip, or when a drawing is cut, deleted or inserted, and drawings are exposed in the scene, the Xsheet/Timeline will continue to contain a reference to that particular frame of the animation level, whatever its content is. When the Xsheet/Timeline contains a reference to a drawing that is eliminated in the Level Strip, the level name and number turn red, to warn you that there is no drawing available for that cell anymore.
ru: Когда вы изменяете порядок рисунков в Level Strip или когда рисунок вырезается, удаляется или вставляется, а рисунки экспонируются в сцене, Xsheet/Timeline будет по-прежнему содержать ссылку на этот конкретный кадр уровня анимации каким бы ни было его содержание. Когда Xsheet/Timeline содержит ссылку на рисунок, который исключен в Leve Strip, имя и номер уровня становятся красными, чтобы предупредить вас, что для этой ячейки больше нет рисунка.

source: The width of the level strip pane cannot be resized freely, because it depends on the size of the animation level preview icons, but it can be customized in the Preferences → Interface dialog.
ru: Ширина окна Level Strip не может быть свободно изменена, поскольку она зависит от размера значков предварительного просмотра уровня анимации, но ее можно настроить в диалоговом окне Настройка программы → Интерфейс.

source: **To edit an animation level in the Level Strip:**
ru: **Чтобы редактировать уровень анимации в Level Strip:**

source: Do one of the following:
ru: Выполните одно из следующих действий:

source: Select in the Xsheet/Timeline a cell containing a drawing from the animation level you want to edit.
ru: Выберите в Xsheet/Timeline ячейку, содержащую рисунок с уровня анимации, который вы хотите редактировать.

source: Right-click the level icon in the Scene Cast and choose Display in Level Strip from the menu that opens.
ru: Щелкните правой кнопкой мыши значок уровня в Состав сцены и выберите Отобразить в Level Strip в открывшемся меню.

source: **To scroll the Level Strip:**
ru: **Чтобы прокрутить Level Strip:**

source: Middle-click and drag to scroll up or down.
ru: Нажмите среднюю кнопку мыши и п, чтобы прокрутить вверх или вниз.

source: Use the mouse wheel to scroll up or down.
ru: Используйте колесо мыши для прокрутки вверх или вниз.

source: Use the scrolling bars to scroll only within the actual level extent.
ru: Используйте полосы прокрутки для прокрутки только в пределах фактического уровня экстента.

source: Use the Up Arrow and Down Arrow keys to move one frame up or down.
ru: Используйте клавиши со стрелками вверх и вниз для перемещения на один кадр вверх или вниз.

source: Use the Page Up and Page Down keys to scroll the visible frames up or down.
ru: Используйте клавиши Page Up и Page Down для прокрутки видимых кадров вверх или вниз.

source: Use the Home and End keys to scroll up to the beginning or the end of the level strip content.
ru: Используйте клавиши Home и End для прокрутки вверх до начала или конца содержимого Level Strip.

source: **To select drawings in the Level Strip:**
ru: **Чтобы выбрать рисунки на Level Strip:**

source: Click a drawing to select it.
ru: Нажмите на рисунок, чтобы выбрать его.

source: Click and drag to select a series of drawings.
ru: Нажмите и перетащите, чтобы выбрать серию рисунков.

source: Shift-click a frame to extend the selection up to that frame.
ru: Удерживая клавишу Shift, щелкните рамку, чтобы расширить выделение до этой рамки.

source: Ctrl-click (PC) or Cmd-click (Mac) the frames to add them to, or remove them from the selection.
ru: Удерживая клавишу Ctrl (PC) или Cmd (Mac), добавьте или удалите кадры из выделения.

source: Use the Edit → Select All command to select all of the level drawings.
ru: Используйте команду Правка → Выбрать все, чтобы выбрать все рисунки уровней.

source: Use the Edit → Invert Selection command to invert the current selection of drawings.
ru: Используйте команду Правка → Обратить выделенное, чтобы инвертировать текущее вывыбор рисунков.

source: The Select All and Invert Selection commands are also available in the menu that opens when right-clicking in the Level Strip.
ru: Команды Выбрать все и Обратить выделенное также доступны в меню, которое открывается при щелчке правой кнопкой мыши по Level Strip.

source: **To exit the level strip editing mode:**
ru: **Чтобы выйти из режима редактирования Level Strip:**

source: Click a cell or select a frame in the frames area of the Xsheet/Timeline.
ru: Щелкните ячейку или выберите кадр в области кадров Xsheet/Timeline.

source: **To customize the level strip width:**
ru: **Чтобы настроить ширину Level Strip:**

source: Choose File → Preferences → Interface.
ru: Выберите Файл → Настройки программы→ Интерфейс.

source: Set the Width and Height values of the level strip Icon Size*.
ru: Установите значения ширины и высоты Level Strip Размер иконки*.

source: Restart OpenToonz to make the changes effective.
ru: Перезапустите OpenToonz, чтобы изменения вступили в силу.

source: Editing Level Frames
ru: Редактирование кадров уровня

source: The level content can be edited one frame at a time, for example for retouching some artwork or copying a part of a drawing to a different frame, or several frames at the same time, for example to rearrange the drawing sequence.
ru: Контент уровня может быть отредактирован по одному кадру за раз, например, для ретуширования некоторой иллюстрации или копирования части рисунка в другой кадр или нескольких кадров одновременно, например, чтобы изменить порядок следования рисунка.

source: **To edit a drawing of an animation level:**
ru: **Чтобы отредактировать рисунок уровня анимации:**

source: Select the frame in the Level Strip containing the drawing you want to modify.
ru: Выберите кадр в Level Strip, содержащую рисунок, который вы хотите изменить.

source: Use the tools to edit the drawing in the Viewer.
ru: Используйте инструменты для редактирования рисунка в окне просмотра.

source: **To edit drawings of an animation level with the Edit menu commands:**
ru: **Чтобы редактировать рисунки уровня анимации с помощью команд меню Правка:**

source: Select the frames you want to edit.
ru: Выберите кадры, которые вы хотите редактировать.

source: Do any of the following:
ru: Выполните любое из следующих действий:

source: Use the Copy command to keep in memory selected drawings for further operations.
ru: Используйте команду Копировать, чтобы сохранить выбранные рисунки для дальнейших операций.

source: Use the Cut command to eliminate selected drawings from the animation level and keep them in memory for further operations. The frames elimination causes a gap in the level numbering order.
ru: Используйте команду Вырезать, чтобы удалить выбранные рисунки с уровня анимации и сохранить их в памяти для дальнейших операций. Исключение кадров вызывает разрыв в порядке нумерации уровней.

source: Use the Paste command to paste drawings kept in memory in the animation level, starting from the selected insertion frame. The operation shifts down the following frames, and automatically renumbers them. If before the insertion frame there is a numbering gap, the pasted frames will fill the gap before starting to shift and renumber the following frames.
ru: Используйте команду Вставить, чтобы вставить рисунки, хранящиеся в памяти, на уровне анимации, начиная с выбранного кадра вставки. Операция сдвигает следующие кадры и автоматически нумерует их. Если перед вставкой кадра есть пробел в нумерации, вставленные кадры заполнят этот пробел перед началом сдвига и перенумеруют следующие кадры.

source: Use the Paste Into command to paste drawings kept in memory in the frames selected in the level strip, overwriting their content. If the selection contains less frames than those kept in memory, frames in excess will be ignored; if the selection contains more frames than those kept in memory, frames in excess will be left as they are.
ru: Используйте команду Поместить в, чтобы вставить рисунки, хранящиеся в памяти, в кадры, выбранные на Level Strip, перезаписывая их содержимое. Если выделение содержит меньше кадров, чем хранится в памяти, избыточные кадры будут игнорироваться; если выборка содержит больше кадров, чем хранится в памяти, избыток кадров останется без изменений.

source: Use the Delete command to delete selected drawings.
ru: Используйте команду Удалить, чтобы удалить выбранные рисунки.

source: Use the Insert command to insert empty (white) frames before the selection; inserted frames will be as many as the selected ones. The operation shifts down the following frames, and automatically renumbers them.
ru: Используйте команду Вставить, чтобы вставить пустые (белые) рамки перед выделением; вставленных кадров будет столько же, сколько и выбранных. Операция сдвигает следующие кадры и автоматически нумерует их.

source: All of the Edit menu commands are also available in the menu that opens when right-clicking in the level strip.
ru: Все команды меню Правка также доступны в меню, которое открывается при щелчке правой кнопкой мыши на Level Strip.

source: **To edit drawings of an animation level with the Cells menu commands:**
ru: **Чтобы редактировать рисунки уровня анимации с помощью команд меню Ячейки:**

source: Use the Reverse command to invert the order of selected drawings.
ru: Используйте команду Обратить, чтобы инвертировать порядок выбранных рисунков.

source: Use the Swing command to append selected drawings to the end of the selection in a reversed order. The last drawing of the selection will not be repeated.
ru: Используйте команду Добавить в обратном порядке, чтобы добавить выбранные рисунки в конец выделения в обратном порядке. Последний рисунок выбора не будет повторяться.

source: Use the Step 2, Step 3 or Step 4 command to repeat selected drawings in order to have a step 2, step 3 or step 4 animation.
ru: Используйте команду Шаг 2, Шаг 3 или Шаг 4, чтобы повторить выделенные рисунки для анимации шага 2, шага 3 или шага 4.

source: Use the Each 2, Each 3 or Each 4, command to preserve only one drawing each 2, each 3 or each 4, of the selection, and delete the others.
ru: Используйте команду Каждые 2, Каждые 3 или Каждые 4, чтобы сохранить только один рисунок, каждые 2, 3 или 4, а также удалить остальные.

source: Use the Duplicate Drawing command to make a copy of the first drawing of the selection in the following frame. If the following frames already contain drawings, the duplicated drawing will be inserted by shifting the others down.
ru: Используйте команду Дублировать рисунок, чтобы сделать копию первого рисунка выделения в следующем кадре. Если следующие кадры уже содержат рисунки, дублированный рисунок будет вставлен путем сдвига остальных вниз.

source: Use the Merge command to paste in the current level the drawings copied from a different level, according to their original frame position and regardless of the currently selected frames.
ru: Используйте команду Слить, чтобы вставить в текущий уровень рисунки, скопированные с другого уровня, в соответствии с их исходным положением кадра и независимо от выбранных в данный момент кадров.

source: All the Cells menu commands are also available in the menu that opens when right-clicking in the Level Strip.
ru: Все команды меню Ячейки также доступны в меню, которое открывается при щелчке правой кнопкой мыши на Level Strip.

source: Renumbering and Adding Frames in a Level
ru: Изменение нумерации и добавление кадров на уровне

source: When you need to add one or several drawings to a level, you first need to create room for the new drawings. This task can be achieved either using the Insert command (see :ref:`Editing Level Frames <editing_level_frames>` ), or the Renumber dialog.
ru: Когда вам нужно добавить один или несколько рисунков на уровень, вам сначала нужно создать пространство для новых рисунков. Эту задачу можно выполнить либо с помощью команды Вставить (см. :ref:`Редактирование кадров уровня <editing_level_frames>`), либо в диалоговом окне Пересчитать.

source: While the inserting operation automatically shifts the numbering of the following frames in order to make room for the new ones, the renumbering lets you control the way frames have to be renumbered.
ru: В то время как операция вставки автоматически сдвигает нумерацию следующих кадров, чтобы освободить место для новых, перенумерация позволяет контролировать способ нумерации кадров.

source: After the renumbering, drawings are rearranged to have an incremental numbering in the Level Strip, where blank frames are not considered. For example for a level where frames 4 and 5 are renumbered 11 and 12, the Level Strip will display only five frames correctly numbered 1, 2, 3, 11 and 12.
ru: После перенумерации рисунки переупорядочиваются, чтобы иметь добавочную нумерацию в Level Strip, где пустые кадры не рассматриваются. Например, для уровня, где кадры 4 и 5 перенумерованы в 11 и 12, Level Strip будет отображать только пять кадров с правильными номерами 1, 2, 3, 11 и 12.

source: If you need to add a range of frames to a level, for instance for scanning them or creating some artwork, you can add it with the Add Frames dialog. This dialog allows you also to insert drawings in a level numbered in an irregular way, for example after some frames which have been cut or renumbered.
ru: Если вам нужно добавить последовательность кадров к уровню, например, для их сканирования или создания какого-либо графического объекта, вы можете добавить его в диалоговом окне Добавить кадры. Этот диалог позволяет вам также вставлять рисунки на уровне, который нумеруется нерегулярно, например, после того, как некоторые кадры были вырезаны или перенумерованы.

source: Both the renumbering and the adding frames operation fails if the numbering assigned to the frames is used by already existing frames.
ru: Операция перенумерации и добавления кадров завершается неудачей, если нумерация, назначенная кадрам, используется уже существующими кадрами.

source: If the Automatically Create Drawings option is activated in the Preferences → Drawing dialog, when you want to add a drawing at the end of the sequence simply select the first grey frame available, and draw in the Viewer.
ru: Если опция Автосоздание активирована в диалоговом окне Настройки программы → Рисунок, если вы хотите добавить рисунок в конце последовательности, просто выберите первый доступный серый кадр и нарисуйте его в окне просмотра.

source: **To renumber drawings of an animation level:**
ru: **Чтобы изменить нумерацию рисунков уровня анимации:**

source: Select the drawings you want to renumber; also a non-continuous selection is allowed.
ru: Выберите рисунки, которые вы хотите изменить нумерацию; также допускается непостоянный выбор.

source: Select Level → Renumber.
ru: Выберите Уровень → Пересчитать.

source: In the dialog that opens set the Start Frame number that will be assigned to the first drawing of the selection, and the Step used to number all following frames in the selection.
ru: В открывшемся диалоговом окне установите номер Начального Кадра, который будет назначен первому рисунку выбора, и Шаг, используемый для нумерации всех последующих кадров в выборе.

source: **To add drawings to an animation level:**
ru: **Чтобы добавить рисунки на уровень анимации:**

source: Select Level → Add Frames.
ru: Выберите Уровень → Добавить кадры.

source: In the dialog that opens sets the frame range you want to add, and the Step used to number the frames in the range.
ru: В открывшемся диалоговом окне задайте диапазон кадров, который вы хотите добавить, и Шаг, используемый для нумерации кадров в диапазоне.

source: The Add Frames and Renumber commands are also available in the menu that opens when right-clicking in the Level Strip.
ru: Команды Добавить кадры и Пересчитать также доступны в меню, которое открывается при щелчке правой кнопкой мыши на Level Strip.

source: Reverting Level Frames to a Previous Version
ru: Возврат кадров уровня к предыдущей версии

source: In case some mistakes are made during the editing of a level, or during the painting process, e.g. a drawing section is accidentally deleted, it is possible to retrieve the last saved version of the level frames.
ru: Если при редактировании уровня или в процессе рисования были допущены некоторые ошибки, например часть рисурка была случайно удалена, можно получить последнюю сохраненную версию кадров уровня.

source: For Toonz raster levels generated from a cleanup process, it is also possible to retrieve the original cleaned up drawings.
ru: Для растровых уровней Toonz, сгенерированных в процессе очистки, также можно получить исходные очищенные рисунки.

source: In order to revert to the original cleaned up drawings the Preferences → Drawing → Keep Original Cleaned Up Drawings As Backup option has to be activated when the cleanup is performed (see :ref:`Cleaning up Drawings <cleaning_up_drawings>` ).
ru: Чтобы вернуться к исходным очищенным рисункам, при выполнении очистки должен быть активирован параметр Настройки программы → Рисунок → Сохранять оригинальные очищенные рисунки в качестве резервной копии (см. :ref:`Очистка рисунков <cleaning_up_drawings>`).

source: **To revert the level drawings to the last saved version:**
ru: **Чтобы вернуть рисунки уровней в последнюю сохраненную версию:**

source: In the Level Strip select the drawings you want to revert.
ru: В Level Strip выберите рисунки, которые вы хотите вернуть.

source: Choose Level → Revert to Last Saved Version.
ru: Выберите Уровень → Возврат к последней сохраненной версии.

source: Right click the selection and choose Revert to Last Saved Version from the menu that opens.
ru: Щелкните правой кнопкой мыши выделенную область и выберите Возврат к последней сохраненной версии в открывшемся меню.

source: **To revert to the original cleaned up drawings:**
ru: **Чтобы вернуться к исходным очищеным рисункам:**

source: Choose Level → Revert to Cleaned Up.
ru: Выберите Уровень → Возврат к очистке.

source: Right click the selection and choose Revert to Cleaned Up from the menu that opens.
ru: Щелкните правой кнопкой мыши выделенную область и выберите Возврат к очистке в открывшемся меню.

source: Merging Animation Levels
ru: Объединение уровней анимации

source: Toonz vector levels and standard raster levels can be easily merged into a single animation level generated by flattening them according to their stacking order, using the → Merge Levels command. TLV levels can be merged, using the → Merge TLV Levels command.
ru: Векторные уровни Toonz и стандартные растровые уровни можно легко объединить в один уровень анимации, сгенерированный путем выравнивания их в соответствии с порядком их наложения с помощью команды Xsheet → Объединить уровни. Уровни TLV можно объединить с помощью команды Xsheet → Объединить уровни Tlv.

source: This can be useful for instance if you are sketching an animation with drawings repeated in several cells and exposed in several columns, and you want to generate a single sequence of drawings.
ru: Это может быть полезно, например, если вы рисуете анимацию с рисунками, которые повторяются в нескольких ячейках и отображаются в нескольких столбцах, и вы хотите создать одну последовательность рисунков.

source: In both cases there is no limit to the number of columns you can merge.
ru: В обоих случаях нет ограничений на количество столбцов, которые вы можете объединить.

source: Merging Toonz Vector Levels or Raster Levels
ru: Слияние векторных уровней Toonz или растровых уровней

source: Using the → Merge Levels command the number of resulting drawings will depend on the number of drawings exposed in the first column on the left of the selection. When merging raster levels, the resolution of the resulting drawings will depend on the resolution of the drawings exposed in the first column on the left of the selection.
ru: С помощью команды Xsheet → Объединить уровни количество получаемых рисунков будет зависеть от количества рисунков, отображаемых в первом столбце слева от выделения. При объединении растровых уровней разрешение получаемых рисунков будет зависеть от разрешения рисунков, отображаемых в первом столбце слева от выделения.

source: Animation levels are merged according to the following guidelines:
ru: Уровни анимации объединяются в соответствии со следующими рекомендациями:

source: The frame numbering order is followed; this means that all the drawings exposed at frame 1 will be merged to the drawing exposed at frame 1 of the first column of the selection.
ru: Соблюдайте порядок нумерации кадров; это означает, что все рисунки, показанные в кадре 1, будут объединены с рисунком, выставленным в кадре 1 первого столбца выбора.
