Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/interface_overview.po
Languages: fa, ru

source: Interface Overview
fa: بررسی اجمالی رابط
ru: Обзор интерфейса

source: OpenToonz interface is organized into rooms, also known as workspaces: each room is a different collection of windows which are laid out at specific positions on the screen.
ru: Интерфейс OpenToonz организован в комнаты, также известные как рабочие пространства: каждая комната представляет собой различную коллекцию окон, которые расположены в определенных местах на экране.

source: Using Rooms
fa: استفاده از Room ها
ru: Использование комнат

source: Available rooms are listed on the far right of the menu bar. Each of them always displays the content of the current scene.
ru: Доступные комнаты перечислены в дальнем правом углу строки меню. Каждая из них всегда отображает содержимое текущей сцены.

source: Rooms can be named and their order can be rearranged. New rooms can be added and existing rooms can be deleted. When a room is added it is empty; to configure it, panes can be added one by one (see below).
ru: Комнаты могут быть названы и их порядок может быть изменен. Новые комнаты могут быть добавлены, а существующие комнаты могут быть удалены. Когда комната добавлена, она пуста; для её настройки можно добавлять панели по одной (см. ниже).

source: **To enter a room:**
ru: **Чтобы войти в комнату:**

source: Click the related tab on the far right of the menu bar.
ru: Нажмите на соответствующую вкладку в правой части строки меню.

source: **To name a room:**
fa: **برای نام گذاری یک Room:**
ru: **Чтобы назвать комнату:**

source: Double-click the tab and type the name you want to assign to the room.
fa: Tab را دابل کلیک کنید و اسمی که می خواهید را برای اختصاص دادن به Room تایپ کنید.
ru: Дважды щелкните вкладку и введите имя, которое вы хотите присвоить комнате.

source: **To order room tabs:**
ru: **Чтобы заказать номерные вкладки:**

source: Click and drag the tab to the new position.
ru: Нажмите и перетащите вкладку на новую позицию.

source: **To add a new room:**
fa: **برای اضافه کردن یک Room جدید:**
ru: **Чтобы добавить новую комнату:**

source: Right-click in the room tab area and choose New Room from the menu that opens.
fa: در ناحیه Room Tab راست کلیک کنید و New Room را از منو ای که باز شده است انتخاب کنید.
ru: Щелкните правой кнопкой мыши в области вкладок комнаты и выберите «Новая комната» в открывшемся меню.

source: **To delete a room:**
fa: **برای حذف یک Room:**
ru: **Чтобы удалить комнату:**

source: Right-click the room tab and choose Delete Room "<Name>" from the menu that opens. The current room cannot be deleted.
fa: Room Tab را راست کلیک کنید و Delete Room “<Name>” را از منو ای که باز شده است انتخاب کنید. Room فعلی نمی تواند حذف بشود.
ru: Щелкните правой кнопкой мыши вкладку комнаты и выберите Удалить комнату "<Имя>" в открывшемся меню. Текущая комната не может быть удалена.

source: **To return to the set of rooms provided with Toonz:**
ru: ** Чтобы вернуться к набору номеров, предоставляемых Toonz: **

source: Choose Windows > Reset to Default Rooms.
ru: Выберите Окна > Сбросить вкладки по умолчанию.

source: Customizing Rooms
fa: سفارشی سازی Room ها
ru: Настройка комнат

source: Rooms can be modified by setting different sizes to different panes, and adding or removing panes. To prevent the accidental addition or removal of panes, rooms configuration can be locked.
ru: Комнаты можно изменить, установив разные размеры для разных панелей и добавив или удалив панели. Чтобы предотвратить случайное добавление или удаление панелей, конфигурация комнат может быть заблокирована.

source: Most of the panes can be maximized to fill the full interface, and can be added as floating windows by using the Windows menu.
ru: Большинство панелей можно развернуть, чтобы заполнить весь интерфейс, и их можно добавить в виде плавающих окон с помощью меню Окна.

source: **To resize a pane in the room:**
ru: **Чтобы изменить размер панели в комнате:**

source: Click any vertical or horizontal separator and drag it to the new position.
fa: هر Separator عمودی یا افقی را کلیک کنید و درگ کنید به موقعیت جدید.
ru: Щелкните любой вертикальный или горизонтальный разделитель и перетащите его в новое положение.

source: Some panes like the toolbar and the level strip have some fixed size, therefore they cannot be resized.
ru: Некоторые панели, такие как панель инструментов и полоса уровня, имеют фиксированный размер, поэтому их нельзя изменить.

source: **To open a pane as a floating window:**
ru: **Чтобы открыть панель как плавающее окно:**

source: Select in the Windows menu the pane you want to open.
ru: Выберите в меню Окна панель, которую вы хотите открыть.

source: **To resize a floating window:**
ru: **Чтобы изменить размер плавающего окна:**

source: Click and drag the border or corner of a window.
ru: Нажмите и перетащите границу или угол окна.

source: **To close a floating window or a dialog:**
ru: **Чтобы закрыть плавающее окно или диалог:**

source: Click the close button at the right of the title bar.
fa: دکمه بستن در سمت راست نوار عنوان را کلیک کنید.
ru: Нажмите кнопку закрытия справа от строки заголовка.

source: **To add a pane to a room:**
ru: **Чтобы добавить панель в комнату:**

source: Use the Windows menu to open the pane as a floating window.
ru: Используйте меню Окна, чтобы открыть панель как плавающее окно.

source: Click and drag its title bar to move it around and release to dock it according to the highlighted insertion point.
fa: برای حرکت دادن اش نوار عنوان اش را کلیک و درگ کنید و برای Dock کردنش با توجه به نقطه الحاق هایلایت شده رها کنید.
ru: Нажмите и перетащите строку заголовка, чтобы переместить ее и отпустите, чтобы закрепить ее в соответствии с выделенной точкой вставки.

source: Trying to dock a pane to the leftmost/rightmost part of the interface may fail if the main OpenToonz window is maximized at that moment. To overcome this, you can restore the main window size, dock the desired pane, and then maximize it back.
ru: Попытка пристыковать панель к крайней левой / правой части интерфейса может завершиться неудачей, если в этот момент главное окно OpenToonz развернуто. Чтобы преодолеть это, вы можете восстановить размер основного окна, закрепить нужную панель, а затем развернуть ее обратно.

source: **To remove a pane from a room:**
ru: **Чтобы удалить панель из комнаты:**

source: Click and drag the title bar of the pane you want to remove to undock it from the room.
ru: Нажмите и перетащите строку заголовка панели, которую хотите удалить, чтобы отсоединить ее от комнаты.

source: Close the floating window.
ru: Закройте плавающее окно.

source: **To maximize, or minimize a maximized pane:**
ru: **Чтобы развернуть или свернуть развернутую панель:**

source: Double-click its title bar.
ru: Дважды щелкните строку заголовка.

source: Some panes like the toolbar and the level strip have some fixed size, therefore they cannot be maximized.
ru: Некоторые панели, такие как панель инструментов и полоса уровня, имеют фиксированный размер, поэтому их нельзя развернуть.

source: **To lock/unlock the rooms configuration:**
ru: **Для блокировки/разблокировки конфигурации комнат:**

source: Activate/deactivate the Windows > Lock Room Panes option.
ru: Активируйте/деактивируйте опцию Окна > Заблокировать Room Panes.

source: Room Panes
ru: Панели комнаты

source: Below there is a list of the panes (in the same order in which they appear in the Windows menu) that can be used to build rooms and that can be opened as floating windows.
ru: Ниже приведен список панелей (в том же порядке, в котором они появляются в меню Окна), которые можно использовать для создания комнат и которые можно открывать как плавающие окна.

source: Batch Servers
ru: Пакетные серверы

source: The Batch Servers window allows you to process the batch list by using the render farm, and contains information about the list of server (rendering) nodes defined for the farm.
ru: Окно «Пакетные серверы» позволяет обрабатывать пакетный список с помощью рендер-фермы и содержит информацию о списке узлов сервера (рендеринга), определенных для фермы.

source: See :ref:`Monitoring the Server Nodes <monitoring_the_server_nodes>` .
fa: ببینید :ref:`Monitoring the Server Nodes <monitoring_the_server_nodes>` .
ru: См. :ref:`Мониторинг серверных узлов <monitoring_the_server_nodes>`.

source: Cleanup Settings
ru: Настройки очистки

source: The Cleanup Settings pane allows you to define the parameters for the clean-up process of scanned raster images, in order to convert them into Toonz Raster images, ready to be painted in OpenToonz.
ru: Панель «Настройки очистки» позволяет вам определить параметры процесса очистки отсканированных растровых изображений, чтобы преобразовать их в растровые изображения Toonz, готовые для рисования в OpenToonz.

source: See :ref:`Cleaning-up Scanned Drawings <cleaning-up_scanned_drawings>` .
fa: ببینید :ref:`Cleaning-up Scanned Drawings <cleaning-up_scanned_drawings>` .
ru: См. :ref:`Очистка отсканированных чертежей <cleaning-up_scanned_drawings>`.

source: Color Model
ru: Цветовая модель

source: The color model viewer displays the image, or animation level, you loaded as reference to paint the current animation level.
fa: Color Model Viewer تصویر، یا Animation Level ای که شما لود کردید را به عنوان رفرنس برای رنگ آمیزی Animation Level فعلی نمایش می دهد.
ru: Средство просмотра цветовой модели отображает изображение или уровень анимации, которые вы загрузили в качестве эталона для рисования текущего уровня анимации.

source: See :ref:`Using a Color Model <using_a_color_model>` .
fa: ببینید :ref:`Using a Color Model <using_a_color_model>` .
ru: См. :ref:`Использование цветовой модели <using_a_color_model>`.

source: File Browser
ru: Браузер файлов

source: The file browser allows you to load and save files, and to access projects.
fa: File Browser به شما برای لود و ذخیره فایل ها، و برای دسترسی به پروژه ها اجازه می دهد.
ru: Браузер файлов позволяет загружать и сохранять файлы и получать доступ к проектам.

source: On the left there is a file tree with some main folders containing material stored on your computer: My Computer, Network, My Documents, History, Library and Projects. You can open folders and sub-folders in order to retrieve files that are displayed in the area on the right.
fa: سمت چپ یک File Tree با یکسری پوشه های اصلی حاوی مواد ذخیره شده روی کامپیوتر شماست: My Computer, Network, My Documents, History, Library و Projects. شما می توانید پوشه ها و زیر پوشه ها را به منظور بازیابی فایل هایی که در ناحیه سمت راست نمایش داده می شوند باز کنید.
ru: Слева находится дерево файлов с некоторыми основными папками, содержащими материалы, хранящиеся на вашем компьютере: My Computer, Network, My Documents, History, Library and Projects. Вы можете открывать папки и подпапки для получения файлов, которые отображаются в области справа.

source: See :ref:`Managing Projects <managing_projects>` and :ref:`Using the File Browser <using_the_file_browser>` .
fa: ببینید :ref:`Managing Projects <managing_projects>` و :ref:`Using the File Browser <using_the_file_browser>` .
ru: См. :ref:`Управление проектами <managing_projects>` и :ref:`Использование браузера файлов <using_the_file_browser>`.

source: The flipbook can display animation levels, clips or sequences of images. It can be used to check levels for instance before loading them, or to control a rendered sequence.
fa: FlipBook می تواند Animation Level ها، کلیپ ها یا توالی های تصاویر را نمایش بدهد. اون می تواند استفاده بشود برای بررسی Level ها برای نمونه قبل لود شان، یا برای کنترل یک سکانس رندر شده.
ru: Flipbook может отображать уровни анимации, клипы или последовательности изображений. Его можно использовать для проверки уровней, например, перед их загрузкой, или для управления визуализированной последовательностью.

source: See :ref:`Using the Flipbook <using_the_flipbook>` .
fa: ببینید :ref:`Using the Flipbook <using_the_flipbook>` .
ru: См. :ref:`Использование Flipbook <using_the_flipbook>`.

source: Function Editor
ru: Редактор функций

source: The function editor maps objects and FX transformations with key values and related interpolations by using a spreadsheet or a graph editor. It is divided into two sections: on the left there is an area where the spreadsheet or graph editor is displayed, on the right top is an area where the interpolation of the current transformation segment is displayed, and on the right bottom is the objects/FX tree.
fa: ویرایشگر عملکرد Transformation های اشیاء و افکت ها را با Key Value ها، و Interpolation های مربوطه را با استفاده از یک SpreadSheet یا یک Graph Editor ترسیم می کند. اون به دو بخش تقسیم شده است: در سمت چپ ناحیه ای است که SpreadSheet یا Graph Editor نمایش داده می شود، در بالا سمت راست ناحیه ای است که Interpolation ئه Transformation Segment فعلی نمایش داده می شود، و در پایین سمت راست Objects/FX Tree می باشد.
ru: Редактор функций сопоставляет объекты и преобразования FX со значениями ключа и соответствующими интерполяциями с использованием электронной таблицы или графического редактора. Он разделен на два раздела: слева есть область, где отображается электронная таблица или редактор графиков, справа вверху - область, где отображается интерполяция текущего сегмента преобразования, а справа внизу - объекты / FX дерево.

source: See :ref:`Using the Function Editor <using_the_function_editor>` .
fa: ببینید :ref:`Using the Function Editor <using_the_function_editor>` .
ru: См. :ref:`Использование редактора функций <using_the_function_editor>`.

source: The level strip displays the sequence of drawings belonging to the level currently selected in the Xsheet.
fa: Level Strip توالی نقاشی های متعلق به Level ای که در حال حاضر در Xsheet انتخاب شده است را نمایش می دهد.
ru: Level strip отображает последовательность рисунков, принадлежащих уровню, выбранному в настоящий момент в таблице Xsheet.

source: It helps you to edit the sequence of drawings and to see all the drawings of the current level, even if those drawings are not exposed in a Xsheet.
fa: اون به شما کمک می کند تا توالی نقاشی ها را ویرایش کنید و تا تمام نقاشی های Level فعلی را، حتی اگر آن نقاشی ها در یک Xsheet نمایان نشدند ببینید.
ru: Это помогает вам редактировать последовательность рисунков и видеть все рисунки текущего уровня, даже если эти рисунки не отображаются в Xsheet.

source: See :ref:`Editing Animation Levels <editing_animation_levels>` .
fa: ببینید :ref:`Editing Animation Levels <editing_animation_levels>` .
ru: См. :ref:`Редактирование уровней анимации <editing_animation_levels>`.

source: Palette
ru: Палитра

source: It displays the styles defined for the current level, or in case it is inactive the styles defined for a previously selected level.
fa: اون Style های تعریف شده برای Level فعلی را نمایش می دهد، یا در موردی که آن غیر فعال است Style های تعریف شده برای یک Level انتخاب شده قبلی (فقط Raster).
ru: Она отображает стили, определенные для текущего уровня, или, если он неактивен, стили, определенные для ранее выбранного уровня.

source: See :ref:`The Palette Window <the_palette_window>` .
ru: См. :ref:`Окно Палитры <the_palette_window>`.

source: Scene Cast
ru: Состав сцены

source: The scene cast pane lets you control the files loaded in the scene, save them and load new ones. It can be organized in folders and sub-folders.
ru: Состав сцены позволяет вам управлять файлами, загруженными в сцену, сохранять их и загружать новые. Это может быть организовано в папках и подпапках.

source: See :ref:`Using the Scene Cast <using_the_scene_cast>` .
fa: ببینید :ref:`Using the Scene Cast <using_the_scene_cast>` .
ru: См. :ref:`Использование Состава сцены <using_the_scene_cast>`.

source: Schematic
ru: Схема

source: The schematic can alternatively display stage information or special FX usage.
fa: Schematic می تواند متناوبا اطلاعات Stage یا استفاده ی جلوه های ویژه را نمایش بدهد.
ru: Схема может альтернативно отображать информацию о стадии или специальном использовании FX.

source: The stage schematic displays as nodes all the objects defined in a scene, i.e. columns, pegbars, cameras, the table and motion paths, and allows you to manage the way they are linked to each other.
fa: Stage Schematic تمام اشیاء تعریف شده در یک صحنه را به عنوان Node ها نمایش می دهد، یعنی Column ها، PegBar ها، دوربین ها، Table و Motion Path ها، و به شما اجازه می دهد تا راهی که آنها به یکدیگر لینک شدن را مدیریت کنید.
ru: Схема сцены отображает в виде узлов все объекты, определенные в сцене, то есть столбцы, вешалки, камеры, таблицы и траектории движения, и позволяет вам управлять способом, которым они связаны друг с другом.

source: The FX schematic allows you to apply FX to the content of Xsheet columns, and to manage the way they are applied. All the columns and FX are displayed as nodes that can be connected in order to set the way FX affect the scene content.
fa: FX Schematic به شما اجازه می دهد تا افکت ها را به محتوای Xsheet Column ها اعمال کنید و راهی که آنها اعمال شدند را مدیریت کنید. تمام Column ها و افکت ها به عنوان Node هایی نمایش داده می شوند که می توانند به منظور تنظیم راهی که افکت ها روی محتوای صحنه اثر می گذارند متصل بشوند.
ru: Схема FX позволяет применять FX к содержимому столбцов Xsheet и управлять их применением. Все столбцы и FX отображаются как узлы, которые можно подключить, чтобы установить, как FX влияет на содержимое сцены.

source: See :ref:`Using the Stage Schematic <using_the_stage_schematic>` and :ref:`Using the FX Schematic <using_the_fx_schematic>` .
fa: ببینید :ref:`Using the Stage Schematic <using_the_stage_schematic>` و :ref:`Using the FX Schematic <using_the_fx_schematic>` .
ru: См. :ref:`Использование схемы <using_the_stage_schematic>` и :ref:`Использование схемы FX <using_the_fx_schematic>`.

source: Studio Palette
ru: Палитра Studio

source: The studio palette allows you to store an unlimited number of level palettes. From here any palette can be retrieved and assigned to the current level in order to paint it, with no need to define the same styles again and again. It also includes a viewer displaying the styles of the currently selected palette.
fa: Studio Palette به شما اجازه می دهد تا تعداد نامحدودی از Level Palette ها را ذخیره کنید. از اینجا هر Palette می تواند بازیابی و اختصاص داده بشود به Level فعلی به منظور رنگ آمیزی آن، بدون هیچ نیازی به تعریف Style های یکسان از دوباره و دوباره. اون همچنین شامل یک Viewer است که Style های Palette انتخاب شده فعلی را نمایش می دهد.
ru: Палитра Studio позволяет хранить неограниченное количество палитр уровней. Отсюда любая палитра может быть извлечена и назначена текущему уровню для его рисования, без необходимости определять одни и те же стили снова и снова. Он также включает в себя средство просмотра, отображающее стили текущей выбранной палитры.

source: See :ref:`Using the Studio Palette <using_the_studio_palette>` .
fa: ببینید :ref:`Using the Studio Palette <using_the_studio_palette>` .
ru: См. :ref:`Использование Палитры Studio <using_the_studio_palette>` .

source: Style Editor
ru: Редактор стилей

source: The style editor allows you to modify the palette styles. You can choose the type of style among color, texture, vector and raster. There also is a settings tab where you can decide some parameters for the style.
fa: Style Editor به شما اجازه می دهد تا Style های Palette را اصلاح کنید. شما می توانید نوع Style را بین Color, Texture, Vector و Raster انتخاب کنید. همچنین یک تب Settings وجود دارد که شما می توانید یکسری پارامتر ها را برای Style تصمیم بگیرید.
ru: Редактор стилей позволяет изменять стили палитры. Вы можете выбрать тип стиля: цвет, текстура, вектор и растр. Также есть вкладка настроек, где вы можете выбрать некоторые параметры для стиля.

source: See :ref:`Editing Styles <editing_styles>` .
fa: ببینید :ref:`Editing Styles <editing_styles>` .
ru: См. :ref:`Редактирование стилей <editing_styles>`.

source: Tasks
ru: Задания

source: The Tasks window contains the task tree with all the tasks submitted to the batch processing, and information about the task currently selected in the tree. From the task tree you can start or stop a task execution, or remove it.
ru: Окно Задания содержит дерево задач со всеми задачами, отправленными на пакетную обработку, и сведения о задаче, выбранной в данный момент в дереве. Из дерева задач вы можете запустить или остановить выполнение задачи или удалить ее.

source: See :ref:`Managing and Executing Render Tasks <managing_and_executing_render_tasks>` .
fa: ببینید :ref:`Managing and Executing Render Tasks <managing_and_executing_render_tasks>` .
ru: См. :ref:`Управление и выполнение задач рендеринга <managing_and_executing_render_tasks>`.

source: Message Center
ru: Центр сообщений

source: The message center displays in a list the messages OpenToonz is sending to the user. You can set filters on the messages showed in the window using the appropriate radio buttons, or you can clear completely the list pressing the Clear button.
ru: Центр сообщений отображает в списке сообщения, которые OpenToonz отправляет пользователю. Вы можете установить фильтры для сообщений, отображаемых в окне, используя соответствующие переключатели, или вы можете полностью очистить список, нажав кнопку Очистить.

source: Toolbar
ru: Панель инструментов

source: The toolbar contains tools to draw, select and edit drawings, and to animate objects like the camera, columns and pegbars. The tools in the toolbar can only be used in the main viewer.
fa: ToolBar حاوی ابزار هایی برای نقاشی، انتخاب و ویرایش نقاشی ها، و برای انیمیت آبجکت هایی مثل دوربین، Column ها و PegBar ها می باشد. ابزار های در ToolBar فقط می توانند در Viewer اصلی استفاده بشوند.
ru: Панель инструментов содержит инструменты для рисования, выбора и редактирования рисунков, а также для анимации таких объектов, как камера, столбцы и вешалки. Инструменты на панели инструментов могут использоваться только в главном окне просмотра.

source: If the toolbar is too short to display all the tools, it can be scrolled by using arrow buttons available at its ends.
fa: اگر ToolBar برای نمایش تمام ابزار ها خیلی کوتاه است، اون می تواند با استفاده از Arrow Button های در دسترس در انتهای اون اسکرول بشود. (درباره اوپن تونز - برای تاهوما یادداشت کامند تولبار صدق می کند)
ru: сли панель инструментов слишком короткая для отображения всех инструментов, ее можно прокручивать с помощью кнопок со стрелками, имеющихся на ее концах.

source: |animate| **Animate** modifies the position, rotation and size of the current objects (see :ref:`Animating Objects <animating_objects>` ).
fa: |animate| **Animate** موقعیت، چرخش، و اندازه آبجکت های فعلی را اصلاح می کند (ببینید :ref:`Animating Objects <animating_objects>` ).
ru: |animate| **Инструмент анимирования** изменяет положение, вращение и размер текущих объектов (см. :ref:`Анимирование объектов <animating_objects>`).

source: |selection| **Selection** performs a selection and transforms it (see :ref:`Using the Selection Tool <using_the_selection_tool>` ).
fa: |selection| **Selection** یک Selection اجرا می کند و Transform اش می کند (روی وکتور ها خودش کامل آبجکت را انتخاب می کند - تغییر ضخامت هم می دهد) (ببینید :ref:`Using the Selection Tool <using_the_selection_tool>` ).
ru: |selection| **Инструмент выделения** выполняет выделение и преобразует его (см. :ref:`Использование инструмента выделения <using_the_selection_tool>`).

source: |brush| **Brush** draws in the work area in freehand mode (see :ref:`Drawing with the Brush Tool <drawing_with_the_brush_tool>` ).
fa: |brush| **Brush** در ناحیه کار در حالت FreeHand نقاشی می کند (ببینید :ref:`Drawing with the Brush Tool <drawing_with_the_brush_tool>` ).
ru: |brush| **Кисть** рисует в рабочей области в режиме рукописного ввода (см. :ref:`Рисование с помощью инструмента Кисть <drawing_with_the_brush_tool>`).
