Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/interface_overview.po
Languages: fa, ru

source: The interface themes are defined by means of a QSS file, whose concepts, terminology, and syntax are inspired by CSS files (HTML Cascading Style Sheets). The QSS files also refers to a set of PNG images that are used to create interface widgets.
fa: تم های رابط به وسیله یک فایل QSS تعریف می شوند، که کانسپت ها، ترمینولوژی، و سینتکس از فایل های سی اس اس (HTML Cascading Style Sheets) الهام گرفته شده اند. فایل های QSS همچنین به یک مجموعه از تصاویر PNG که برای ایجاد Widget های رابط استفاده شده اند اشاره دارند.
ru: Темы интерфейса определяются с помощью файла QSS, концепции, терминология и синтаксис которого основаны на файлах CSS (HTML Cascading Style Sheets). Файлы QSS также относятся к набору изображений PNG, которые используются для создания виджетов интерфейса.

source: These files are stored in a folder named as the QSS file, and located in the ``C:\OpenToonz stuff\config\qss`` folder on Windows and ``OpenToonz stuff\config\qss`` folder on Macintosh.
ru: Эти файлы хранятся в папке, называемой файлом QSS, и находятся в папке ``C:\OpenToonz stuff\config\qss`` для Windows и ``OpenToonz stuff\config\qss`` для macOS.

source: The QSS file for Macintosh is named with the _mac suffix.
fa: فایل QSS برای مکینتاش با پسوند _mac نام گذاری شده است.
ru: Файл QSS для Macintosh назван с суффиксом _mac.

source: The QSS file can be edited with any text editor software, e.g. Notepad or TextEdit; the PNG images with any image editor software. Editing the QSS file requires some skill in CSS language, but some changes like colors of pane elements, can be easily done by expressing them with red, green and blue values.
ru: Файл QSS можно редактировать с помощью любого программного обеспечения для текстового редактора, например, Блокнот или TextEdit; PNG изображения с любым программным обеспечением для редактирования изображений. Редактирование файла QSS требует определенных навыков в языке CSS, но некоторые изменения, такие как цвета элементов панели, можно легко сделать, выразив их в красных, зеленых и синих значениях.

source: The QSS files defining the colors and the images used in the OpenToonz interface have to be written according to a specific syntax, otherwise OpenToonz interface will not be displayed properly. If you decide to edit a QSS file, make a backup copy first in case you need to revert the file to the original version.
ru: Файлы QSS, определяющие цвета и изображения, используемые в интерфейсе OpenToonz, должны быть записаны в соответствии с определенным синтаксисом, иначе интерфейс OpenToonz не будет отображаться должным образом. Если вы решите отредактировать файл QSS, сначала сделайте резервную копию на тот случай, если вам потребуется вернуть файл к исходной версии.

source: **To choose the interface language:**
fa: **برای انتخاب زبان رابط:**
ru: **Чтобы выбрать язык интерфейса:**

source: Choose File > Preferences > Interface.
ru: Выберите File > Preferences > Interface.

source: In the Language* option menu choose the language you want to use in the interface.
fa: در منوی گزینه Language* زبانی که می خواهید در رابط استفاده کنید را انتخاب کنید.
ru: В меню опций Language* выберите язык, который вы хотите использовать в интерфейсе.

source: Restart OpenToonz to have the interface in the selected language.
ru: Перезапустите OpenToonz, чтобы открыть интерфейс на выбранном языке.

source: **To choose the interface theme:**
fa: **برای انتخاب Theme رابط:**
ru: **Для выбора темы интерфейса:**

source: In the Theme option menu choose the style to be applied to the interface.
fa: در منوی گزینه Theme استایل را انتخاب کنید تا به رابط اعمال بشود.
ru: В меню параметров темы выберите стиль, который будет применяться к интерфейсу.

source: **To create a new theme:**
fa: **برای ایجاد یک Theme جدید:**
ru: **Для создания новой темы:**

source: Navigate to ``C:\OpenToonz stuff\config\qss`` folder on Windows and ``OpenToonz stuff\config\qss`` folder on Macintosh.
ru: Перейдите в папку ``C:\OpenToonz stuff\config\qss`` для Windows или ``OpenToonz stuff\config\qss`` для macOS.

source: Duplicate one of the already existing style folder.
fa: یکی از پوشه های استایل در حال حاضر موجود را Duplicate کنید.
ru: Дублируйте одну из уже существующих папок стилей.

source: Rename the folder and the QSS files inside it with the name you want to assign to the style.
fa: پوشه و فایل های QSS داخل آن را با اسمی که می خواهید به استایل اختصاص بدهید ReName کنید.
ru: Переименуйте папку и файлы QSS внутри нее, указав имя, которое вы хотите присвоить теме.

source: Edit the QSS file and the PNG images contained in the new folder.
fa: فایل QSS و تصاویر PNG موجود در پوشه جدید را ویرایش کنید.
ru: Отредактируйте файл QSS и изображения PNG, содержащиеся в новой папке.

source: The new style will be available in the Preferences dialog the next time you run OpenToonz.
ru: Новый стиль будет доступен в диалоге настроек при следующем запуске OpenToonz.

source: **To edit style QSS file:**
fa: **برای ویرایش فایل QSS استایل:**
ru: **Для редактирования файла стиля QSS:**

source: Open and edit with a text editor software (e.g. Notepad or TextEdit) the QSS files available in the style folder.
fa: فایل های QSS در دسترس در پوشه استایل را با یک نرم افزار Text Editor (برای مثال NotePad یا TextEdit) باز و ویرایش کنید.
ru: Откройте и отредактируйте с помощью программного обеспечения текстового редактора (например, «Блокнот» или «TextEdit») файлы QSS, доступные в папке стилей.

source: **To edit style images:**
fa: **برای ویرایش تصاویر Style:**
ru: **Чтобы редактировать изображения в стиле:**

source: Open and edit with an image editor software the PNG files available in the style folder.
fa: فایل های PNG در دسترس در پوشه استایل را با نرم افزار Image Editor ای باز و ویرایش کنید.
ru: Откройте и отредактируйте с помощью программного обеспечения для редактирования изображений файлы PNG, доступные в папке стилей.

source: The Tahoma2D interface is organized into rooms, also known as workspaces. Each room is a different collection of panels which are laid out at specific positions on the screen for a specifc use.
fa: رابط Tahoma2D در Room ها سازمان دهی شده است؛ همچنین شناخته شده به عنوان Workspace ها. هر Room یک مجموعه متفاوت از Panel ها است که در موقعیت های مشخص روی صفحه برای یک استفاده مشخص چیده شده اند.

source: Room Editing Mode
fa: حالت ویرایش Room

source: |UI_lock| "Room Editing Mode" allows for rooms to be added, removed, and renamed. It also allows for panels to be added, removed, or rearranged. To enter or exit "Room Editing Mode", click on the lock icon on the top right of the workspace.
fa: |UI_lock| «حالت ویرایش Room» برای Room ها اجازه می دهد تا اضافه بشوند، حذف بشوند و تغییر نام بشوند. آن همچنین برای Panelها اجازه می دهد تا اضافه بشوند، حذف بشوند یا باز چینش بشوند. برای ورود یا خروج از «حالت ویرایش Room»، روی آیکون قفل در بالا سمت راست Workspace کلیک کنید.

source: **How to identify "Room Editing Mode":**
fa: **نحوه شناسایی «حالت ویرایش Room»:**

source: When "Room Editing Mode" is unlocked, all of the panels have a visible header.
fa: موقعی که «حالت ویرایش Room» باز است، تمام Panel ها یک سربرگ قابل رویت دارند.

source: Available rooms are listed on the far right of the menu bar. Each room always displays the contents of the current scene.
fa: Room های در دسترس در منتهی علیه سمت راست منو بار لیست شدن. هر Room همیشه محتویات صحنه فعلی را نمایش می دهد.

source: Rooms can be named and their order can be rearranged. New rooms can be added and existing rooms can be deleted. When a room is added it is empty; to configure it, panels can be added one by one (see below).
fa: Room ها می توانند نام گذاری بشوند و ترتیب بندی شان می تواند باز چینش بشود. Room های جدید می توانند اضافه بشوند و Room های موجود می توانند حذف بشوند. موقعی که یک Room اضافه می شود آن خالی است؛ برای پیکربندی آن، Panel ها می توانند یکی یکی اضافه بشوند (پایین را ببینید).

source: To enter a room, click on the related tab on the far right of the menu bar. If "Room Editing Mode" is active, room tabs can be reordered by clicking & dragging the tabs to a new position.
fa: برای ورود به یک Room، روی تب مربوطه در منتهی علیه سمت راست منو بار کلیک کنید. اگر «حالت ویرایش Room» فعال باشد، Room Tab ها می توانند با کلیک و درگ Tab ها به یک موقعیت جدید ترتیب بندی مجدد بشوند.

source: **To return to the set of rooms provided with Tahoma2D:**
fa: **برای بازگشت به مجموعه ی Room های ارائه شده با Tahoma2D:**

source: Choose Panels → Reset to Default Rooms.
fa: انتخاب کنید Panels → Reset to Default Rooms.

source: Rooms can be modified by setting different sizes to different panels. When "Room Editing Mode" is active, docked panels can be pulled out to become floating panels and floating panels can be docked.
fa: Room ها می توانند با تنظیم اندازه های متفاوت برای Panel های متفاوت اصلاح بشوند. هنگامی که «حالت ویرایش Room» فعال است، Panel های Dock شده می توانند برای تبدیل شدن به Panel های شناور بیرون کشیده بشوند و Panel های شناور می توانند Dock بشوند.

source: While "Room Edting Mode" is locked, panels can be resized and new floating panels can be added by using the Panels menu.
fa: هنگامی که «حالت ویرایش Room» قفل است، Panel ها می توانند تغییر اندازه بشوند و Panel های شناور جدید می توانند با استفاده از منوی Panels اضافه بشوند.

source: **To resize a panel in the room:**
fa: **برای تغییر اندازه یک پنل در Room:**

source: Some panels like the toolbar have a fixed width or height, therefore they cannot always be resized.
fa: یکسری Panel ها مثل Toolbar یک عرض یا طول ثابت دارند، به همین دلیل آنها نمی توانند همواره تغییر اندازه بشوند.

source: **To open a panel as a floating panel:**
fa: **برای باز کردن یک Panel به عنوان یک Panel شناور:**

source: Select in the Panels menu the panel you want to open.
fa: در منوی Panels پنل ای که می خواهید باز کنید را انتخاب کنید.

source: **To resize a floating panel:**
fa: **برای تغییر اندازه یک Panel شناور:**

source: Click and drag the border or corner of a panel.
fa: حاشیه یا گوشه ی یک Panel را کلیک و درگ کنید.

source: **To close a floating panel or a dialog:**
fa: **برای بستن یک پنل شناور یا یک Dialog:**

source: **To add a panel to a room:**
fa: **برای اضافه کردن یک پنل به یک Room:**

source: Use the Panels menu to open the panel as a floating panel.
fa: برای باز کردن Panel به عنوان یک Panel شناور از منوی Panels استفاده کنید.

source: Trying to dock a panel to the leftmost/rightmost part of the interface may fail if the main Tahoma2D window is maximized at that moment. To overcome this, you can restore the main window size, dock the desired panel, and then maximize it back.
fa: تلاش برای Dock کردن یک Panel به چپ ترین/راست ترین بخش رابط ممکن است که شکست بخورد اگر پنجره اصلی Tahoma2D در آن لحظه Maximize شده باشد. برای غلبه بر این، شما می توانید اندازه پنجره اصلی را بازیابی کنید، Panel دلخواه را Dock کنین، و سپس دوباره Maximize اش کنید.

source: **To remove a panel from a room:**
fa: **برای حذف یک پنل از یک Room:**

source: Click and drag the title bar of the panel you want to remove to undock it from the room.
fa: پنل ای که می خواهید حذف کنید را برای Undock کردن اش از Room کلیک و درگ کنید.

source: Close the floating panel.
fa: Panel شناور را ببندید.

source: **To maximize, or minimize a panel:**
fa: **برای Maximize، یا Minimize یک Panel:**

source: Double-click its title bar (for floating panels, the Viewer and the ComboViewer). If there is no title bar, press **`**.
fa: نوار عنوان اش را دابل کلیک کنید (برای Panel های شناور، Viewer و ComboViewer). اگر نوار عنوان ای وجود ندارد، **`** را فشار بدهید.

source: Some panels like the toolbar and the command bar have a fixed size in one dimension, therefore they cannot be maximized.
fa: یکسری Panel ها مثل Toolbar و Command Toolbar یک اندازه ثابت در یک ابعاد دارند، به همین دلیل آنها نمی توانند Maximize بشوند.

source: Room Panels
fa: Panel های Room

source: Below there is a list of the panels (in the same order in which they appear in the Panels menu) that can be used to build rooms and that can be opened as floating panels.
fa: در زیر یک لیست از Panel ها وجود دارد (در ترتیب یکسانی که آنها در منوی Panels ظاهر می شوند) که می توانند برای ساخت Room ها استفاده بشوند و که می توانند به عنوان Panel های شناور باز بشوند.

source: The Batch Servers panel allows you to process the batch list by using the render farm, and contains information about the list of server (rendering) nodes defined for the farm.
fa: پنل Batch Servers به شما اجازه می دهد تا Batch List را با استفاده از رندر فارم پردازش کنید، و حاوی اطلاعاتی درباره لیست Server (Rendering) Node های تعریف شده برای Farm است.

source: The Cleanup Settings panel allows you to define the parameters for the clean-up process of scanned raster images, in order to convert them into Smart Raster images, ready to be painted in Tahoma2D.
fa: پنل Cleanup Settings به شما اجازه می دهد تا پارامتر ها را برای پروسه Clean-Up تصاویر Raster اسکن شده تعریف کنید، به منظور تبدیل آنها به تصاویر Smart Raster، آماده برای رنگ آمیزی شدن در Tahoma2D.

source: See :ref:`The Palette Panel<the_palette_window>` .
fa: ببینید :ref:`The Palette Panel<the_palette_window>` .

source: The scene cast panel lets you control the files loaded in the scene, save them and load new ones. It can be organized in folders and sub-folders.
fa: پنل Scene Cast می گذارد شما فایل هایی که در صحنه لود شدند را کنترل کنید، ذخیره کنید شان و جدید ها را لود کنید. اون می تواند در پوشه ها و زیر پوشه ها سازمان دهی بشود.

source: The Tasks panel contains the task tree with all the tasks submitted to the batch processing, and information about the task currently selected in the tree. From the task tree you can start or stop a task execution, or remove it.
fa: پنل Tasks حاوی Task Tree با تمام Task های ارسال شده به Batch Processing، و اطلاعات درباره Task ئه در حال حاضر انتخاب شده در Tree می باشد. از Task Tree شما می توانید یک اجرای Task را شروع یا متوقف کنید، یا آن را حذف کنید.

source: The message center displays in a list the messages Tahoma2D is sending to the user. You can set filters on the messages showed in the panel using the appropriate radio buttons, or you can clear completely the list pressing the Clear button.
fa: Message Center پیغام هایی که Tahoma2D به کاربر ارسال می کند را در یک لیست نمایش می دهد. شما می توانید فیلتر ها را روی پیغام های نمایش داده شده در پنل با استفاده از Radio Button های مناسب تنظیم کنید، یا شما می توانید لیست را کاملا با فشار دادن دکمه Clear پاک کنید.

source: |geometric| **Geometry** draws geometric shapes (see :ref:`Drawing with the Geometric Tool <drawing_with_the_geometric_tool>` ).
fa: |geometric| **Geometry** اشکال هندسی می کشد (ببینید :ref:`Drawing with the Geometric Tool <drawing_with_the_geometric_tool>` ).

source: |paint_brush| **Smart Raster Paint** paints lines and areas in Smart Raster drawings in freehand mode. (see :ref:`Filling Areas <filling_areas>` ).
fa: |paint_brush| **Smart Raster Paint** خطوط و ناحیه ها را در نقاشی های Smart Raster در حالت FreeHand رنگ آمیزی می کند. (ببینید :ref:`Filling Areas <filling_areas>` ).

source: The Command Bar is a place where the user can display favorite Tahoma2D tools and commands to have them readily available.
fa: Command Bar جایی است که کاربر می تواند ابزار ها و دستورات موردعلاقه Tahoma2D را نمایش بدهد برای داشتن آنها به راحتی در دسترس.

source: The Command Bar panel can be docked in any part of the Tahoma2D UI.
fa: پنل Command Bar می تواند Dock بشود در هر بخشی از رابط کاربری Tahoma2D.

source: Choose Panels → Command Bar.
fa: انتخاب کنید Panels → Command Bar.

source: Choose Panels → Command Bar to open the Command Bar.
fa: انتخاب کنید Panels → Command Bar را برای باز کردن Command Bar.

source: Right click on it and select **Customize Command Bar** from the menu that opens. The Customize Command Bar panel will open.
fa: روی آن راست کلیک کنید و **Customize Command Bar** را از منو ای که باز می شود انتخاب کنید. پنل Customize Command Bar باز می شود.

source: To *add* a command: Search for a command in the **Commands** list (left) and drag it to the **Command Bar** list (right).
fa: برای *اضافه کردن* یک دستور: برای یک دستور در لیست **Commands** (چپ) جست و جو کنید و آن را به لیست **Command Bar** (راست) درگ کنید.

source: To *add* a separator: At the end of the **Commands** list (left), drag the **----Separator----** item to the **Command Bar** list (right).
fa: برای *اضافه کردن* یک جدا کننده: در انتهای لیست **Commands** (چپ)، آیتم **----Separator----** را به لیست **Command Bar** (راست) درگ کنید.

source: To *delete* a command: Locate the command in the **Command Bar** list (right), right click on it and select **Remove** from the menu that opens.
fa: برای *حذف کردن* یک دستور: دستور را در لیست **Command Bar** (راست) مکان یابی کنید، روی آن راست کلیک کنید و **Remove** را از منو ای که باز می شود انتخاب کنید.

source: The comboviewer integrates in a single panel a viewer, horizontal toolbar and a tool options bar. It's and alternative work area where you can draw images and see at the same time the result of your compositing. It is endless and you can scroll, zoom in, zoom out and rotate it the way you prefer.
fa: ComboViewer در یک Panel واحد یک Viewer، یک ToolBar افقی و یک Tool Options Bar را ادغام می کند. اون یک ناحیه کاری جایگزین است که شما می توانید تصاویر بکشید و همزمان نتیجه Composite کردن تان را ببینید. اون بی پایان است و شما می توانید طوری که ترجیح می دهید Scroll, Zoom In, Zoom Out و Rotate اش کنید.

source: The history panel, lets you check and undo/redo the history of the latest actions performed in the current Tahoma2D scene.
fa: پنل History، می گذارد تاریخچه ی آخرین اعمال اجرا شده در Tahoma2D scene فعلی را بررسی و Undo/Redo کنید.

source: The record audio panel, lets you record a live audio source, listen to it, and insert it into a new audio column of the Xsheet. The insertion point will be located at the right of the selected cell column, and starting at the selected cell frame.
fa: پنل Record Audio، می گذارد یک منبع صدای زنده را ضبط کنید، به آن گوش بدهید، و آن را به یک Audio Column جدید از Xsheet الحاق کنید. نقطه الحاق در سمت راست Column ئه Cell انتخاب شده واقع می شود، و در فریم Cell انتخاب شده شروع می شود.

source: Currently, this panel cannot be docked to form part of a room, like the other ones in the Panels menu. Instead it must be opened as a floating panel, when needed.
fa: در حال حاضر، این Panel برای شکل دادن بخشی از یک Room، مثل بقیه در منوی Panels نمی تواند Dock بشود. در عوض اون باید به عنوان یک Panel شناور، وقتی که نیاز است باز شود.

source: The appearance of the Tahoma2D interface can be customized to suit any production need by choosing a specific language and interface theme.
fa: ظاهر رابط Tahoma2D می تواند برای تناسب با هر نیاز تولید با انتخاب یک زبان مشخص و تم رابط سفارشی سازی بشود.

source: Tahoma2D allows users to choose a specific language for the software interface, including menus, commands, tooltips, and on-screen messages. Currently available languages are: English, German, Spanish, French, Italian, Czech, Russian, Chinese, Japanese and Korean.
fa: Tahoma2D به کاربران اجازه می دهد برای انتخاب یک زبان مشخص برای رابط نرم افزار، شامل منو ها، Command ها، Tooltip ها، و پیغام های On-Screen. در حال حاضر زبان های در دسترس به این شرح می باشند: انگلیسی، آلمانی، اسپانیایی، فرانسوی، ایتالیایی، چکی، روسی، چینی، ژاپنی و کره ای.

source: There are also several included themes to choose from: Dark, Darker, Light, Medium and Neutral.
fa: همچنین چندین تم گنجانده شده برای انتخاب از بین شان وجود دارد: Dark, Darker, Light, Medium و Neutral.

source: The Tahoma2D interface theme set to Dark and to Light.
fa: تم رابط Tahoma2D تنظیم شده روی Dark و روی Light.

source: These files are stored in a folder named as the QSS file, and located in the ``C:\Tahoma stuff\config\qss`` folder on Windows and ``Tahoma stuff\config\qss`` folder on Macintosh.
fa: این فایل ها در یک پوشه به اسم فایل QSS ذخیره می شوند، و واقع شده اند در پوشه ``C:\Tahoma stuff\config\qss`` روی ویندوز و پوشه ``Tahoma stuff\config\qss`` روی مکینتاش.

source: The QSS file can be edited with any text editor software, e.g. Notepad or TextEdit; the PNG images with any image editor software. Editing the QSS file requires some skill in CSS language, but some changes like colors of panel elements, can be easily done by expressing them with red, green and blue values.
fa: فایل QSS می تواند با هر نرم افزار Text Editor ای، برای مثال NotePad یا TextEdit ویرایش بشود؛ تصاویر PNG با هر نرم افزار Image Editor ای. ویرایش فایل QSS یکسری مهارت در زبان CSS لازم دارد، ولی یکسری تغییرات مثل رنگ های المان های Panel، می توانند به آسانی با بیان آنها با مقادیر قرمز، سبز و آبی انجام بشوند.

source: The QSS files defining the colors and the images used in the Tahoma2D interface have to be written according to a specific syntax, otherwise Tahoma2D interface will not be displayed properly. If you decide to edit a QSS file, make a backup copy first in case you need to revert the file to the original version.
fa: فایل های QSS ای که رنگ ها و تصاویر استفاده شده در رابط Tahoma2D را تعریف می کنند باید با توجه به یک سینتکس مشخص نوشته بشوند، در غیر این صورت رابط Tahoma2D به درستی نمایش داده نمی شود. اگر شما تصمیم گرفتید تا یک فایل QSS را ویرایش کنید، اول یک نسخه پشتیبان تهیه کنید برای موردی که نیاز دارید تا فایل را به نسخه اصلی برگردانید.

source: Choose File → Preferences → Interface.
fa: انتخاب کنید File → Preferences → Interface.

source: Restart Tahoma2D to have the interface in the selected language.
fa: Tahoma2D را برای داشتن رابط در زبان انتخاب شده راه اندازی مجدد کنید.

source: Navigate to ``C:\Tahoma stuff\config\qss`` folder on Windows and ``Tahoma stuff\config\qss`` folder on Macintosh.
fa: پیمایش کنید به پوشه ``C:\Tahoma stuff\config\qss`` روی ویندوز و پوشه ``Tahoma stuff\config\qss`` روی مکینتاش.

source: The new style will be available in the Preferences dialog the next time you run Tahoma2D.
fa: استایل جدید دفعه بعدی که شما Tahoma2D را اجرا کنید در Preferences Dialog در دسترس خواهد بود.
