Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/interface_overview.po
Languages: fa, ru

source: |geometric| **Geometric** draws geometric shapes (see :ref:`Drawing with the Geometric Tool <drawing_with_the_geometric_tool>` ).
ru: |geometric| **Геометрический инструмент** рисует геометрические фигуры (см. :ref:`Рисование с помощью геометрического инструмента <drawing_with_the_geometric_tool>`).

source: |type| **Type** adds text by setting the font and size (see :ref:`Adding Text <adding_text>` ).
fa: |type| **Type** با تنظیم فونت و اندازه متن اضافه می کند (ببینید :ref:`Adding Text <adding_text>` ).
ru: |type| **Инструмент шрифта** добавляет текст, устанавливая шрифт и размер (см. :ref:`Добавление текста <adding_text>`).

source: |fill| **Fill** fills drawing areas with the current style (see :ref:`Filling Areas <filling_areas>` ).
fa: |fill| **Fill** ناحیه های نقاشی را با Style فعلی پر می کند (ببینید :ref:`Filling Areas <filling_areas>` ).
ru: |fill| **Заливка** заполняет области рисования текущим стилем (см. :ref:`Покраска областей <filling_areas>`).

source: |paint_brush| **Paint Brush** paints lines and areas in Toonz raster drawings in freehand mode. (see :ref:`Filling Areas <filling_areas>` ).
ru: |paint_brush| **Инструмент покраски** рисует линии и области в растровых рисунках Toonz в режиме рукописного ввода. (см. :ref:`Покраска областей <filling_areas>`).

source: |eraser| **Eraser** deletes vectors in vector drawings, and painted areas and lines in raster drawings (see :ref:`Drawing Tools <drawing_tools>` ).
fa: |eraser| **Eraser** بردار ها را در نقاشی های Vector حذف می کند، و ناحیه های رنگ آمیزی شده و خطوط را در نقاشی های Raster (ببینید :ref:`Drawing Tools <drawing_tools>` ).
ru: |eraser| **Ластик** удаляет векторы на векторных рисунках, а также закрашенные области и линии на растровых рисунках (см. :ref:`Инструменты рисования <drawing_tools>`).

source: |tape| **Tape** joins two open ends of one or two vectors in vector drawings, or closes gaps in raster drawings (see :ref:`Joining and Splitting <joining_and_splitting>` ).
fa: |tape| **Tape** دو انتهای باز یک یا دو بردار را در نقاشی های Vector پیوند می دهد، یا شکاف ها را در نقاشی های Raster می بندد (فقط اسمارت رستر - روی اسمارت هم خوب کار نمی کند) (ببینید :ref:`Joining and Splitting <joining_and_splitting>` ).
ru: |tape| **Скотч** объединяет два открытых конца одного или двух векторов в векторных рисунках или закрывает пропуски в растровых рисунках (см. :ref:`Соединение и разделение <joining_and_splitting>`).

source: |style_picker| **Style Picker** picks a style from the current drawing, that becomes the current style in the palette and in the style editor.
fa: |style_picker| **Style Picker** یک Style از نقاشی فعلی را انتخاب می کند، که به Style فعلی در Palette و در Style Editor تبدیل می شود.
ru: |style_picker| **Пипетка** выбирает стиль из текущего чертежа, который становится текущим стилем в палитре и в редакторе стилей.

source: |RGB_picker| **RGB Picker** picks red, green and blue values from the viewer content, and applies them to the current style (see :ref:`Plain Colors <plain_colors>` ).
fa: |RGB_picker| **RGB Picker** مقادیر قرمز، سبز و آبی را از محتوای Viewer انتخاب می کند، و به Style فعلی اعمال شان می کند (ببینید :ref:`Plain Colors <plain_colors>` ).
ru: |RGB_picker| **Инструмент RGB пипетка** выбирает красные, зеленые и синие значения из содержимого средства просмотра и применяет их к текущему стилю (см. :ref:`Простые цвета <plain_colors>`).

source: |cpe| **Control Point Editor** modifies the vector shape by editing its control points (see :ref:`Editing Vector Control Points <editing_vector_control_points>` ).
fa: |cpe| **Control Point Editor** شکل Vector را با ویرایش Control Point هایش اصلاح می کند (ببینید :ref:`Editing Vector Control Points <editing_vector_control_points>` ).
ru: |cpe| **Редактор контрольных точек** изменяет векторную форму, редактируя ее контрольные точки (см. :ref:`Редактирование векторных контрольных точек <editing_vector_control_points>`).

source: |pinch| **Pinch** modifies the vector shape by clicking and dragging anywhere on the vector (see :ref:`Changing the Bend of Vectors <changing_the_bend_of_vectors>` ).
fa: |pinch| **Pinch** شکل Vector را با کلیک و درگ هر جایی روی بردار اصلاح می کند (ببینید :ref:`Changing the Bend of Vectors <changing_the_bend_of_vectors>` ).
ru: |pinch| **Щипок** изменяет векторную форму, щелкая и перетаскивая в любом месте вектора (см. :ref:`Изменение изгиба векторов <changing_the_bend_of_vectors>`).

source: |pump| **Pump** locally modifies the vector thickness by clicking on the section you want to affect and then dragging up or down (see :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
fa: |pump| **Pump** به طور محلی ضخامت بردار را با کلیک روی بخشی که می خواهید تاثیر بگیرد و بعد درگ به بالا یا پایین اصلاح می کند (ببینید :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
ru: |pump| **Насос** локально изменяет толщину вектора, нажимая на участок, на который вы хотите повлиять, а затем перетаскивая его вверх или вниз (см. :ref:`Использование других инструментов модификатора <using_other_modifier_tools>`).

source: |magnet| **Magnet** deforms several vectors at once by clicking the area you want to affect and dragging (see :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
fa: |magnet| **Magnet** چندین بردار را با کلیک روی ناحیه ای که می خواهید تاثیر بگیرد و درگ به یک باره Deform می کند (ببینید :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
ru: |magnet| **Магнит** деформирует несколько векторов одновременно, щелкая область, на которую вы хотите повлиять, и перетаскивая ее (см. :ref:`Использование других инструментов модификатора <using_other_modifier_tools>`).

source: |bender| **Bender** bends vectors in vector drawings (see :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
fa: |bender| **Bender** بردار ها را در نقاشی های Vector خم می کند (ببینید :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
ru: |bender| **Клещи** изгибает векторы в векторных рисунках (см. :ref:`Использование других инструментов модификатора <using_other_modifier_tools>`).

source: |iron| **Iron** removes creases from vectors by moving the cursor on the vector you want to flatten (see :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
fa: |iron| **Iron** چروک ها را از بردار ها با حرکت Cursor روی بردار ای که می خواهید صاف بشود حذف می کند (ببینید :ref:`Using Other Modifier Tools <using_other_modifier_tools>` ).
ru: |iron| **Утюг** удаляет складки из векторов, перемещая курсор на вектор, который вы хотите сгладить (см. :ref:`Использование других инструментов модификатора <using_other_modifier_tools>`).

source: |cutter| **Cutter** splits a vector in two sections when clicking on it (see :ref:`Joining and Splitting <joining_and_splitting>` ).
fa: |cutter| **Cutter** یک بردار را هنگام کلیک روی آن در دو بخش Split می کند (صرفا از نظر برداری) (ببینید :ref:`Joining and Splitting <joining_and_splitting>` ).
ru: |cutter| **Нож** разбивает вектор на две части при нажатии на него (см. :ref:`Соединение и разделение <joining_and_splitting>`).

source: |skeleton| **Skeleton** defines character models, and animates them as in cutout animation (see :ref:`Using the Skeleton Tool <using_the_skeleton_tool>` )
fa: |skeleton| **Skeleton** تعریف می کند Character Model ها را، و آنها را به مثال انیمیشن CutOut انیمیت می کند (ببینید :ref:`Using the Skeleton Tool <using_the_skeleton_tool>` )
ru: |skeleton| **Скелет** определяет модели персонажей и анимирует их, как в анимации вырезов (см. :ref:`Использование инструмента Скелет <using_the_skeleton_tool>`).

source: |hook| **Hook** defines reference points to be used in the stage schematic to move an object, or link one object to another (see :ref:`Using Hooks <using_hooks>` ).
fa: |hook| **Hook** نقاط Reference را برای استفاده شدن در Stage Schematic برای حرکت آبجکتی، یا لینک کردن یک آبجکت به یکی دیگر تعریف می کند (ببینید :ref:`Using Hooks <using_hooks>` ).
ru: |hook| **Крюк** определяет контрольные точки, которые будут использоваться в схеме этапа для перемещения объекта или связывания одного объекта с другим (см. :ref:`Использование крюков <using_hooks>`).

source: |tracker| **Tracker** tracks specific regions in a sequence of images (see :ref:`Tracking Points <tracking_points>` ).
fa: |tracker| **Tracker** مناطق بخصوص را در یک توالی از تصاویر Track می کند (ببینید :ref:`Tracking Points <tracking_points>` ).
ru: |tracker| **Трекер** отслеживает определенные области в последовательности изображений (см. :ref:`Трекинг-точки <tracking_points>`).

source: |plastic| **Plastic** builds a mesh that allows to deform and animate a character or part of it (see :ref:`Using Plastic tool <using_plastic_tool>` ).
fa: |plastic| **Plastic** یک Mesh می سازد که برای DeForm و انیمیت یک کاراکتر یا بخشی از آن اجازه می دهد (ببینید :ref:`Using Plastic tool <using_plastic_tool>` ).
ru: |plastic| **Plastic tool** создает сетку, которая позволяет деформировать и анимировать персонажа или его часть (см. :ref:`Использование Plastic tool <using_plastic_tool>`).

source: |zoom| **Zoom** zooms in and out the viewer content; after you click you can drag up to zoom in the work area, or drag down to zoom out.
fa: |zoom| **Zoom** محتوای Viewer را Zoom In و Out می کند؛ بعد از کلیک می توانید برای Zoom In کردن ناحیه کاری به بالا درگ کنید، یا برای Zoom Out به پایین درگ کنید.
ru: |zoom| **Лупа** увеличивает и уменьшает содержание зрителя; после щелчка можно перетащить вверх, чтобы увеличить рабочую область, или перетащить, чтобы уменьшить масштаб.

source: |hand| **Hand** pans over the viewer content; if the 3D view is activated, the Hand tool lets you pan over the 3D view as well.
fa: |hand| **Hand** بر روی محتوای Viewer جا به جا می کند؛ اگر 3D View فعال باشد، Hand Tool می گذارد بر روی نمای سه بعدی جا به جا کنید همچنین.
ru: |hand| **Рука** панорамирует контент зрителя; если активирован 3D-вид, инструмент «Рука» также позволяет перемещаться по 3D-виду.

source: |rotate| **Rotate** rotates the viewer content; if the 3D view is activated, the Rotate tool lets you change the point of view.
fa: |rotate| **Rotate** محتوای Viewer را می چرخاند؛ اگر 3D View فعال باشد، Rotate Tool می گذارد زاویه دید را تغییر بدهید.
ru: |rotate| **Поворот** вращает содержимое просмотра; Если 3D-вид активирован, инструмент Повернуть позволяет изменить точку обзора.

source: Tool Options Bar
ru: Панель параметров инструмента

source: The tool options bar displays settings for the current tool, if it has any.
fa: Tool Options Bar تنظیمات را برای ابزار فعلی نمایش می دهد، اگر داشته باشد.
ru: Панель параметров инструмента отображает настройки для текущего инструмента, если он есть.

source: For example it lets you set the thickness and other properties of the Brush tool.
fa: برای مثال اون می گذارد ضخامت و خصوصیات دیگر Brush Tool را تنظیم کنید.
ru: Например, он позволяет установить толщину и другие свойства инструмента «Кисть».

source: If the tool options bar is too short to display all the tool options, it can be scrolled by using arrow buttons available at its ends.
fa: اگر Tool Options Bar برای نمایش تمام گزینه های ابزار خیلی کوتاه است، اون می تواند با استفاده از Arrow Button های در دسترس در انتهای اون اسکرول بشود.
ru: Если панель параметров инструмента слишком короткая для отображения всех параметров инструмента, ее можно прокручивать с помощью кнопок со стрелками, имеющихся на ее концах.

source: Command Bar
ru: Панель команд

source: The Command Bar is a place where the user can display favorite OpenToonz tools and commands to have them readily available.
ru: Панель команд - это место, где пользователь может отображать любимые инструменты и команды OpenToonz, чтобы они были легко доступны.

source: The Command Bar pane can be docked in any part of the OpenToonz UI.
ru: Панель командной панели может быть закреплена в любой части интерфейса OpenToonz.

source: If the Command Bar is too short to display all the command buttons, a double-arrow symbol will appear at the right end of it, allowing to display a drop down menu with the rest of them.
fa: اگر Command Bar برای نمایش تمام دکمه های دستور خیلی کوتاه است، یک نماد Double-Arrow در انتهای سمت راست آن ظاهر می شود، که برای نمایش یک منو Drop Down با بقیه آنها اجازه می دهد.
ru: Если панель команд слишком короткая для отображения всех командных кнопок, справа от нее появится символ двойной стрелки, позволяющий отобразить раскрывающееся меню с остальными.

source: **To display the Command Bar:**
fa: **برای نمایش Command Bar:**
ru: **Для отображения панели команд:**

source: Choose Windows > Command Bar.
ru: Выберите Окна > Панель команд.

source: **To customize the Command Bar buttons:**
fa: **برای سفارشی سازی دکمه های Command Bar:**
ru: **Чтобы настроить кнопки панели команд:**

source: Choose Windows > Command Bar to open the Command Bar.
ru: Выберите Окна > Панель команд, чтобы открыть панель команд.

source: Right click on it and select **Customize Command Bar** from the menu that opens. The Customize Command Bar window will open.
ru: Щелкните правой кнопкой мыши по нему и выберите **Настройка панели команд** в открывшемся меню. Откроется окно «Настройка панели команд».

source: To *add* a command: Search for a command in the **Toolbar Items** list (right) and drag it to the **Command Bar** list (left).
ru: Чтобы *добавить* команду: найдите команду в списке **Элементы панели инструментов** (справа) и перетащите ее в список **Панель команд** (слева).

source: To *add* a separator: At the end of the **Toolbar Items** list (right), drag the **----Separator----** item to the **Command Bar** list (left).
ru: Чтобы *добавить* разделитель: в конце списка **Элементы панели инструментов** (справа) перетащите элемент **----Разделитель----** в список **Панель команд** (слева).

source: To *delete* a command: Locate the command in the **Command Bar** list (left), right click on it and select **Remove** from the menu that opens.
ru: Чтобы *удалить* команду: найдите команду в списке **Панель команд** (слева), щелкните ее правой кнопкой мыши и выберите **Удалить** в открывшемся меню.

source: Click **OK** to accept the changes or **Cancel** to discard them.
fa: **OK** را برای پذیرفتن تغییرات کلیک کنید یا **Cancel** را برای Discard کردن آنها.
ru: Нажмите **OK**, чтобы принять изменения или **Отмена**, чтобы отменить их.

source: Viewer
ru: Просмотрщик

source: The viewer is the work area where you can draw images and see at the same time the result of your compositing. It is endless and you can scroll, zoom in, zoom out and rotate it the way you prefer.
fa: Viewer ناحیه کاری ای است که شما می توانید تصاویر بکشید و همزمان نتیجه Composite کردن تان را ببینید. اون بی پایان است و شما می توانید طوری که ترجیح می دهید Scroll, Zoom In, Zoom Out و Rotate اش کنید.
ru: Просмотрщик - это рабочая область, в которой вы можете рисовать изображения и одновременно видеть результат композитинга. Это бесконечно, и вы можете прокручивать, увеличивать, уменьшать и поворачивать его так, как вы предпочитаете.

source: It has different modes of visualization among which you can choose the more suitable to the operation you are performing.
fa: اون حالت های متفاوتی از Visualization دارد که از این میان شما می توانید حالت مناسب تر را برای عملیاتی که دارید اجرا می کنید انتخاب کنید.
ru: Он имеет различные режимы визуализации, среди которых вы можете выбрать наиболее подходящий для выполняемой вами операции.

source: See :ref:`Using the Viewer <using_the_work_area>` and :ref:`Previewing the Animation <previewing_the_animation>` .
fa: ببینید :ref:`Using the Viewer <using_the_work_area>` و :ref:`Previewing the Animation <previewing_the_animation>` .
ru: См. :ref:`Использование Просмотрщика <using_the_work_area>` и :ref:`Предварительный просмотр анимации <previewing_the_animation>`.

source: The comboviewer integrates in a single pane a viewer, horizontal toolbar and a tool options bar. It's and alternative work area where you can draw images and see at the same time the result of your compositing. It is endless and you can scroll, zoom in, zoom out and rotate it the way you prefer.
ru: Comboviewer объединяет в одной панели средство просмотра, горизонтальную панель инструментов и панель параметров инструмента.Это и альтернативная рабочая область, где вы можете рисовать изображения и одновременно видеть результат вашего композитинга. Это бесконечно, и вы можете прокручивать, увеличивать, уменьшать и по

source: The Xsheet allows you to manage the scene content, in the same manner as the timeline. It is organized in columns, and columns are divided into cells, representing the content of that column in that particular frame. In the columns you can load animation levels, clips, images, audio files or other Xsheets.
fa: Xsheet به شما اجازه می دهد تا محتوای صحنه را، در شیوه یکسان با TimeLine مدیریت کنید. اون در Column ها سازمان دهی شده، و Column ها به Cell ها تقسیم می شوند، نمایانگر محتوای آن Column در آن فریم بخصوص. در Column ها شما می توانید Animation Level ها، کلیپ ها، تصاویر، فایل های صدا یا Xsheet های دیگر را لود کنید.
ru: Xsheet позволяет вам управлять содержимым сцены так же, как и временной шкалой. Он организован в столбцы, а столбцы разделены на ячейки, представляющие содержимое этого столбца в данном конкретном кадре. В столбцы можно загружать уровни анимации, клипы, изображения, аудиофайлы или другие таблицы Xsheets.

source: Each column has its own header containing information about its content. The column on the far left displays the frame number, with a cursor placed on the current frame. The headers area and the frame column are always visible, even when scrolling the Xsheet area; in this way it's easier to understand how the scene is built.
fa: هر Column هدر خودش را دارد حاوی اطلاعاتی درباره محتوایش. Column ئه در منتهی علیه سمت چپ شماره فریم را نمایش می دهد، با یک Cursor قرار داده شده روی فریم فعلی. ناحیه Header ها و Column ئه فریم همیشه قابل مشاهده اند، حتی موقع اسکرول ناحیه Xsheet؛ در این روش اون برای فهمیدن اینکه صحنه چجوری ساخته شده است آسان تر می باشد.
ru: Каждый столбец имеет свой собственный заголовок, содержащий информацию о его содержании. В крайнем левом столбце отображается номер кадра с курсором на текущем кадре. Область заголовков и столбец фрейма всегда видны даже при прокрутке области Xsheet; таким образом легче понять, как строится сцена.

source: Frames are rendered reading images from left to right in each cell row.
fa: فریم ها با خواندن تصاویر از چپ به راست در هر ردیف Cell رندر می شوند.
ru: Кадры отображаются с чтением изображений слева направо в каждой строке ячейки.

source: See :ref:`Working in Xsheet <working_in_xsheet>` .
fa: ببینید :ref:`Working in Xsheet <working_in_xsheet>` .
ru: См. :ref:`Работа в Xsheet <working_in_xsheet>`.

source: Timeline
ru: Таймлайн

source: The timeline allows you to manage the scene content, in the same manner as the Xsheet. It is organized in horizontal layers, and layers are divided into cells, representing the content of that layer in that particular frame. In the layers you can load animation levels, clips, images, audio files or other timelines.
fa: TimeLine به شما اجازه می دهد تا محتوای صحنه را، در شیوه یکسان با Xsheet مدیریت کنید. اون در Layer های افقی سازمان دهی شده، و Layer ها به Cell ها تقسیم می شوند، نمایانگر محتوای آن Layer در آن فریم بخصوص. در Layer ها شما می توانید Animation Level ها، کلیپ ها، تصاویر، فایل های صدا یا TimeLine های دیگر را لود کنید.
ru: Таймлайн позволяет вам управлять содержимым сцены так же, как Xsheet. Он организован в горизонтальных слоях, и слои разделены на ячейки, представляющие содержимое этого слоя в этом конкретном кадре. В слоях вы можете загружать уровни анимации, клипы, изображения, аудиофайлы или другие временные шкалы.

source: At the leftmost part each layer has its own header containing information about its content. At the top part of the timeline there is a time ruler that displays the frame number, with a cursor placed on the current frame. The headers area and the time ruler are always visible, even when scrolling the timeline area; in this way it's easier to understand how the scene is built.
fa: در چپ ترین بخش هر Layer هدر خودش را دارد حاوی اطلاعاتی درباره محتوایش. در بخش بالای TimeLine یک Time Ruler است که شماره فریم را نمایش می دهد، با یک Cursor قرار داده شده روی فریم فعلی. ناحیه Header ها و Time Ruler همیشه قابل مشاهده اند، حتی موقع اسکرول ناحیه TimeLine؛ در این روش اون برای فهمیدن اینکه صحنه چجوری ساخته شده است آسان تر می باشد.
ru: В самой левой части каждый слой имеет свой собственный заголовок, содержащий информацию о его содержимом. В верхней части временной шкалы есть линейка времени, которая отображает номер кадра с курсором на текущем кадре. Область заголовков и линейка времени всегда видны, даже при прокрутке области шкалы времени; таким образом легче понять, как строится сцена.

source: Frames are rendered reading images from bottom to top in each cell column.
fa: فریم ها با خواندن تصاویر از پایین به بالا در هر ستون Cell رندر می شوند.
ru: Кадры отображаются с чтением изображений снизу вверх в каждом столбце ячейки.

source: History
ru: История

source: The history pane, lets you check and undo/redo the history of the latest actions performed in the current OpenToonz scene.
ru: Панель истории, позволяет проверять и отменять/повторять историю последних действий, выполненных в текущей сцене OpenToonz.

source: See :ref:`Assigning Memory for the Undo Operation <assigning_memory_for_the_undo_operations>` .
fa: ببینید :ref:`Assigning Memory for the Undo Operation <assigning_memory_for_the_undo_operations>` .
ru: См. :ref:`Назначение памяти для операции отмены <assigning_memory_for_the_undo_operations>`.

source: Record Audio
ru: Запись аудио

source: The record audio window, lets you record a live audio source, listen to it, and insert it into a new audio column of the Xsheet. The insertion point will be located at the right of the selected cell column, and starting at the selected cell frame.
ru: Окно записи аудио, позволяет записывать источник звука в реальном времени, прослушивать его и вставлять в новый аудио-столбец таблицы Xsheet.Точка вставки будет расположена справа от выбранного столбца ячейки и начинается с выбранного кадра ячейки.

source: Currently, this window cannot be docked to form part of a room, like the other ones in the Windows menu. Instead it must be opened as a floating window, when needed.
ru: В настоящее время это окно нельзя закрепить, чтобы образовать часть комнаты, как и другие в меню Окна. Вместо этого оно должно быть открыто как плавающее окно, когда это необходимо.

source: Customizing the Interface Appearance
fa: سفارشی سازی ظاهر رابط
ru: Настройка внешнего вида интерфейса

source: The appearance of the OpenToonz interface can be customized to suit any production need by choosing a specific language and interface theme.
ru: Внешний вид интерфейса OpenToonz можно настроить в соответствии с любой производственной потребностью, выбрав требуемый язык и тему интерфейса.

source: OpenToonz allows users to choose a specific language for the software interface, including menus, commands, tooltips, and on-screen messages. Currently available languages are: English, German, Spanish, French, Italian, Russian, Japanese and Chinese.
ru: OpenToonz позволяет пользователям выбирать определенный язык для интерфейса программного обеспечения, включая меню, команды, всплывающие подсказки и сообщения на экране. В настоящее время доступны следующие языки: английский, немецкий, испанский, французский, итальянский, русский, японский и китайский.

source: There are also several included themes to choose from: Default, Blue, Dark and Light.
ru: Есть также несколько включенных тем на выбор: Default, Blue, Dark и Light.

source: The OpenToonz interface theme set to Default and to Light.
ru: OpenToonz с темами Default и Light.
