Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/managing_projects.po
Languages: ru

source: In this way the needed default folders are automatically created with the same given name (mydrawings), one for each scene, according to the path used when saving the scene. As a consequence, if the variable is used in this way for all the aliases, all the files related to a scene will be stored in a folder named as the scene.
ru: Таким образом, необходимые папки по умолчанию создаются автоматически с тем же именем (mydrawings), по одной для каждой сцены, в соответствии с путем, использованным при сохранении сцены. Как следствие, если переменная используется таким образом для всех псевдонимов, все файлы, относящиеся к сцене, будут храниться в папке с именем сцены.

source: A second example: if **+drawings** is ``mydrawings\$scenepath,`` when you save the scene scene01 in ``+scenes\seq01`` , OpenToonz drawn or cleaned up levels for that scene will be saved in ``mydrawings\seq01\scene01`` ; when you save the scene scene02, in ``mydrawings\seq01\scene02`` ; and so on.
ru: Второй пример: если **+drawing** равно ``mydrawings\$ scenepath,`` при сохранении сцены scene01 в ``+scenes\seq01``, уровни рисования или очистки OpenToonz для этой сцены будут сохранены в ``mydrawings\seq01\scene01``; когда вы сохраняете сцену scene02, в ``mydrawings\seq01\scene02``; и так далее.

source: In this case the needed default folders are automatically created with the name and path of folders used when saving the scene, inside the path specified (mydrawings). As a consequence, if the variable is used in this way for all the aliases, all the files used in the project will be stored in a main folder for each alias, whose content is divided into folders named as the scenes.
ru: В этом случае необходимые папки по умолчанию создаются автоматически с именем и путем к папкам, используемым при сохранении сцены, внутри указанного пути (mydrawings). Как следствие, если переменная используется таким образом для всех псевдонимов, все файлы, используемые в проекте, будут храниться в главной папке для каждого псевдонима, содержимое которого разделено на папки, называемые сценами.

source: The definition of the **+palettes** alias cannot include $scenepath, as the palettes refer to the whole project, not to specific scenes.
ru: Определение псевдонима **+palettes** не может включать $scenepath, поскольку палитры относятся ко всему проекту, а не к конкретным сценам.

source: It is not possible to use at the same time for an alias the $scenepath variable in folder definition and the Append $scenepath option.
ru: Невозможно одновременно использовать для псевдонима переменную $scenepath в определении папки и параметр Append $scenepath.

source: Using the Append $scenepath Option
ru: Использование опции Append $scenepath

source: The Append $scenepath option is available for the **+inputs**, **+drawings** and **+extras** aliases. If you activate the Append $scenepath option for an alias, the path where you save the current scene will be added to the path of the alias, with the needed folders automatically created during the saving process.
ru: Параметр Append $scenepath доступен для псевдонимов **+input **, **+drawing ** и **+extra**. Если вы активируете опцию Append $scenepath для псевдонима, путь, по которому вы сохраняете текущую сцену, будет добавлен к пути псевдонима, при этом необходимые папки автоматически создаются в процессе сохранения.

source: For example if **+drawings** is ``mydrawings`` , and you save the scene scene01 in ``+scenes\seq01`` , OpenToonz drawn or cleaned up levels for that scene will be saved in ``mydrawings\seq01\scene01`` ; if you save the scene scene02 in ``+scenes\seq01`` , OpenToonz drawn or cleaned up levels for that scene will be saved in ``mydrawings\seq01\scene02`` ; and so on.
ru: Например, если **+drawing** равно ``mydrawings`` , и вы сохраняете сцену scene01 в ``+scenes\seq01``, уровни рисования или очистки OpenToonz для этой сцены будут сохраняться в ``mydrawings\seq01\scene01`` ; если вы сохраните сцену scene02 в ``+scenes\seq01``, нарисованные или очищенные уровни OpenToonz для этой сцены будут сохранены в ``mydrawings\seq01\scene02`` ; и так далее.

source: This allows OpenToonz to create scene-related folders automatically when saving OpenToonz files or importing external files, while allowing the use of the generic aliases **+drawings**, **+inputs** and **+extras**, no matter where levels are loaded from within the current project.
ru: Это позволяет OpenToonz автоматически создавать папки, связанные со сценой, при сохранении файлов OpenToonz или импорте внешних файлов, а также позволяет использовать общие псевдонимы **+drawings**, **+inputs** и **+extras**, независимо от того, где уровни загружаются из текущего проекта.

source: When a scene is saved in the **+scenes** folder, the value for $scenepath is the scene name; for example if you save the scene scene02 in **+scenes**, $scenepath will be scene02.
ru: Когда сцена сохраняется в папке **+scenes**, значение для $scenepath является именем сцены; например, если вы сохраните сцену scene02 в **+scenes**, $scenepath будет scene02.

source: It is not possible to use for an alias the Append $scenepath option and at the same time the $scenepath variable in defining the related folder.
ru: Невозможно использовать для псевдонима опцию Append $scenepath и в то же время переменную $scenepath при определении связанной папки.

source: Using the Project Browser
ru: Использование браузера проекта

source: The project browser is available at the end of the file browser tree. It lists all of the projects that have been created, whose actual location is in the projectroot that was defined in the initial installation of OpenToonz. The projectroot value is displayed in brackets.
ru: Браузер проекта доступен в конце дерева браузера файлов. В нем перечислены все созданные проекты, чье фактическое местоположение находится в корне проекта, который был определен при первоначальной установке OpenToonz. Значение Projectroot отображается в скобках.

source: The name of the folders which the aliases point to are displayed in blue.
ru: Название папок, на которые указывают псевдонимы, отображается синим цветом.

source: In case more than one projectroot is defined, each will be listed with the related projectroot value in brackets (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
ru: В случае, если определено более одного projectroot, каждый из них будет указан со связанным значением projectroot в скобках (см. :ref:`Настройка Projectroot <setting_the_projectroot>`).

source: Default Folders with Relative Paths
ru: Папки по умолчанию с относительными путями

source: When default folders are defined by using a relative path, in the project browser you will see all the folders specified in the path under the projectroot, and the project folders tree will be the same of the file system tree. The folders that are the target of the paths are displayed in blue.
ru: Если папки по умолчанию определены с использованием относительного пути, в браузере проекта вы увидите все папки, указанные в пути под корневым каталогом проекта, и дерево папок проекта будет таким же, как и дерево файловой системы. Папки, являющиеся целью путей, отображаются синим цветом.

source: For example, for the project Project01, with **+drawings** that is ``section01\prod drawings`` , the project browser will display the following:
ru: Например, для проекта Project01 с **+drawings**, то есть ``section01\ prod drawing``, браузер проекта отобразит следующее:

source: If the option Append $scenepath is activated, and you save the scene scene01 in ``+scenes\seq01`` , the project browser will display the following:
ru: Если включена опция Append $scenepath, и вы сохраняете сцену scene01 в ``+scenes\seq01``, браузер проекта отобразит следующее:

source: If the $scenepath is used in the folder definition, with +drawings that is ``$scenepath\prod drawings,`` and you save the scene scene01 in ``+scenes\seq01`` , the project browser will display the following:
ru: Если в определении папки используется $scenepath с +drawings, которые являются ``$scenepath\prod drawing``, и вы сохраняете сцену scene01 в ``+scenes\seq01``, браузер проекта отобразит следующее:

source: If the $scenepath is used in the folder definition, with +drawings that is ``mydrawings\$scenepath,`` and you save the scene scene01 in ``+scenes\seq01`` , the project browser will display the following:
ru: Если в определении папки используется $scenepath с +drawings, которые являются ``mydrawings\$ scenepath``, и вы сохраняете сцену scene01 в ``+ scenes\seq01``, браузер проекта отобразит следующее:

source: Default Folders with Absolute Paths
ru: Папки по умолчанию с абсолютными путями

source: When default folders are defined by using an absolute path, in the project browser you will see only the related aliases, whatever their location on the network is. In this way you can quickly access the production material without browsing the computer, or the network. The aliases are displayed in blue, because they are the location the default folders paths point to.
ru: Когда папки по умолчанию определены с использованием абсолютного пути, в браузере проекта вы увидите только связанные псевдонимы, независимо от их расположения в сети. Таким образом, вы можете быстро получить доступ к производственным материалам, не просматривая компьютер или сеть. Псевдонимы отображаются синим цветом, поскольку они являются местоположением, на которое указывают пути к папкам по умолчанию.

source: For example, for the project Project01, with **+drawings** that is ``C:\production\prod drawings`` on Windows, or ``/Volume/Macintosh HD/production/prod drawings`` on Macintosh, the project browser will display the following:
ru: Например, для проекта Project01 с **+drawings**, то есть ``C:\production\prod drawing`` в Windows, или ``/Volume/Macintosh HD/production/prod drawing`` в Macintosh, браузер проекта будет отображать следующее:

source: where **+drawings** is an alias for ``C:\production\prod drawings`` on Windows, or ``/Volume/Macintosh HD/production/prod drawings`` on Macintosh.
ru: где **+drawing** - это псевдоним ``C:\production\prod drawing`` в Windows или ``/Volume/Macintosh HD/production/prod drawing`` в Macintosh.

source: with **+drawings** that is ``C:\seq01\scene01\prod drawings`` on Windows, or ``/Volume/Macintosh HD/seq01/scene01/prod drawings`` on Macintosh, and is located under the related scene file (TNZ format).
ru: с **drawings**, то есть ``C:\seq01\scene01\prod drawings`` в Windows, или ``/Volume/Macintosh HD/seq01/scene01/prod drawings`` в Macintosh и находится под связанный файл сцены (формат TNZ).

source: If the $scenepath is used in the folder definition, with **+drawings** that is ``C:\prod drawings\$scenepath`` on Windows, or ``/Volume/Macintosh HD/prod drawings/$scenepath`` on Macintosh, and you save the scene scene01 in ``+scenes\seq01`` , the project browser will display the same as above, but this time **+drawings** is ``C:\prod drawings\seq01\scene01`` on Windows, or ``/Volume/Macintosh HD/prod drawings/seq01/scene01`` on Macintosh.
ru: Если в определении папки используется $scenepath, с **+drawing**, то есть ``C:\prod drawing\$scenepath`` в Windows, или ``/Volume/Macintosh HD/prod drawing/$scenepath`` на Macintosh, и вы сохраняете сцену scene01 в ``+scenes\seq01`` , браузер проекта будет отображать то же, что и выше, но на этот раз **+ drawing** C:\prod drawings\seq01\scene01`` на Windows или ``/Volume/Macintosh HD/prod drawings/seq01/scene01`` на Macintosh.
