Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/managing_projects.po
Languages: ru

source: Managing Projects
ru: Управление проектами

source: Projects are an easy way to manage scenes and files used in them. They allow you to organize your production material not only by defining default settings used throughout the production, but also default folders where files will be automatically saved, and from where they will be retrieved when needed. This means that, for example, as soon as you scan drawings, they will be saved automatically in the input default folders you specified for your project.
ru: Проекты - это простой способ управления сценами и файлами, которые в них используются. Они позволяют вам организовать ваш производственный материал не только путем определения настроек по умолчанию, используемых в производственном процессе, но также и папок по умолчанию, в которые будут автоматически сохраняться файлы и откуда они будут извлекаться при необходимости. Это означает, что, например, как только вы отсканируете рисунки, они будут автоматически сохранены во входных папках по умолчанию, которые вы указали для своего проекта.

source: The main advantage of managing the production through projects, is that a consistency of production settings and production material can be achieved.
ru: Основным преимуществом управления производством с помощью проектов является то, что можно достичь согласованности производственных параметров и производственных материалов.

source: The consistency of production settings is achieved because all the scenes of a projects, as soon as they are created, inherit all the settings from the project (see :ref:`Setting Up a Scene <setting_up_a_scene>` ).
ru: Согласованность производственных параметров достигается благодаря тому, что все сцены проекта, как только они создаются, наследуют все параметры из проекта (см. :ref:`Настройка сцены <setting_up_a_scene>` ).

source: The right use of production material is achieved because once you have defined a production structure through projects, all the scenes are able to save and retrieve files by using the project default folders.
ru: Правильное использование производственного материала достигается благодаря тому, что после определения производственной структуры с помощью проектов все сцены могут сохранять и извлекать файлы с использованием папок проекта по умолчанию.

source: Setting the Projectroot
ru: Настройка Projectroot

source: The projectroot is the folder where the project information and database are stored; it is displayed in the OpenToonz browser as one of the main folders with the related path in brackets.
ru: Projectroot - это папка, в которой хранится информация о проекте и база данных; он отображается в браузере OpenToonz как одна из основных папок с соответствующим путем в скобках.

source: The default value is ``C:\OpenToonz stuff\projects`` on Windows and ``/Applications/OpenToonz/OpenToonz stuff/projects`` on Macintosh.
ru: Значением по умолчанию является ``C:\OpenToonz stuff\projects`` в Windows и ``/Applications/OpenToonz/OpenToonz stuff/projects`` в Macintosh.

source: If your production has to be managed on more than one computer on a network, you can share the same project database on all the computers you want, by defining the same projectroot on each computer.
ru: Если вашим производством нужно управлять более чем на одном компьютере в сети, вы можете совместно использовать одну и ту же базу данных проекта на всех компьютерах, которые вы хотите, определив один и тот же корень проекта на каждом компьютере.

source: It is also possible to define more than one projectroot if needed: in this case projectroot folders will be visible in the OpenToonz browser, each with the related path in brackets.
ru: При необходимости также можно определить более одного rootproject: в этом случае папки rootproject будут видны в браузере OpenToonz, каждый из которых имеет связанный путь в скобках.

source: The projectroot information can be changed at any moment, for instance if you need to move the project database files from one computer to another.
ru: Корневая информация проекта может быть изменена в любой момент, например, если вам нужно переместить файлы базы данных проекта с одного компьютера на другой

source: **To set the projectroot on Windows:**
ru: **Чтобы установить rootproject в Windows:**

source: Open the Run application dialog by selecting Run from the Start menu.
ru: Откройте диалоговое окно «Выполнить приложение», выбрав в меню «Пуск» пункт «Выполнить».

source: Type ``regedit`` in the text box and click OK. This will open the Registry Editor application.
ru: Введите ``regedit`` в текстовое поле и нажмите ОК. Откроется приложение редактора реестра.

source: Navigate to the ``HKEY_LOCAL_MACHINE\SOFTWARE\OpenToonz\OpenToonz`` and double-click TOONZPROJECTS in the right part of the window: the Edit String dialog opens.
ru: Перейдите к ``HKEY_LOCAL_MACHINE\SOFTWARE\OpenToonz\OpenToonz`` и дважды щелкните TOONZPROJECTS в правой части окна: откроется диалоговое окно «Редактировать строку».

source: Enter the new path for the projectroot.
ru: Введите новый путь для rootproject.

source: Click OK and exit from the Registry Editor application.
ru: Нажмите OK и выйдите из приложения редактора реестра.

source: Restart OpenToonz to make the change effective.
ru: Нажмите OK и выйдите из приложения редактора реестра.

source: **To add a projectroot on Windows:**
ru: **Чтобы добавить projectroot в Windows:**

source: Open the registry editor to edit the TOONZPROJECTS registry as described above.
ru: Откройте редактор реестра, чтобы отредактировать реестр TOONZPROJECTS, как описано выше.

source: Enter the path for the new projectroot, separated by a semicolon (e.g. ``C:\production01;D:\production02`` ).
ru: Введите путь для нового корня проекта, разделенный точкой с запятой (например, ``C:\production01;D:\production02``).

source: **To set the projectroot on Macintosh:**
ru: **Чтобы установить projectroot на Macintosh**

source: Right-click the OpenToonz icon in the ``Applications/OpenToonz`` folder, and choose Show Package Contents from the menu that opens.
ru: Щелкните правой кнопкой мыши по значку OpenToonz в папке ``Applications/OpenToonz`` и выберите «Показать содержимое пакета» в открывшемся меню.

source: In the folder that opens browse to the ``Contents/Resources`` folder and open the ``SystemVar.ini`` file with a text editor application, such as TextEdit.
ru: В открывшейся папке перейдите в папку ``Contents/Resources`` и откройте файл ``SystemVar.ini`` с помощью приложения для текстового редактора, такого как TextEdit.

source: 3. Look for the following line where the projectroot is defined: ``TOONZPROJECTS=”/Applications/OpenToonz/OpenToonz stuff/projects”``
ru: 3. Найдите следующую строку, в которой определен projectroot: `` TOONZPROJECTS = ”/Applications/OpenToonz/OpenToonz stuff/projects”``

source: Change the path in inverted commas by typing a new one.
ru: Измените путь в кавычках, введя новый.

source: Save the ``SystemVar.ini`` file.
ru: Сохраните файл ``SystemVar.ini``.

source: **To add a projectroot on Macintosh:**
ru: **Чтобы добавить projectroot в Macintosh:**

source: Open the configuration file to edit the TOONZPROJECTS variable as described above.
ru: Откройте файл конфигурации, чтобы изменить переменную TOONZPROJECTS, как описано выше.

source: Change the path in inverted commas by adding a new path for the new projectroot, separated by a semicolon (e.g. ``/Applications/OpenToonz/OpenToonz stuff/production01`` ``;`` ``/Applications/OpenToonz/OpenToonz stuff/production02`` ).
ru: Измените путь в кавычках, добавив новый путь для нового корня проекта, разделенного точкой с запятой (например, ``/Applications/OpenToonz/OpenToonz stuff/production01`` ``;`` ``/Applications/OpenToonz/OpenToonz stuff/production02``).

source: Setting up Projects
ru: Настройка проектов

source: When you define a new project you can specify its default folders, while its default settings will be inherited from the current project. Default folders and settings can be modified at any time to satisfy new production needs.
ru: Когда вы определяете новый проект, вы можете указать его папки по умолчанию, тогда как его настройки по умолчанию будут унаследованы от текущего проекта. Папки и настройки по умолчанию могут быть изменены в любое время для удовлетворения новых производственных потребностей.

source: Project information is stored in an XML file named as the project with the ``_otprj`` suffix, in a folder named as the project located in the projectroot (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
ru: Информация о проекте хранится в файле XML, названном как проект с суффиксом ``_otprj``, в папке с именем проекта, расположенной в projectroot (см. :ref:`Настройка Projectroot <setting_the_projectroot>`).

source: Projects can be organized in folders and can contain sub-projects that can be browsed in the OpenToonz file browser. This allows you to customize the project structures in order to follow your production needs, for instance creating a folder for each episode, then a project for each scene belonging to that episode. As the project browser will display the project tree and all the folders contained in the projectroot, you can also organize your folder structure in the projectroot by using the OS file system.
ru: Проекты могут быть организованы в папки и могут содержать подпроекты, которые можно просматривать в файловом браузере OpenToonz. Это позволяет вам настраивать структуры проекта в соответствии с вашими производственными потребностями, например, создавать папку для каждого эпизода, а затем проект для каждой сцены, принадлежащей этому эпизоду. Поскольку браузер проекта отображает дерево проекта и все папки, содержащиеся в корне проекта, вы также можете организовать структуру папок в корне проекта с помощью файловой системы ОС.

source: There is always one current project selected in the project browser: when you start working on a scene, automatically it will belong to the current project, inheriting its settings and default folders.
ru: В браузере проекта всегда выбран один текущий проект: когда вы начинаете работать над сценой, он автоматически принадлежит текущему проекту, наследуя его настройки и папки по умолчанию.

source: If you want a new scene to be part of a new project, first you have to define a new project. If you want it to be part of a previously created project, first you have to set that project as the current one.
ru: Если вы хотите, чтобы новая сцена была частью нового проекта, сначала вы должны определить новый проект. Если вы хотите, чтобы он был частью ранее созданного проекта, сначала вы должны установить этот проект в качестве текущего.

source: If you want to use the farm for rendering scenes, all the server (rendering) nodes of the farm have to share the same projectroot (see :ref:`Installing the Toonz Farm on Windows <installing_the_toonz_farm_on_windows>` ) and all the drives containing the projects database, have to be shared on the network.
ru: Если вы хотите использовать ферму для рендера сцен, все серверные (рендер) узлы фермы должны совместно использовать один и тот же projectroot (см. :ref:`Установка фермы Toonz на Windows <installing_the_toonz_farm_on_windows>`) и все диски, содержащие базу данных проектов, должны быть доступны в сети.

source: **To create a new project:**
ru: **Для создания нового проекта:**

source: Select the projectroot or repository (see :ref:`Configuring the Version Control in OpenToonz <configuring_the_version_control_in_toonz>` ), and the project or folder where you want to create the new project.
ru: Выберите projectroot или репозиторий (см. :ref:`Настройка контроля версий в OpenToonz <configuring_the_version_control_in_toonz>`) и проект или папку, в которой вы хотите создать новый проект.

source: Type the name of the project and set the path to the folders you want to use as default.
ru: Введите имя проекта и укажите путь к папкам, которые вы хотите использовать по умолчанию.

source: Click the OK button.
ru: Нажмите кнопку ОК.

source: **To change the current project:**
ru: **Чтобы изменить текущий проект:**

source: Click the small round button on the left of the project name in the project tree available in the OpenToonz file browser. It becomes red when selected.
ru: Нажмите маленькую круглую кнопку слева от имени проекта в дереве проекта, доступном в браузере файлов OpenToonz. Становится красным при выборе.

source: **To add a scene to a project:**
ru: **Чтобы добавить сцену в проект:**

source: Set the project as the current one.
ru: Установите проект как текущий.

source: **To change project default folders:**
ru: **Чтобы изменить папки проекта по умолчанию:**

source: When changing default folders, scenes previously created in the same project may fail retrieving used files.
ru: При изменении папок по умолчанию сцены, ранее созданные в том же проекте, могут не получить нужные файлы.

source: Project Default Folders
ru: Папки проекта по умолчанию

source: Projects have default folders where scanned drawings, painted drawings, scenes, rendered frames and palettes are automatically saved. These folders are shared by all of the scenes created for that particular project, and are labelled in the following way:
ru: Проекты имеют папки по умолчанию, в которые автоматически сохраняются отсканированные рисунки, нарисованные рисунки, сцены, визуализированные кадры и палитры. Эти папки являются общими для всех сцен, созданных для этого конкретного проекта, и помечаются следующим образом:

source: **+inputs** is the folder where all scanned drawings are saved (as TIF files).
ru: **+input** - папка, в которой сохранены все отсканированные рисунки (в виде файлов TIF).

source: **+drawings** is the folder where OpenToonz cleaned up drawings, drawings made directly in OpenToonz and imported OpenToonz drawings are saved (TLV and PLI files).
ru: **+drawings** - это папка, в которую OpenToonz помещает очищенные рисунки, рисунки, сделанные непосредственно в OpenToonz, и импортированные рисунки OpenToonz (файлы TLV и PLI).

source: **+scenes** is the folder where the OpenToonz scenes are saved (TNZ files).
ru: **+сцены** - это папка, в которую сохраняются сцены OpenToonz (файлы TNZ).

source: **+extras** is the folder where all the imported non-OpenToonz levels, images and audio files are saved.
ru: **+extras** - это папка, в которой сохранены все импортированные не-OpenToonz уровни, изображения и аудиофайлы.

source: **+outputs** is the folder where rendered images are saved.
ru: **+outputs** - это папка, в которой сохраняются отрендеренные изображения.

source: **+palettes** is the folder where the project palettes of the studio palette are saved, and where the Raster Drawing Palette, shared by all the raster levels belonging to the project, is stored.
ru: **+palettes** - это папка, в которой сохраняются палитры проекта палитры Studio и где хранится палитра растровых рисунков, общая для всех растровых уровней.

source: For each of these folders you can specify different locations on your computer network depending on the way you set up the storage of your production material.
ru: Для каждой из этих папок вы можете указать различные местоположения в вашей компьютерной сети в зависимости от того, как вы настроили хранилище вашего производственного материала.

source: Absolute or relative paths can be specified for the default folders definition.
ru: Абсолютные или относительные пути могут быть указаны для определения папок по умолчанию.

source: If you specify an absolute path, the folders will be created, when needed, where specified. For example you can set **+drawings** to be ``C:\production\drawings01`` on Windows, or ``/Volume/Macintosh HD/production/drawing01`` on Macintosh: this means that the OpenToonz drawn and cleaned up levels will be automatically saved in ``C:\production\drawings01`` on Windows, or in ``/Volume/Macintosh HD/production/drawing01`` on Macintosh.
ru: Если вы укажете абсолютный путь, папки будут создаваться при необходимости там, где это указано. Например, вы можете установить **+drawings** в ``C:\production\drawing01`` в Windows или ``/Volume/Macintosh HD/production/drawing01`` в Macintosh: это означает, что OpenToonz нарисовал и очищенные уровни будут автоматически сохраняться в ``C:\production\drawing01`` в Windows или в ``/Volume/Macintosh HD/production/drawing01`` в Macintosh.

source: If you specify a relative path, all the folders you specify in the path will be created, when needed, in the project folder under the selected projectroot or repository (see :ref:`Configuring the Version Control in OpenToonz <configuring_the_version_control_in_toonz>` ). For example, for the project myproject, you can set **+drawings** to be ``sequence01\mydrawings`` : this means that the OpenToonz drawn and cleaned up levels will be automatically saved in the ``myproject\sequence01\mydrawings`` folder located in the selected projectroot or repository.
ru: Если вы укажете относительный путь, все папки, которые вы укажете в пути, будут созданы, когда это необходимо, в папке проекта в выбранном корне или репозитории проекта (см. :ref:`Настройка контроля версий в OpenToonz <configuring_the_version_control_in_toonz>`). Например, для проекта myproject вы можете установить **+drawing** как ``sequence01\mydrawings``: это означает, что нарисованные и очищенные уровни OpenToonz будут автоматически сохраняться в ``myproject\sequence01\mydrawings`` папке, находящейся в выбранном projectroot или репозитории.

source: The $scenepath variable can also be used to automatically create specific folders according to the scene you are working on. The variable can be either appended to the specified paths, or used in the path definition.
ru: Переменная $scenepath также может использоваться для автоматического создания определенных папок в соответствии со сценой, над которой вы работаете. Переменная может быть либо добавлена ​​к указанным путям, либо использована в определении пути.

source: The labels of the default folders you can find in the project settings (i.e. **+drawings**, **+extras**, etc.) can be used as aliases in OpenToonz. For example if some material is retrieved from the extras default folder, its loading path will contain the alias **+extras**. They can be also used when you need to specify a saving path, for example in the Path field of the New Level dialog.
ru: Метки папок по умолчанию, которые вы можете найти в настройках проекта (то есть **+drawings**, **+extras** и т. д.), могут использоваться в качестве псевдонимов в OpenToonz. Например, если какой-либо материал извлекается из дополнительной папки по умолчанию, путь ее загрузки будет содержать псевдоним **+extras**. Их также можно использовать, когда необходимо указать путь сохранения, например, в поле «Путь» диалогового окна «Новый уровень».

source: When in a scene you load material not located in the current project folders, you can choose whether to import files, that is to say copy them in the related project folders, or to create a link with the external file. The link is defined by an absolute path.
ru: Когда в сцене вы загружаете материал, не находящийся в папках текущего проекта, вы можете выбрать, следует ли импортировать файлы, то есть копировать их в соответствующие папки проекта, или создать ссылку с внешним файлом. Ссылка определяется абсолютным путем.

source: Files loaded in a scene without importing can be imported later on at once by using the Collect Assets feature (see :ref:`Collecting Assets <collecting_assets>` ).
ru: Файлы, загруженные в сцену без импорта, могут быть импортированы позже сразу же с помощью функции «Сбор активов» (см. :ref:`Сбор активов <collecting_assets>`).

source: All shared disks involved in the folder definitions, i.e. disks where production material has to be written and read, must be shared granting full permissions to any user, otherwise the exchange of files will not succeed. For Windows, disks must have a Share Permission set to Full Control for Everyone; for Macintosh, the sharing settings must allow any user to read from and write to disks.
ru: Все общие диски, участвующие в определениях папок, то есть диски, на которых производственный материал должен быть записан и прочитан, должны быть общими, предоставляя полные права любому пользователю, иначе обмен файлами не будет успешным. Для Windows диски должны иметь разрешение общего доступа, установленное на полный доступ для всех; для Macintosh настройки общего доступа должны позволять любому пользователю выполнять чтение и запись на диски.

source: When no project is defined, the ``OpenToonz stuff/sandbox`` project is used by default.
ru: Когда проект не определен, проект ``OpenToonz stuff/sandbox`` используется по умолчанию.

source: **To set default folders for a new project:**
ru: **Чтобы установить папки по умолчанию для нового проекта:**

source: Do one of the following:
ru: Выполните одно из следующих действий:

source: Type the path to the folder you want to use as default.
ru: Введите путь к папке, которую вы хотите использовать по умолчанию.

source: Use the browser button on the right of each text field, to set the folder you want to use as default.
ru: Используйте кнопку браузера справа от каждого текстового поля, чтобы установить папку, которую вы хотите использовать по умолчанию.

source: Adding Custom Default Folders
ru: Добавление пользовательских папок по умолчанию

source: where the **+backgrounds** and **+3D** aliases were added to the default ones.
ru: где псевдонимы **+backgrounds** и **+3D** были добавлены к псевдонимам по умолчанию.

source: **To add more default folders to projects:**
ru: **Чтобы добавить больше папок по умолчанию в проекты:**

source: Open the ``OpenToonz stuff\profiles\project_folders.txt`` file.
ru: Откройте файл ``OpenToonz stuff\profile\project_folders.txt``.

source: List the default folders you want to define, one per line, and save the file.
ru: Перечислите папки по умолчанию, которые вы хотите определить, по одной на строку, и сохраните файл.

source: Using the $scenepath Variable in Folder Definition
ru: Использование переменной $scenepath в определении папки

source: The $scenepath variable can also be used in the definition of the **+inputs**, **+drawings**, and **+extras** aliases when typing the default folder path. In this case the path where you save the current scene will replace the $scenepath variable in the path definition, with the needed folders automatically created during the saving process.
ru: Переменная $scenepath может также использоваться в определении псевдонимов **+input**, **+drawing** и **+extras** при вводе пути к папке по умолчанию. В этом случае путь, по которому вы сохраняете текущую сцену, заменит переменную $scenepath в определении пути, при этом необходимые папки автоматически создаются в процессе сохранения.

source: For example if **+drawings** is ``$scenepath\mydrawings,`` and you save the scene scene01 in ``+scenes\seq01`` , OpenToonz drawn or cleaned up levels for that scene will be saved in ``seq01\scene01\mydrawings`` ; when you save the scene scene02, in ``seq01\scene02\mydrawings`` ; and so on.
ru: Например, если **+drawing** равно ``$scenepath\mydrawings, ``, и вы сохраняете сцену scene01 в ``+scenes\seq01``, уровни рисования или очистки OpenToonz для этой сцены будут сохраняться в ``seq01\scene01\mydrawings``; когда вы сохраняете сцену scene02, в ``seq01\scene02\mydrawings``; и так далее.
