Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/production_workflow.po
Languages: fa

source: Production Workflow
fa: روند کار تولید

source: Traditional Workflow
fa: روند کار سنتی

source: The following is an example of how Tahoma allows the management of a traditional animation production.
fa: در ادامه مثالی هست از اینکه تاهوما چگونه امکان مدیریت یک تولید سنتی انیمیشن را می دهد.

source: Scanning
fa: اسکن

source: Hand-drawn elements are first defined in an Tahoma Xsheet, and then acquired by using a scanner. These elements can consist of animation levels, i.e. sequences of drawings belonging to the same animation, or background images and overlays.
fa: المان های دستی کشیده شده اول در یک Tahoma Xsheet تعریف می شوند و بعد با استفاده از یک اسکنر به دست می آیند. این المان ها می توانند از Animation Level ها، یعنی توالی هایی از نقاشی های متعلق به یک انیمیشن، یا تصاویر پس زمینه و Overlay ها تشکیل شده باشند.

source: The scanned images then pass through a cleanup process, and are auto centered when necessary, using their pegbar holes as a guide and their related field guide setting. In the case of lineart drawings, these are further prepared for the painting process.
fa: تصاویر اسکن شده سپس یک پروسه Cleanup را می گذرانند؛ و در صورت لزوم با استفاده از سوراخ های Pegbar شان به عنوان یک راهنما و تنظیمات Field Guide مرتبط شان، Auto Center می شوند. در مورد نقاشی های LineArt، این ها اضافه تر برای پروسه رنگ آمیزی آماده می شوند.

source: Paperless Drawing
fa: نقاشی بی کاغذ

source: Additional drawings and animation levels can be drawn directly in Tahoma. Drawings can be an important part of the scene, such as a background or a character’s prop, or incidental elements needed to achieve a particular result, for example a mask image to create a matte effect.
fa: نقاشی ها و Animation Level های اضافی می توانند مستقیما در تاهوما کشیده بشوند. نقاشی ها می توانند بخش مهمی از صحنه باشند، مثل یک پس زمینه یا یک Character’s Prop؛ یا المان های جانبی مورد نیاز برای دستیابی به یک نتیجه بخصوص، برای مثال یک Mask Image برای ایجاد کردن یک Matte Effect.

source: See :ref:`Drawing Animation Levels <drawing_animation_levels>` .
fa: ببینید :ref:`Drawing Animation Levels <drawing_animation_levels>` .

source: Color Model
fa: مدل رنگی

source: Color models are created for accurate color-referencing during production, when painting characters and props. They can be drawings made in Tahoma, scanned images processed in Tahoma, or images coming from a 3rd party software.
fa: مدل های رنگی برای Color-Referencing دقیق طی تولید، هنگام رنگ آمیزی کاراکتر ها و Prop ها ایجاد می شوند. آنها می توانند نقاشی های ساخته شده در تاهوما، تصاویر اسکن شده ی پردازش شده در تاهوما، یا تصاویر آمده از یک نرم افزار شخص ثالث باشند.

source: In case of Tahoma drawings, the color model palette can be defined by creating styles and colors to be used for painting animation levels.
fa: در مورد نقاشی های تاهوما، پالت مدل رنگی می تواند توسط ایجاد Style ها و Color ها تعریف بشود تا برای رنگ آمیزی Animation Level ها استفاده شود.

source: See :ref:`Managing Palettes and Styles <managing_palettes_and_styles>` and :ref:`Using a Color Model <using_a_color_model>` .
fa: ببینید :ref:`Managing Palettes and Styles <managing_palettes_and_styles>` و :ref:`Using a Color Model <using_a_color_model>` .

source: Ink & Painting
fa: جوهر و رنگ آمیزی

source: Animation levels scanned and cleaned up in Tahoma, and those made directly in Tahoma, are painted by using the styles stored in the palette and a set of tools.
fa: Animation Level های اسکن و Cleanup شده در تاهوما، و آنهایی که مستقیما در تاهوما ساخته شدند، با استفاده از Style های ذخیره شده در پالت و یک مجموعه از ابزار ها رنگ آمیزی می شوند.

source: Palette styles are interactively “linked” to drawn lines and filled areas by using indexes. The main advantage of this method is that if you edit a style of the palette, all the lines and filled areas using that style will be automatically updated. This allows you to change or calibrate colors also after the painting process has been done, without correcting the style line by line, or area by area.
fa: Style های پالت با استفاده از Index ها به طور تعاملی به خطوط کشیده شده و مناطق پر شده «لینک شده» هستن. مزیت اصلی این روش این است که اگر شما یک Style از پالت را ویرایش کنید، تمام خطوط و مناطق پر شده با استفاده از آن Style به طور خودکار بروزرسانی می شوند. این به شما اجازه می دهد تا همچنین بعد از اینکه پروسه رنگ آمیزی انجام شد رنگ ها را عوض یا کالیبره کنید؛ بدون تصحیح Style خط به خط، یا منطقه به منطقه.

source: See :ref:`Managing Palettes and Styles <managing_palettes_and_styles>` and :ref:`Painting Animation Levels <painting_animation_levels>` .
fa: ببینید :ref:`Managing Palettes and Styles <managing_palettes_and_styles>` و :ref:`Painting Animation Levels <painting_animation_levels>` .

source: Compositing
fa: کامپوزیت

source: All Tahoma painted levels and images are exposed in the Xsheet where the timing of all the elements of a scene can be controlled. Images, animations and clips from 3rd party software can be loaded as well.
fa: تمام Level های رنگ آمیزی شده و تصاویر تاهوما در Xsheet پدیدار می شوند جایی که زمان بندی تمام المان های یک صحنه می تواند کنترل بشود. تصاویر، انیمیشن ها و کلیپ هایی از نرم افزار شخص ثالث هم همچنین می توانند بارگذاری بشوند.

source: After adding and arranging the required elements to the Xsheet as layered columns, they are then animated by using interpolated keys placed on necessary parameters. Elements that can be animated in this way include the camera, columns, pegbars and the table.
fa: بعد از اضافه کردن و ترتیب دادن المان های مورد نیاز در Xsheet به عنوان ستون های لایه بندی شده، آنها سپس با استفاده از Interpolated Key های قرار گرفته شده روی پارامتر های لازم انیمیت می شوند. المان هایی که می توانند از این راه انیمیت بشوند شامل دوربین، Column ها، Pegbar ها و Table می شوند.

source: Special FX, such as blurs, lights, keys, masks, warps, gradients, etc. can be applied to the content of Xsheet columns, and can also be animated by setting key value to the parameters.
fa: جلوه های ویژه، مثل Blur ها، Light ها، Key ها، Mask ها، Warp ها، Gradient ها، و... می توانند به محتوای Xsheet Column ها اعمال بشوند؛ و می توانند همچنین با تنظیم مقدار کلیدی برای پارامتر ها انیمیت بشوند.

source: Object and special FX transformations are mapped in the function editor panel, where set key values and related interpolations can be controlled and modified by using function curves or numerical columns.
fa: Transformation های Object و جلوه های ویژه در پنل Function Editor نگاشته می شوند؛ جایی که تنظیم Key Value ها و Interpolation های مرتبط می توانند با استفاده از Function Curve ها یا Numerical Column ها کنترل و اصلاح بشوند.

source: See :ref:`Working in Xsheet <working_in_xsheet>` , :ref:`Creating Movements <creating_movements>` , :ref:`Applying Special FX <applying_special_fx>` and :ref:`Editing Using Spreadsheet and Curves <editing_curves_and_numerical_columns>` .
fa: ببینید :ref:`Working in Xsheet <working_in_xsheet>` , :ref:`Creating Movements <creating_movements>` , :ref:`Applying Special FX <applying_special_fx>` و :ref:`Editing Using Spreadsheet and Curves <editing_curves_and_numerical_columns>` .

source: Render Farm
fa: رندر فارم

source: The scene is rendered in order to compose all the transformations and applied special FX in a sequence of frames in the format and resolution you prefer.
fa: صحنه به منظور ترکیب تمام Transformation ها و جلوه های ویژه ی اعمال شده، در یک توالی از فریم ها در فرمت و رزولوشنی که شما ترجیح می دهید رندر می شود.

source: The Tahoma render farm allows you to batch-render Tahoma scenes by using a series of computers connected on the same network using TCP/IP.
fa: Tahoma Render Farm به شما اجازه می دهد تا صحنه های تاهوما را با استفاده از یک مجموعه از کامپیوتر های متصل شده به یک Network با استفاده از TCP/IP رندر-دسته ای کنید.

source: See :ref:`Rendering the Animation <rendering_the_animation>` and :ref:`Using the Toonz Farm <using_the_toonz_farm>` .
fa: ببینید :ref:`Rendering the Animation <rendering_the_animation>` و :ref:`Using the Toonz Farm <using_the_toonz_farm>` .

source: Paperless Workflow
fa: روند کار بی کاغذ

source: The following is an example of how Tahoma allows the management of a paperless animation production.
fa: در ادامه مثالی هست از اینکه تاهوما چگونه امکان مدیریت یک تولید بی کاغذ انیمیشن را می دهد.

source: Preproduction: Concept
fa: پیش تولید: کانسپت

source: Even if a paperless project can be run regardless of the script, the concept of a format with few settings and a stable cast of characters will ease the arrangement of libraries to be prepared before the actual episode production.
fa: حتی اگر یک پروژه بی کاغذ صرف نظر از فیلم نامه بتواند اجرا بشود، کانسپتِ یک فرمت با چند Setting و یک Cast پایدار از کاراکتر ها، مرتب کردن Library ها برای آماده شدن قبل از تولید واقعی اپیزود را راحت می کند.

source: Preproduction: Graphic Design
fa: پیش تولید: طراحی گرافیکی

source: The graphic design of characters, props and locations is equally important, in order to find out a style that will fit well both with the drawing capabilities of the software and with the cutout animation technique.
fa: طراحی گرافیکی کاراکتر ها، Prop ها و لوکیشن ها به یک اندازه مهم اند؛ به منظور پیدا کردن یک استایل که به خوبی هم با قابلیت های نقاشی نرم افزار و هم با تکنیک انیمیشن Cutout سازگار باشد.

source: In particular when designing character models and props, for which you could develop a specific line style to apply to vectors, or use very neat lines typical of vector animations, you should consider a design where the model animation pivot points can be easily disguised under drawings features (for example the pivot point of a ponytail linked to the character’s head can be disguised under a ribbon).
fa: به خصوص هنگام طراحی مدل های کاراکتر و Prop ها، برای اینکه شما بتوانید یک Line Style به خصوص برای اعمال روی Vector ها توسعه بدهید، یا از خطوط بسیار تمیزِ معمول انیمیشن های Vector استفاده کنید، شما باید طرح ای را در نظر بگیرید که نقاط Pivot انیمیشنِ مدل بتوانند به راحتی زیر ویژگی های نقاشی ها پنهان بشوند (برای مثال نقطه Pivot یک دم اسبیِ لینک شده به سر کاراکتر می تواند زیر یک روبان پنهان بشود).

source: Preproduction: Storyboard
fa: پیش تولید: استوری بورد

source: While usually the storyboard is used by the director to control the rhythm of the action, in case of a paperless production it also identifies all the elements needed for the production of each scene, by listing all of the character animations and poses, and identifying all of the props and backgrounds that are needed to implement the story.
fa: در حالی که معمولا StoryBoard برای کنترل ریتم Action توسط کارگردان استفاده می شود، در مورد یک تولید بی کاغذ اون همچنین تمام المان های مورد نیاز برای تولید هر صحنه را شناسایی می کند، با لیست کردن تمام انیمیشن ها و Pose های کاراکتر، و شناسایی تمام Prop ها و پس زمینه هایی که برای پیاده سازی داستان مورد نیاز هستند.

source: Animatic
fa: انیماتیک

source: The animatic is created starting from the scanned storyboard drawings. In Tahoma, or in a third-party software, the storyboard drawings are imported, timing is adjusted and camera movements are set. Audio files too can be imported for reference.
fa: انیماتیک با شروع از نقاشی های اسکن شده استوری بورد ایجاد می شود. در تاهوما، یا در یک نرم افزار شخص ثالث، نقاشی های استوری بورد Import می شوند، زمان بندی میزان می شود و حرکات دوربین تنظیم می شوند. فایل های صوتی هم می توانند برای رفرنس Import بشوند.

source: In case the animatic is created in Tahoma, it can also be split so that each cut can be used as a starting point for the final compositing of each scene.
fa: در موردی که انیماتیک در تاهوما ایجاد بشود، اون همچنین می تواند Split بشود به طوری که هر کات بتواند به عنوان یک نقطه شروع برای کامپوزیت نهایی هر صحنه استفاده بشود.

source: Libraries
fa: لایبری ها

source: Libraries are prepared by drawing directly in Tahoma all of the elements composing the scenes, such as locations, characters, props, etc.
fa: Library ها با نقاشی تمام المان هایی که صحنه ها را تشکیل می دهند آماده می شوند؛ مثل لوکیشن ها، کاراکتر ها، Prop ها و... مستقیما در تاهوما.

source: As far as the characters are concerned, they will be decomposed in multiple levels (i.e. head, torso, arms etc.) used as skeleton components rejoined through a hierarchy which at the end will make models available to the animators.
fa: تا آنجایی که کاراکتر ها مرتبط هستند، آنها در چندین Level تجزیه می شوند (یعنی سر، نیم تنه، بازو ها و...) که به عنوان اجزاء استخوان بندی ای استفاده می شوند که دوباره به هم پیوستند از طریق یک سلسله مراتب که در آخر مدل ها را برای انیماتور ها در دسترس قرار می دهد.

source: According to the storyboard analysis, the drawings needed both for the canonical turn-around model (i.e. a collection of models as seen from different points of view: front, back, side and three-quarter views) and for additional movements are prepared. Starting from these reference animations, such as running or walking cycles, jumping, may be stored as well in order to be re-used in the scene production.
fa: با توجه به آنالیز StoryBoard، نقاشی هایی که هم برای مدل مرسوم Turn-Around (یعنی یک کالکشن از مدل ها که از نقاط دید متفاوتی دیده می شوند: نما های جلو، پشت، کنار و سه چهارم) و هم برای Movement های اضافی، مورد نیاز هستند آماده می شوند. با شروع از اینها انیمیشن های رفرنس، مثل چرخه های دوییدن یا راه رفتن، پرش، ممکن است همچنین به منظور دوباره استفاده شدن در تولید صحنه ذخیره بشوند.

source: Props and backgrounds can be also created with third-party software, including rendered images from 3D software.
fa: Prop ها و پس زمینه ها می توانند همچنین با نرم افزار شخص ثالث ایجاد بشوند، شامل تصاویر رندر شده از نرم افزار سه بعدی.

source: See :ref:`Drawing Animation Levels <drawing_animation_levels>` and :ref:`Creating Cutout Animation <creating_cutout_animation>` .
fa: ببینید :ref:`Drawing Animation Levels <drawing_animation_levels>` و :ref:`Creating Cutout Animation <creating_cutout_animation>` .

source: Layout
fa: لی اوت

source: In the layout phase, all of the elements that are necessary for the scene (backgrounds, props, characters, reference animations) are loaded from the library in Xsheet, usually as Subscenes. They are put in place according to the animatic. Basic animation is achieved by setting key positions for animated characters or importing reference animations.
fa: در فاز Layout، تمام المان هایی که برای صحنه لازم اند (پس زمینه ها، Prop ها، کاراکتر ها، انیمیشن های رفرنس) از Library در Xsheet لود می شوند؛ معمولا به عنوان SubScene ها. آنها با توجه به انیماتیک در جای خود قرار می گیرند. انیمیشن پایه با تنظیم کردن Position های کلیدی برای کاراکتر های انیمیت شده یا وارد کردن انیمیشن های رفرنس به دست می آید.

source: Camera movements and animation timing previously set in the animatic are refined.
fa: حرکات دوربین و زمان بندی انیمیشن که قبلا در انیماتیک تنظیم شده بودند ReFine می شوند.

source: See :ref:`Working in Xsheet <working_in_xsheet>` and :ref:`Using Subscenes <using_sub-xsheets>` .
fa: ببینید :ref:`Working in Xsheet <working_in_xsheet>` و :ref:`Using Subscenes <using_sub-xsheets>` .

source: Animation
fa: انیمیشن

source: The animation for the scene defined in the layout is refined by adding key position to the character movements. Character poses are added by tweaking the model to achieve a more fluid animation.
fa: انیمیشنِ برای صحنه که در Layout تعریف شده بود با اضافه کردن Position کلیدی به حرکات کاراکتر ReFine می شود. Pose های کاراکتر با دست کاری مدل برای دستیابی به یک انیمیشن روان تر اضافه می شوند.

source: The right speed for all the movements is set by controlling interpolation mode in the function editor.
fa: سرعت درست برای تمام حرکات با کنترل Interpolation Mode در Function Editor تنظیم می شود.

source: See :ref:`Animating Objects <animating_objects>` and :ref:`Using the Function Editor <using_the_function_editor>` .
fa: ببینید :ref:`Animating Objects <animating_objects>` و :ref:`Using the Function Editor <using_the_function_editor>` .

source: Special FX
fa: جلوه های ویژه

source: Special FX, such as blur, glow, color corrections, particles, are applied to the scene elements.
fa: جلوه های ویژه، مثل Blur و Glow و Color Correction ها، Particle ها، روی المان های صحنه اعمال می شوند.

source: Additional animation elements related to special FX, for example masks or images for the particles effect, are drawn directly in the scene, or imported from external files.
fa: المان های انیمیشن اضافی مرتبط به جلوه های ویژه، برای مثال Mask ها یا تصاویر برای Particles Effect، مستقیما در صحنه کشیده می شوند، یا از فایل های خارجی Import می شوند.

source: See :ref:`Applying Special FX <applying_special_fx>` .
fa: ببینید :ref:`Applying Special FX <applying_special_fx>` .

source: Render
fa: رندر

source: The scene has to be rendered in order to compose all the transformations and applied special FX in a sequence of frames in the format and resolution you prefer.
fa: صحنه به منظور ترکیب تمام Transformation ها و جلوه های ویژه ی اعمال شده، در یک توالی از فریم ها در فرمت و رزولوشنی که شما ترجیح می دهید باید رندر بشود.
