Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/setting_up_a_scene.po
Languages: ru

source: Setting Up a Scene
ru: Настройка сцены

source: Scene Settings and Project Default Settings
ru: Настройки сцены и настройки проекта по умолчанию

source: When you start working on a scene, automatically it will belong to the current project, inheriting its settings and default folders. In this way all the scenes belonging to a project are created with the same settings, assuring the consistency of the production (see :ref:`Managing Projects <managing_projects>` ).
ru: Когда вы начинаете работать над сценой, она автоматически будет принадлежать текущему проекту, наследуя ее настройки и папки по умолчанию. Таким образом, все сцены, принадлежащие проекту, создаются с одинаковыми настройками, что обеспечивает согласованность производства (см. :ref:`Управление проектами <managing_projects>`).

source: Settings concern different tasks you may perform in OpenToonz, such as the scanning, or cleanup process, the camera size and resolution, the frame rate, the output options, etc. They can be accessed in dialogs you can open with commands available in the related menu; for example the scan and cleanup settings commands are available in the Scan & Cleanup menu.
ru: Настройки касаются различных задач, которые вы можете выполнять в OpenToonz, таких как сканирование или очистка, размер и разрешение камеры, частота кадров, параметры вывода и т.д. Доступ к ним можно получить в диалоговых окнах, которые можно открыть с помощью команд, доступных в соответствующей меню; например, команды настроек сканирования и очистки доступны в меню «Сканирование и очистка».

source: Settings for a particular scene can always be changed independently from the other ones, and will be automatically saved when the scene is saved.
ru: Настройки для определенной сцены всегда можно изменить независимо от других, и они будут автоматически сохранены при сохранении сцены.

source: If you want to change the default values you can save current scene settings as default, so that all new scenes created for that project will have those values.
ru: Если вы хотите изменить значения по умолчанию, вы можете сохранить текущие настройки сцены по умолчанию, чтобы все новые сцены, созданные для этого проекта, имели эти значения.

source: **To save current scene settings as project default settings:**
ru: **Чтобы сохранить текущие настройки сцены как настройки проекта по умолчанию:**

source: Select File > Save Default Settings: all the settings from the current scene will become the project default.
ru: Выберите Файл > Сохранить настройки по умолчанию: все настройки текущей сцены станут настройками проекта по умолчанию.

source: Choosing the Working Unit
ru: Выбор рабочей единицы

source: Positions, distances and sizes can be expressed in several units of measure: inches, millimeters, centimeters, fields and pixels.
ru: Позиции, расстояния и размеры могут быть выражены в нескольких единицах измерения: дюймах, миллиметрах, сантиметрах, полях и пикселах.

source: The field unit is equal to 1/2 inch on the horizontal dimension, and it depends on the A/R set in the field guide information of the Scene Settings... dialog on the vertical dimension (see :ref:`Using the Viewer <using_the_work_area>` ). For example if the A/R value is 1.77778, two horizontal fields are equal to an inch, while one vertical field equals to an inch divided by 1.77778.
ru: Единица поля равна половине дюйма по горизонтальном измерении, и это зависит от A/R, установленного в справочной информации о полях в диалоговом окне «Настройки сцены ...» для вертикального размера (см. :ref:`Использование просмотрщика <using_the_work_area>`). Например, если значение A/R равно 1,77778, два горизонтальных поля равны дюйму, а одно вертикальное поле равно дюйму, деленному на 1,77778.

source: In the Files > Preferences > Interface dialog you can set the following default units:
ru: В диалоговом окне «Файлы» > «Настройки программы» > «Интерфейс» вы можете установить следующие единицы измерения по умолчанию:

source: The Unit is used to display all measures in text fields, and applied when moving or changing the size of stage objects.
ru: Единица используется для отображения всех мер в текстовых полях и применяется при перемещении или изменении размера объектов сцены.

source: The Camera Unit is used to display and define the camera size in the Xsheet > Camera Settings... dialog (see :ref:`Defining Camera Settings <defining_camera_settings>` ).
ru: Блок камеры используется для отображения и определения размера камеры в диалоговом окне Xsheet > Настройки камеры (см. :ref:`Определение настроек камеры <defining_camera_settings>`).

source: You can also express values in an unit different from the default one by entering any of the following units and abbreviations: in, inch, " , ' ' (two apostrophes), cm, mm, fld, field and px, after the input value itself. As soon as the value is entered it's converted in the default unit.
ru: Вы также можете выразить значения в единицах, отличных от единицы по умолчанию, введя любую из следующих единиц и сокращений: in, inch, ", '' (два апострофа), cm, mm, fld, field и px после входного значения сама. Как только значение введено, оно преобразуется в единицу измерения по умолчанию.

source: If a value without a specific unit is used, it is supposed to be expressed in the default unit.
ru: Если используется значение без определенной единицы, оно должно быть выражено в единице по умолчанию.

source: **To set the default working units:**
ru: **Чтобы установить рабочие единицы по умолчанию:**

source: Choose File > Preferences > Interface.
ru: Выберите «Файл» > «Настройки программы»> «Интерфейс».

source: Do one of the following:
ru: Выполните одно из следующих действий:

source: In the Unit option menu choose the unit you want to use as default.
ru: В меню параметров еденицы выберите еденицу, которую вы хотите использовать по умолчанию.

source: In the Camera Unit option menu choose the unit you want to use to express the camera size.
ru: В меню параметров Еденицы камеры выберите единицу измерения, которую вы хотите использовать для выражения размера камеры.

source: Setting the Frame Rate
ru: Установка частоты кадров

source: The frame rate is the number of frames per second of animation, and has to be set according to the type of output you have to render, for instance it should usually be 24 for cinematic production, 25 for PAL output, or 30 for NTSC.
ru: Частота кадров - это количество кадров в секунду анимации, которое должно быть установлено в соответствии с типом вывода, который вы хотите воспроизвести, например, оно обычно должно быть 24 для кинематографического производства, 25 для вывода PAL или 30 для NTSC.

source: The current scene frame rate can be set in the Scene Settings... dialog, and it is displayed in the bottom bar of any Viewer pane. In case the play back is activated, the actual frame rate is displayed on its left.
ru: Текущую частоту кадров сцены можно установить в диалоговом окне «Настройки сцены ...», и она отображается в нижней панели любой панели просмотра. В случае, если воспроизведение активировано, фактическая частота кадров отображается слева.

source: Apart from affecting the playback speed when previewing or rendering a scene, the frame rate also determines the frame count of an audio file when it is imported into the Xsheet (see :ref:`Creating a Soundtrack <creating_a_soundtrack>` ).
ru: Помимо влияния на скорость воспроизведения при предварительном просмотре или рендере сцены, частота кадров также определяет количество кадров аудиофайла при его импорте в Xsheet (см. :ref:`Создание звуковой дорожки <creating_a_soundtrack>`).

source: Even if a scene has been composited with a specific frame rate for a certain output, it is possible to render it out at a different frame rate by using the Stretch from FPS: To: option in the Output Settings > Other Settings dialog (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
ru: Даже если сцена была составлена ​​с определенной частотой кадров для определенного выхода, ее можно отобразить с другой частотой кадров, используя параметр «Растяжка по FPS:» в диалоговом окне «Настройки вывода» > «Другие настройки» (см. :ref:`Выбор настроек вывода <choosing_the_output_settings>`).

source: **To set the frame rate:**
ru: **Чтобы установить частоту кадров:**

source: Choose Xsheet > Scene Settings...
ru: Выберите Xsheet > Настройки сцены...

source: In the Frame Rate text field set the frame rate value.
ru: В текстовом поле Частота кадров установите значение частоты кадров.

source: Defining Camera Settings
ru: Определение настроек камеры

source: The Camera Settings... dialog, that can be opened from the Xsheet menu, contains parameters for defining the current camera size and resolution.
ru: Диалоговое окно Настройка камеры... , которое можно открыть из меню Xsheet, содержит параметры для определения текущего размера и разрешения камеры.

source: More than one camera can be defined for each scene, in order to have different output resolutions, or to shot only a particular area of the scene (see :ref:`Using the Stage Schematic <using_the_stage_schematic>` ).
ru: Для каждой сцены можно определить более одной камеры, чтобы иметь разные выходные разрешения или для съемки только определенной области сцены (см. :ref:`Использование схемы сцены <using_the_stage_schematic>`).

source: The camera size can be expressed in any unit, but will be visualized in the default one chosen in the Preferences > Interface dialog (see :ref:`Choosing the Working Unit <choosing_the_working_unit>` ).
ru: Размер камеры может быть выражен в любой единице, но будет отображаться в стандартной по умолчанию, выбранной в диалоговом окне Настройки программы > Интерфейс (см. :ref:`Выбор рабочей единицы <choosing_the_working_unit>`).

source: In OpenToonz the Camera is defined by different parameters:
ru: В OpenToonz Камера определяется различными параметрами:

source: X (Width) and Y (Height) size of the camera, expressed in the default Camera Unit (usually inches).
ru: Размер камеры X (ширина) и Y (высота), выраженный в Единицах камеры по умолчанию (обычно в дюймах).

source: A/R is the aspect ratio value resulting by dividing Width/Height.
ru: A/R - это соотношение сторон, полученное в результате деления ширины/высоты.

source: X and Y resolution Pixels of the resulting image seen by the camera.
ru: Разрешение X и Y Пиксели полученного изображения, видимого камерой.

source: X and Y DPI values, calculated using the standard formulas: XDpi=XPx/Width, and YDpi=YPx/Height. This two fields can be forced to have the same value, by activating the equal-sign button between them.
ru: Значения X и Y DPI, рассчитанные по стандартным формулам: XDpi = XPx / Ширина и YDpi = YPx / Высота. Эти два поля могут иметь одно и то же значение, активируя кнопку знака равенства между ними.

source: When inserting a value in one field, the others change accordingly as needed for having a consistent camera. You can decide which set of values has to be considered fixed by OpenToonz. The lock-shaped buttons and the radio buttons at the leftmost column of the camera parameters, let you select which column and row of values has to be preserved by OpenToonz, while changing the others as needed.
ru: При вставке значения в одно поле остальные изменяются соответственно по мере необходимости для согласованной камеры. Вы можете решить, какой набор значений должен считаться фиксированным OpenToonz. Кнопки в форме замка и переключатели в крайнем левом столбце параметров камеры позволяют выбрать, какой столбец и ряд значений должны быть сохранены OpenToonz, при этом изменяя другие при необходимости.

source: The Use Current Level Settings button let you set the camera for framing exactly the content of the selected level. Just press this button and OpenToonz will calculate the appropriate values for the camera.
ru: Кнопка «Использовать настройки текущего уровня» позволяет настроить камеру для точного кадрирования содержимого выбранного уровня. Просто нажмите эту кнопку, и OpenToonz рассчитает соответствующие значения для камеры.

source: Camera resolutions can also be selected from a list of predefined camera settings. You can add any camera preset you define to the list, as well as remove any predefined camera from it.
ru: Разрешения камеры также могут быть выбраны из списка предустановленных настроек камеры. Вы можете добавить любую предустановку камеры, которую вы определили, в список, а также удалить любую предопределенную камеру из него.

source: The predefined cameras list is saved in the file ``reslist.txt`` stored in the projectroot (see :ref:`Setting the Projectroot <setting_the_projectroot>` ).
ru: Предопределенный список камер сохраняется в файле ``reslist.txt``, хранящемся в projectroot (см. :ref:`Настройка Projectroot <setting_the_projectroot>`).

source: **To add a preset camera resolution:**
ru: **Чтобы добавить предустановку разрешения камеры:**

source: Set the resolution and A/R for the camera you want to save.
ru: Установите разрешение и A/R для камеры, которую вы хотите сохранить.

source: Click the Add button on the right of the preset cameras list.
ru: Нажмите кнопку «Добавить» справа от списка предустановленных камер.

source: Assign a name to the camera resolution and click the OK button.
ru: Присвойте имя разрешению камеры и нажмите кнопку ОК.

source: **To remove a preset camera resolution:**
ru: **Чтобы удалить предустановленное разрешение камеры:**

source: Select the camera resolution you want to remove in the preset cameras list.
ru: Выберите разрешение камеры, которое вы хотите удалить, в списке предустановленных камер.

source: Click the Remove button on the right of the preset cameras list.
ru: Нажмите кнопку «Удалить» справа от списка предустановленных камер.

source: Assigning Memory for the Undo Operations
ru: Назначение памяти для операций отмены

source: All the operations performed in the software can be undone by using the Edit > Undo command, even to go back for several steps.
ru: Все операции, выполняемые в программном обеспечении, можно отменить с помощью команды «Правка»> «Отменить», даже чтобы вернуться на несколько шагов назад.

source: Undo operations require computer memory in order to be performed, and some of them may require more memory than some others, according to their complexity.
ru: Операции отмены требуют компьютерной памяти для выполнения, и некоторые из них могут требовать больше памяти, чем другие, в зависимости от их сложности.

source: To prevent most of the computer memory to be used by undo operations while you work, a situation that slows down the software performance, it is possible to set a limit for it by specifying the Undo Memory Size (MB) in the Files > Preferences > General dialog.
ru: Чтобы предотвратить использование большей части памяти компьютера операциями отмены во время работы, что может привести к снижению производительности программного обеспечения, можно установить для нее ограничение, указав размер памяти для отмены (МБ) в меню «Файл» > «Настройки программы» > Общие.

source: As soon as the limit is reached, the oldest undo operations will be discarded to make room for the new ones.
ru: Как только предел достигнут, самые старые операции отмены будут отброшены, чтобы освободить место для новых.

source: Optimizing the Memory Usage
ru: Оптимизация использования памяти

source: When working with Raster images, predominantly being animation levels scanned with OpenToonz or GTS, an extensive usage of computer memory may be required during the cleanup, painting and rendering processes.
ru: При работе с растровыми изображениями, которые в основном представляют собой уровни анимации, сканируемые с помощью OpenToonz или GTS, может потребоваться интенсивное использование компьютерной памяти во время процессов очистки, рисования и рендера.

source: After a certain amount of time the computer performance may worsen, as the memory gets fragmented because of the several writing and reading accesses. To prevent this behavior, the Minimize Raster Memory Fragmentation* option can be activated in the Files > Preferences > General dialog. When activated, a section of computer memory is reserved and used only for operations concerning Raster images.
ru: Через некоторое время производительность компьютера может ухудшиться, так как память фрагментируется из-за нескольких обращений к записи и чтению. Чтобы избежать этого, можно включить параметр «Свернуть фрагментацию растровой памяти» в диалоговом окне «Файл» > «Настройка программы» > «Общие». При активации часть памяти компьютера резервируется и используется только для операций с растровыми изображениями.

source: If you are working mainly with vector images, that have been drawn inside OpenToonz, this option should be deactivated, as the reserved memory section would be otherwise unused by the computer.
ru: Если вы работаете в основном с векторными изображениями, которые были нарисованы внутри OpenToonz, этот параметр должен быть деактивирован, так как в противном случае раздел зарезервированной памяти не будет использоваться компьютером.

source: The change set for this option is valid only after OpenToonz is restarted.
ru: Набор изменений для этой опции действителен только после перезапуска OpenToonz.
