Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/using_ffmpeg_with_opentoonz.po
Languages: ru

source: Using FFmpeg with OpenToonz
ru: Использование FFmpeg с OpenToonz

source: What is FFmpeg?
ru: Что такое FFmpeg?

source: To render your animation as an **mp4** or **webm**, or also as a **gif** on Mac, OpenToonz requires the FFmpeg multimedia framework to be installed on your machine.
ru: Чтобы визуализировать анимацию в виде **mp4** или **webm**, а также в виде **gif** на Mac, OpenToonz требует, чтобы на вашем компьютере была установлена ​​мультимедийная инфраструктура FFmpeg.

source: For more information, please visit this page: `About FFmpeg <https://www.ffmpeg.org/about.html>`_
ru: Для получения дополнительной информации, пожалуйста, посетите эту страницу: `О FFmpeg <https://www.ffmpeg.org/about.html>`_

source: Installing FFmpeg for Windows
ru: Установка FFmpeg для Windows

source: Downloading
ru: Загрузка

source: To download FFmpeg, first visit this page: `Download FFmpeg <https://www.ffmpeg.org/download.html>`_
ru: Чтобы загрузить FFmpeg, сначала посетите эту страницу: `Загрузить FFmpeg <https://www.ffmpeg.org/download.html>`_

source: Select the Windows icon and then select the **Windows builds** link:
ru: Выберите значок Windows, а затем выберите ссылку **Windows builds**:

source: You will be taken to an **FFmpeg Builds** page with some options for the version of FFmpeg that you want to download:
ru: Вы попадете на страницу **FFmpeg Builds** с некоторыми опциями для версии FFmpeg, которую вы хотите загрузить:

source: In the majority of cases, the default choices are fine.
ru: В большинстве случаев, выбор по умолчанию в порядке.

source: Click on the blue **Download Build** button, this will begin downloading a zip archive containing FFmpeg.
ru: Нажмите на синюю кнопку **Download Build**, начнется загрузка zip-архива, содержащего FFmpeg.

source: Installing
ru: Установка

source: Once you have downloaded the FFmpeg zip archive, open it and double-click on the first folder.
ru: Как только вы загрузите zip-архив FFmpeg, откройте его и дважды щелкните первую папку.

source: Within the **bin** folder are the executable files that you will need.
ru: В папке **bin** находятся исполняемые файлы, которые вам понадобятся.

source: Create a new folder on your computer, the recommended location is **C:\\**.
ru: Создайте новую папку на вашем компьютере, рекомендуемое расположение - **C:\\**.

source: Name the new folder **FFmpeg**.
ru: Назовите новую папку **FFmpeg**.

source: Drag the contents of the **bin** folder from the archive into the newly created folder.
ru: Перетащите содержимое папки **bin** из архива во вновь созданную папку.

source: Next, start OpenToonz and open the **Preferences** window with ``File > Preferences...``
ru: Затем запустите OpenToonz и откройте окно **Настройки программы...** с ``Файл > Настройки программы...``

source: Navigate to the **Import/Export** category; at the top you will see a box with the text **FFmpeg path**.
ru: Перейдите в категорию **Импорт/Экспорт**; вверху вы увидите поле с текстом **Путь к FFmpeg**.

source: Insert the path to your FFmpeg folder that you created earlier, if you have used the recommended path, this will be **C:\\FFmpeg\\**:
ru: Вставьте путь к папке FFmpeg, которую вы создали ранее, если вы использовали рекомендуемый путь, это будет **C:\\FFmpeg\\**:

source: Restart OpenToonz.
ru: Перезапустите OpenToonz.

source: Open the **Output Settings** window with ``File > Output Settings...``
ru: Откройте окно **Настройки вывода** с помощью ``Файл > Настройки вывода ...``

source: In the **File Settings** subsection, you should now see **mp4** and **webm**.
ru: В подразделе **Настройки файла** вы должны увидеть **mp4** и **webm**.

source: Installing FFmpeg for Mac
ru: Установка FFmpeg для Mac

source: Select the Apple icon and select the **Static and Shared builds** link.
ru: Выберите значок Apple и выберите ссылку **Static и Shared build**.

source: Make sure **macOS 64-bit** is selected under the **Architecture** column.
ru: Убедитесь, что в столбце **Architecture** выбрано **macOS 64-bit**.

source: Open Finder and create a new folder, the **Applications/OpenToonz** folder is the recommended location.
ru: Откройте Finder и создайте новую папку, папка **Applications/OpenToonz** является рекомендуемым местом.

source: Name the new folder **FFmpeg**
ru: Назовите новую папку **FFmpeg**

source: Insert the path to your FFmpeg folder that you created earlier, if you have used the recommended path, this will be **/Applications/OpenToonz/FFmpeg**:
ru: Вставьте путь к папке FFmpeg, которую вы создали ранее, если вы использовали рекомендуемый путь, это будет **/Applications/OpenToonz/FFmpeg**:

source: In the **File Settings** subsection, you should now see **mp4**, **webm** and **gif**.
ru: В подразделе **Настройки файла** вы должны увидеть **mp4**, **webm** и **gif**.

source: Installing FFmpeg for Linux
ru: Установка FFmpeg для Linux

source: If you are using a other Linux distribution please refer to its documentation or visit the `FFmpeg website <https://www.ffmpeg.org/download.html>`_.
ru: Если вы используете другой дистрибутив Linux, обратитесь к его документации или посетите `сайт FFmpeg <https://www.ffmpeg.org/download.html>`_.

source: Start OpenToonz and open the **Preferences** window with ``File > Preferences...``
ru: Запустите OpenToonz и откройте окно **Настройки пользователя** с ``Файл > Настройки программы...``

source: Insert the path **/usr/bin**.
ru: Вставьте путь **/usr/bin**.
