Repository: ABelliqueux/tahoma2d_docs
Catalog: source/locale/*/LC_MESSAGES/using_ffmpeg_with_tahoma2D.po
Languages: fa

source: Using FFmpeg with Tahoma2D
fa: استفاده از FFmpeg با Tahoma2D

source: What is FFmpeg?
fa: FFmpeg چیست؟

source: To render your animation as an **mp4** or **webm**, or also as a **gif** on Mac, Tahoma2D requires the FFmpeg multimedia framework to be installed on your machine.
fa: برای رندر انیمیشن تان به عنوان یک **mp4** یا **webm**، یا همچنین به عنوان یک **gif** روی مک، Tahoma2D نیاز دارد که فریم ورک مالتی مدیا FFmpeg روی دستگاه شما نصب بشود.

source: For more information, please visit this page: `About FFmpeg <https://www.ffmpeg.org/about.html>`_
fa: برای اطلاعات بیشتر، لطفا این صفحه را ببینید: `About FFmpeg <https://www.ffmpeg.org/about.html>`_

source: Tahoma2D ships with a version of FFmpeg that is licensed under the LGPL license. This version can export .mp4 videos, but may not deliver as high quality videos as the GPL version of FFmpeg. You may want to change the version of FFmpeg that is used in Tahoma. To do so, follow the instructions below.
fa: Tahoma2D با یک نسخه از FFmpeg که تحت مجوز LGPL مجوز دهی شده است ارسال می شود. این نسخه می تواند ویدیو های .mp4 خروجی بگیرد، اما ممکن است ویدیو هایی به کیفیت بالایی نسخه GPL از FFmpeg تحویل ندهد. شما ممکن است بخواهید نسخه FFmpeg ای که در تاهوما استفاده شده است را تغییر بدهید. برای انجام این کار، دستورالعمل های زیر را دنبال کنید.

source: Installing FFmpeg for Windows
fa: نصب FFmpeg برای ویندوز

source: Downloading
fa: دانلود

source: To download FFmpeg, first visit this page: `Download FFmpeg <https://www.ffmpeg.org/download.html>`_
fa: برای دانلود FFmpeg، اول این صفحه را ببینید: `Download FFmpeg <https://www.ffmpeg.org/download.html>`_

source: Select the Windows icon and then select the **Windows builds** link:
fa: آیکون ویندوز را انتخاب و بعد لینک **Windows builds** را انتخاب کنید:

source: You will be taken to an **FFmpeg Builds** page with some options for the version of FFmpeg that you want to download:
fa: شما به یک صفحه **FFmpeg Builds** با یکسری گزینه ها برای نسخه FFmpeg ای که می خواهید دانلود کنید منتقل می شوید:

source: In the majority of cases, the default choices are fine.
fa: در اکثر موارد، انتخاب های پیش فرض مناسب اند.

source: Click on the blue **Download Build** button, this will begin downloading a zip archive containing FFmpeg.
fa: روی دکمه آبی **Download Build** کلیک کنید؛ این کار دانلود یک فایل زیپ حاوی FFmpeg را شروع می کند.

source: Installing
fa: نصب

source: Once you have downloaded the FFmpeg zip archive, open it and double-click on the first folder.
fa: وقتی شما فایل زیپ FFmpeg را دانلود کردید، آن را باز کنید و روی اولین پوشه دابل کلیک کنید.

source: Within the **bin** folder are the executable files that you will need.
fa: درون پوشه **bin** فایل های اجرایی ای که شما نیاز پیدا خواهید کرد هستند.

source: Create a new folder on your computer, the recommended location is **C:\\**.
fa: یک پوشه جدید بر روی کامپیوتر تان بسازید؛ مکان پیشنهاد شده **C:\\** می باشد.

source: Name the new folder **FFmpeg**.
fa: اسم پوشه جدید را **FFmpeg** بگذارید.

source: Drag the contents of the **bin** folder from the archive into the newly created folder.
fa: محتوای پوشه **bin** را از فایل فشرده به داخل پوشه جدیدا ساخته شده بکشید.

source: Next, start Tahoma2D and open the **Preferences** window with File → **Preferences...**
fa: سپس، Tahoma2D را اجرا کنید و پنجره **Preferences** را با File → **Preferences...** باز کنید

source: Navigate to the **Import/Export** category; at the top you will see a box with the text **FFmpeg path**.
fa: به دسته بندی **Import/Export** بروید؛ در بالا شما یک کادر با متن **FFmpeg path** می بینید.

source: Insert the path to your FFmpeg folder that you created earlier, if you have used the recommended path, this will be **C:\\FFmpeg\\**:
fa: مسیر پوشه FFmpeg تان که قبل تر ایجاد کردید را قرار بدهید؛ اگر شما از مسیر پیشنهادی استفاده کرده باشید، این **C:\\FFmpeg\\** خواهد بود:

source: Restart Tahoma.
fa: تاهوما را راه اندازی مجدد کنید.

source: Open the **Output Settings** window with Render → **Output Settings...**
fa: پنجره **Output Settings** را با Render → **Output Settings...** باز کنید

source: In the **File Settings** subsection, you should now see **mp4** and **webm**.
fa: در زیربخش **File Settings** شما باید حالا **mp4** و **webm** را ببینید.

source: Installing FFmpeg for Mac
fa: نصب FFmpeg برای مک

source: Select the Apple icon and select the **Static and Shared builds** link.
fa: آیکون اپل را انتخاب و لینک **Static and Shared builds** را انتخاب کنید.

source: Make sure **macOS 64-bit** is selected under the **Architecture** column.
fa: مطمئن شوید **macOS 64-bit** در ستون **Architecture** انتخاب شده است.

source: Open Finder and create a new folder, the **Applications/Tahoma** folder is the recommended location.
fa: Finder را باز کنید و یک پوشه جدید ایجاد کنید؛ پوشه **Applications/Tahoma** مکان پیشنهادی می باشد.

source: Name the new folder **FFmpeg**
fa: اسم پوشه جدید را **FFmpeg** بگذارید

source: For macOS 10.15 and later, each executable within the FFmpeg folder needs to be opened before using Tahoma2D (this only needs to be done one time, due to security features). In Finder, right-click on each executable (ffmpeg, ffprobe, and etc.) and select ``Open With → Terminal``. Once the Terminal windows have launched successfully, Terminal can be closed.
fa: برای macOS 10.15 و بعد تر، هر فایل اجرایی درون پوشه FFmpeg لازم است تا قبل استفاده از Tahoma2D باز بشود (این کار فقط لازم است که یک بار انجام بشود؛ به دلیل ویژگی های امنیتی). در Finder، روی هر فایل اجرایی (ffmpeg, ffprobe و...) راست کلیک کنید و ``Open With → Terminal`` را انتخاب کنید. وقتی که پنجره های ترمینال با موفقیت اجرا شدند، ترمینال می تواند بسته شود.

source: Insert the path to your FFmpeg folder that you created earlier, if you have used the recommended path, this will be **/Applications/Tahoma/FFmpeg**:
fa: مسیر پوشه FFmpeg تان که قبل تر ایجاد کردید را قرار بدهید؛ اگر شما از مسیر پیشنهادی استفاده کرده باشید، این **/Applications/Tahoma/FFmpeg** خواهد بود:

source: In the **File Settings** subsection, you should now see **mp4**, **webm** and **gif**.
fa: در زیربخش **File Settings** شما باید حالا **mp4**, **webm** و **gif** را ببینید.

source: Installing FFmpeg for Linux
fa: نصب FFmpeg برای لینوکس

source: To install FFmpeg, enter the following command in the shell depending on your distribution.
fa: برای نصب FFmpeg، دستور زیر را در shell وارد کنید بسته به توزیع تان.

source: Arch Linux: ``# pacman -S extra/ffmpeg``
fa: آرچ لینوکس: ``# pacman -S extra/ffmpeg``

source: Debian GNU/Linux: ``# apt install ffmpeg``
fa: دبیان گنو/لینوکس: ``# apt install ffmpeg``

source: Gentoo Linux: ``# emerge media-video/ffmpeg``
fa: جنتو لینوکس: ``# emerge media-video/ffmpeg``

source: Solus: ``# eopkg install ffmpeg``
fa: سولوس: ``# eopkg install ffmpeg``

source: If you are using a other Linux distribution please refer to its documentation or visit the `FFmpeg website <https://www.ffmpeg.org/download.html>`_.
fa: اگه شما از یک توزیع لینوکس دیگر استفاده می کنید لطفا به مستندات آن رجوع کنید یا `FFmpeg website <https://www.ffmpeg.org/download.html>`_ را ببینید.

source: To make it possible to export files in **mp4**, **webm** or **gif** formats, you need to specify the path to FFmpeg installed on your system, usually it is **/usr/bin/ffmpeg**. Enter command ``which ffmpeg`` in the shell to find out.
fa: برای ممکن ساختن اینکه فایل ها را در فرمت های **mp4**, **webm** یا **gif** خروجی بگیرید، شما نیاز دارید مسیر FFmpeg نصب شده بر روی سیستم تان را مشخص کنید؛ معمولا آن **/usr/bin/ffmpeg** می باشد. دستور ``which ffmpeg`` را برای فهمیدن در shell وارد کنید.

source: Start Tahoma2D and open the **Preferences** window with File → **Preferences...**
fa: Tahoma2D را اجرا کنید و پنجره **Preferences** را با File → **Preferences...** باز کنید

source: Insert the path **/usr/bin**.
fa: مسیر **/usr/bin** را قرار بدهید.
